[{"id":"R3JOFF6TPKKC7D","title":"Five Stars","text":"I love it","rating":5},{"id":"ROA2JC8ZL1XRV","title":"Five Stars","text":"It is a good phone..","rating":5},{"id":"R3JN4YSZQLYA2G","title":"Five Stars","text":"They are working just fine","rating":5},{"id":"R3OFO6DNOX41BX","title":"Five Stars","text":"Nice.","rating":5},{"id":"RZAO2VXZYS457","title":"Five Stars","text":"Great","rating":5},{"id":"R37B3P4RKUGO6Q","title":"Horrible!!","text":"Horrible!!! Not worth it. 2g speeds only? Wtf! Phone is completely garbage for email, GPS, music. Don't waste your money. I wouldn't even purchase this for kids. I bought this a week ago and now I have to buy a better phone for work. $50 down the drain. Battery is also junk and doesn't last.","rating":1},{"id":"R3BUDWX9N7A2R4","title":"Five Stars","text":"Great phone !!","rating":5},{"id":"R40UTVJYXO9WH","title":"Four Stars","text":"Nice cellphone","rating":4},{"id":"R3C5EH02URE84Y","title":"Five Stars","text":"Thanks","rating":5},{"id":"R3RORP1DQVDVC3","title":"Five Stars","text":"muy bueno","rating":5},{"id":"R1G6F3QUX06TBF","title":"Percent! S7 edge must buy!","text":"Absolutely hands down best protector. EASY to install. Keeping a blowdryer handy helps. Took me less than 20min. Looks just like I was hoping.","rating":5},{"id":"R1IN3GCOZG57YJ","title":"Excellent Phone!","text":"Great phone, it exceeded my expectations, good value for money, works perfectly right out of the box, I should have bought 2 !!","rating":5},{"id":"RUDFD03ASES8T","title":"Five Stars","text":"Best bang for my bucks.","rating":5},{"id":"R1DVGC273NACRW","title":"Five Stars","text":"my son like it","rating":5},{"id":"RLE2EDN8SO6MQ","title":"Five Stars","text":"Excellent product. I recommend very happy.","rating":5},{"id":"R3YCLE4P7W9TV","title":"five star","text":"My baby loves this phone.","rating":5},{"id":"R27V5BBB4ABE82","title":"One Star","text":"Not as represented.","rating":1},{"id":"R1NOXJSAYHYR7N","title":"A very good value. My services isn't as good as it ...","text":"A very good value.  My services isn't as good as it was with my iPhone. I don't like the reset and volume buttons on the side. They are too easy to hit accidently.","rating":3},{"id":"R2ZCPY9Z3QD75C","title":"Worked well for a month...","text":"To say I hate this phone is an understatement. I actually purchased this phone for my mother. She has had nothing but problems with it. Last week we finally gave up on it. This was part of a Christmas present, so it was used from 12/25/16. It worked well for about a month and then nothing but problems. Nonstop viruses. It freezes constantly. I have had to reset it countless times. I generally stick to using iPhones, so I'm not sure if this is a common issue with Android devices or if this one is particularly problematic. I ordered my mother an iPhone a few days ago and I'm happy that she will finally have a phone that she can use. Honestly, I'm embarrassed to have given this phone as a gift.","rating":1},{"id":"R2254TOIYG2K7I","title":"perfecy","text":"perfect for my needs!","rating":5},{"id":"R3K1YP23HTV9BE","title":"One Star","text":"Phone is cheap quality and this DOES NOT work with 4GLTE. stay away.","rating":1},{"id":"RWTWCTYGPY30E","title":"Horrible","text":"Phone doesn't work? Probably refurbished and sold as new.","rating":1},{"id":"R1EW8OZGWU9WY0","title":"I did not do well with the purchase. One ...","text":"I did not do well with the purchase. One of the phones came with the damaged camera. I do not know if I have a guarantee and how much it covers.","rating":1},{"id":"RWNXST5S3O4Z9","title":"Bad product","text":"Doesn't charge or download, it's nothing like I remember when I had BLU","rating":1},{"id":"R8DGQ04B0AE21","title":"One Star","text":"Didnt work. Hoping my replacement does","rating":1},{"id":"RM518HYOI9RJF","title":"It's n of phone just acts up a lot name ...","text":"It's n of phone just acts up a lot name deletes numbers and other things,  isnt worth the money,  I feel I got ripped off....","rating":1},{"id":"R2K738YY0JJ5CG","title":"... with T-Mobile works part of the time not a good purchase","text":"this phone is not compatible with T-Mobile works part of the time not a good purchase","rating":1},{"id":"R2AHS0XFK6EKPR","title":"One Star","text":"Phone only worked for a month...","rating":1},{"id":"R244DUSQ8NB0K1","title":"Used for two weeks and had to get a new ...","text":"Used for two weeks and had to get a new phone because as of 1/1/17 they no longer accept 2g phones!","rating":1},{"id":"R15NO2UN5AA5A4","title":"One Star","text":"One phone LCD screen is black, I can't see nothing, I want to return.pls reply me  that procedure.thanks","rating":1},{"id":"R3KNA16WLMFBYK","title":"Works great for a product of such price","text":"Works great for a product of such price. I successfully convinced an 91 year old lady to start using this smartphone. Apparently being able to see the updates of her grandchildren and video chatting with them is a big attraction.","rating":5},{"id":"RCWORUE1XD8SU","title":"Fantastic phone for little money!","text":"Feels good in your hand. Reception, sound and the gorilla glass screen are of excellent quality. Has two good quality cameras and the the case available from Amazon is a two-part sWonder why an $800+ is necessary...this one seems to have all you need.","rating":5},{"id":"R3QUCRNW2YXCXZ","title":"Makes a great gift on personal phone.","text":"Everything came on time all Parts new... Nice professional phone..  Pretty good for the price.","rating":5},{"id":"R2OLQBFQH94OZ5","title":"Five Stars","text":"Great Packaging Number 1 Amazon My highest rating AAAA++++ Just as Described!!!","rating":5},{"id":"R1LP98RJ7SJZV6","title":"This phone does not worth the bargain","text":"I did not understand why amazon is selling this archaic phone in modern era. DO NOT BUY IT OR REGRET IT LATER","rating":1},{"id":"R2DKUOM0RXMG3J","title":"Not supported by AT&T.","text":"This phone is not compatible with AT&T, we spent hours on the phone and in the store trying to get it to work.","rating":2},{"id":"R3D3XBTNG71VI2","title":"Great Value!","text":"Works the way it's suppose to; I purchased the phone for my stepson.  For the price it can't be beat.","rating":5},{"id":"R1ZJQX58UNX2IO","title":"Five Stars","text":"worked great in Ghana , West Africa. bought more for friends.","rating":5},{"id":"R60BX8IM7ISMW","title":"Doesnt look cheap","text":"This looks great. Not cheap but very nice. However the con's that I found was opening it and putting sim card in . Very hard to do. We bought it as a extra since we break things a lot. Very nice","rating":4},{"id":"R2N2Q9I3FIG74P","title":"Affordable Yet Great","text":"This phone is great if you're not looking to purchase a high end phone such as an iPhone. It works well, has an okay screen, but it runs awfully slow. That's expected from a phone with this low of a price point though, so you can't mark it down for that.Great budget phone, would recommend this to anyone looking for a budget smartphone!","rating":5},{"id":"R3MKXSP2AVKRUT","title":"HORRIBLE HORRIBLE PHONE","text":"HORRIBLE HORRIBLE PHONE!!!!!! No internal storage, no data, well at 2g speeds, its like having no data. I returned the phone and spent 10 dollars more on the Blu Advance 5.0, much much better phone","rating":1},{"id":"R21ECH50KBT7WJ","title":"The charger that arrived with the cell phone does not work","text":"The charger that arrived with the cell phone does not work, it turns out that I bought it and a relative brought it to my country (Venezuela), and it is to my surprise to connect the cell to the charger, this does not work. Where is the quality control?","rating":1},{"id":"R3LBKOR93FQPZO","title":"Read the extra fine print, because it doesn't say in the fine ...","text":"Didn't work.  And didn't get a full refund when I returned it.  Read the extra fine print, because it doesn't say in the fine print that you won't get all your money back when it doesn't work.","rating":1},{"id":"RYPSA0R65LJKO","title":"... my husband about 2 months ago and it worked great. Ad soon as the new year came in ...","text":"Bought this phone for my husband about 2 months ago and it worked great. Ad soon as the new year came in it has no service. We replenished his $60 prepaid  plan on 1/02/2017 and as of 1/05/2017 he has no service on the phone. It had no bars or nothing pertaining to 4G. This is a HD Smartphone. What gives??","rating":2},{"id":"R6056V8IRBT2R","title":"International use only","text":"This is an international phone only. Verizon Wireless could not use it. Very unhappy as I thought an unlocked phone was available anywhere.","rating":1},{"id":"R27NW0BUT1H24H","title":"It's 2017, a phone shouldn't be running KitKat.","text":"I had understandably low expectations when I bought this phone, but even those expectations were not met.SoftwareIt is hard to get an app to run for more than 30 seconds without it crashing, this happens with everything from google play music, to Facebook messenger, to the texting app.  I am not sure but I think this might be related to the outdated version of Android this phone is running, ie KitKat, from 2013.The phone has barely enough RAM to run android, as a result actions like changing a song in the music player, opening chrome, or pulling down the notification shade will frequently take several seconds.Battery life is decent, however charging from 20% to full took 8.5 hours.Lastly, build quality is extremely poor, the back panel almost broke from my attempts to access the sim card slot.  Once I had inserted my gsm sim card I found that I could not even use the phone as a phone because the sim card reader was broken.Don't waste $50 on this piece of garbage.","rating":1},{"id":"R15AQ0Y0PXTWDX","title":"WASTE OF MONEY","text":"Purchased this phone recently and in space of a month it stopped working..I sent it out to get looked at because I was thinking maybe something is wrong with the screen and the screen itself wasn't anywhere on the market.. VERY ODD. Not i am stuck trying to get another phone. WASTE OF MY MONEY!!!!","rating":1},{"id":"R13GVGHPO2TIBP","title":"just dont","text":"worked as expected for a week. once the week was up the back button stopped working, while in the text form it would spontaneougly space excessively, sometimes open random apps from the home screen. BLU is also facing a lawsuit for privacy violations on other models of their phones. basically all i'm saying is look anywhere but here.","rating":1},{"id":"R24T50C7P5RCNT","title":"Tiny tablet.","text":"I've had several Blu phones that served me well.  This one worked fine for the first couple weeks then it stopped connecting to the network.  I rebooted and reset it to factory and it still wouldn't work.  It still connects to the wifi,","rating":1},{"id":"R1H7ELUZQA55ZM","title":"Id never buy this phone again","text":"I would say be very careful with this phone with the area it gets its coverage from. I have not had nothing but trouble from this phone. I would not tell anyone to but this phone. I cant even talk to anyone using the speaker part of it. I would never buy this phone again","rating":1},{"id":"R1M4PSW3XN31T4","title":"OK for the purpose of having an unlocked phone. ...","text":"OK for the purpose of having an unlocked phone. Button very sensitive. I'm always calling people that I'm not meaning to call","rating":3},{"id":"R3LCD0WAPYTQX4","title":"Five Stars","text":"Perfect on vacation  music, pictures and games great","rating":5},{"id":"RAYDBM22GEFQZ","title":"Better than I expected","text":"Better than I expected. I bought this as a backup and very please with the look and feel and the smooth operation of this phone.","rating":5},{"id":"R2MNNIBYUN6MBY","title":"Four Stars","text":"Very good and fast if I recommend 100%","rating":4},{"id":"R2NP1OF7OA1ULS","title":"Three Stars","text":"Not too good","rating":3},{"id":"RJZXCBXKZEHWI","title":"Works!","text":"Im tech savy and love iphones only,, got this for my mom though and she loves it. Takes pictures pretty too","rating":4},{"id":"RP0Q9BFJ1HNW1","title":"I got what I paid for.","text":"My third BLUE. Best cell phone for the low price.","rating":5},{"id":"R2BBMR0D8VHW70","title":"Four Stars","text":"Its Ok","rating":4},{"id":"R3MKIRJQ2Q0BYR","title":"Horrible buy","text":"Horrible service,  couldn't download apps,  no internal memory.  All in all a bad buy , very dissapointing","rating":1},{"id":"R3DHGMFFLM02SP","title":"Three Stars","text":"Doesn't work on AT&T network","rating":3},{"id":"R39MPQKHFIKRRH","title":"Four Stars","text":"excelente","rating":4},{"id":"RCUM1YZG9W5Y2","title":"Five Stars","text":"bueno","rating":5},{"id":"R2JDNV2YRK963D","title":"Great phone","text":"Not a Samsung or an iPhone, but it's a great phone at a great bargain. Unlocked as stated, so I am quite pleased. No issues whatsoever.","rating":4},{"id":"R1M0BQT7346HO2","title":"No need to get a phone for hundreds of dollars anymore","text":"Good price and excellent job . A plus using it over seas. Already ready for use on any network and do anything in the social network.","rating":5},{"id":"RKQU4GBXL5FAP","title":"blu studio x8 HD","text":"The product to been of complete satisfaction, it works in a correct way, I want to say that hadta now it expires with the awaited expectations","rating":5},{"id":"R1OZN0Q3BYJ526","title":"Four Stars","text":"Bien","rating":4},{"id":"R29Z8HZNA55MMN","title":"This is a good cellphone, my girlfriend went at my house take ...","text":"This is a good cellphone, my girlfriend went at my house take the phone, She said:  good color, fast processing slot for 32gb. kiss and bye","rating":5},{"id":"R12Z15PQE54UDP","title":"Digicel works fine with it also","text":"brought this phone to use in Jamaica. Worked perfectly once I brought a Lime sim card and put in it. Digicel works fine with it also.","rating":5},{"id":"R1XTJE7079WQ3L","title":"Five Stars","text":"very good","rating":5},{"id":"RMFOD88KU2PB0","title":"Three Stars","text":"It's ok","rating":3},{"id":"RQ33Z7BOY860V","title":"BEST UNLOCKED PHONE FOR WEST AFRICA","text":"This product seems universal, I sent resent purchases to West Africa and it is compartable(works) with all the GSM services.Excellent for the price!","rating":4},{"id":"R3DU19E717BZJZ","title":"... and also mobile internet never work and battery not good there chitted me","text":"in web site mention this mobile was 3G/4G but thish mobile 2G and also mobile internet never work and battery not good there chitted me. exchange this mobile give me 3G mobile","rating":1},{"id":"RAUOSOGLD2STN","title":"Five Stars","text":"Great little phone with some cool features","rating":5},{"id":"R2GPBCJ0HE5ZV7","title":"Good Phone","text":"Good Phone.  really nice looking and easy to use","rating":5},{"id":"R2PKFCOHV9GTFP","title":"Five Stars","text":"works very well and the price is reasonable.","rating":5},{"id":"R325IXDKM9RG1C","title":"cellphone","text":"i love my new phone works great  and at a good price","rating":5},{"id":"ROD6XP4038R2J","title":"Five Stars","text":"great deal nice phone well worth the $$$$$","rating":5},{"id":"R18X6C6PHLTZ52","title":"Five Stars","text":"worked very well but mom needed a dumb phone","rating":5},{"id":"RKDV9REC55Q5V","title":"One Star","text":"I lost my money in this article","rating":1},{"id":"R3JZ0TAJU471IQ","title":"Five Stars","text":"It is great no problems, easy to use","rating":5},{"id":"R2U6PUFK94PI62","title":"Three Stars","text":"A good product for my mom.","rating":3},{"id":"R1T6BBVIK3G70X","title":"Four Stars","text":"Good phone","rating":4},{"id":"R3UVO1JP33ABT3","title":"... it don't hold a strong WiFi signal make call great but the speaker","text":"It OK for the money it don't hold a strong WiFi signal make call great  but the speaker suck","rating":3},{"id":"R1B6HQEIRW2SEZ","title":"Five Stars","text":"The truth is that if until the moment everything qood with the 2 phones i hace no complaints","rating":5},{"id":"RI9SZBTT0J4LR","title":"SIM card error in two days","text":"While it worked it was great. But in two days the SIM card could not be recognized. Have returned it now. Not happy.","rating":2},{"id":"R1EZHWQXGQ7K82","title":"Great for the price!","text":"I bought this phone for my little sister, and I love it. For the price, this phone offers more than expected!","rating":5},{"id":"REL3B4MQIC637","title":"Three Stars","text":"Too small in size","rating":3},{"id":"R2A9ISMJYPZPMJ","title":"Five Stars","text":"Excellent. The package arrived in perfect condition. The BLU met all my expectations.","rating":5},{"id":"R1D7X0SLLK4K84","title":"I received it right on time it is a good phone i can recommend customers to buy blu take ...","text":"I received it right on time it is a good phone i can recommend customers to buy blu take nice pic","rating":5},{"id":"RQQG329FU6IJ4","title":"Five Stars","text":"I like this phone because I can use this to my country","rating":5},{"id":"R2NVKFMBPDYCEK","title":"Short on Ram but working fine. Please make yourself a favor and insert an ...","text":"Short on Ram but working fine. Please make yourself a favor and insert an sd memory. Camera looks ok but not great. It's a budget phone, so it is just fine if you are not looking for something better.","rating":4},{"id":"R1PDAV7F9K0JWU","title":"I had to have phone replaced immeadiately and not just ...","text":"I had to have phone replaced immeadiately and not just 2 months later it crashes. Took it to get it rebooted and now its just screwy. Had to get a new phone. Don't buy this product","rating":1},{"id":"R2BVGVPVS79AIT","title":"Cant Use for facebook LIVE..","text":"The phone looks great And I received it alot earlier than expected ,,very fast Delivery nice phone the thing i dont like is that You CANT go LIVE on Facebook,but besides that its a good phone..","rating":2},{"id":"R3C1U7TO4ARUQU","title":"don't do it","text":"terrible phone. doesn't connect to my internet (fios)","rating":1},{"id":"R1T1SWJ1SO68MK","title":"is good phone for users task","text":"is good phone for users task, check email, calls, Facebook and others. The display es good, not excellent but enough. I am very happy, buy it for a 2 months USA and has been very useful.","rating":4},{"id":"R2GBY0WF8O76MH","title":"Five Stars","text":"excelente movil","rating":5},{"id":"R20U2M0GRIEM9X","title":"Five Stars","text":"works great","rating":5},{"id":"R2OPZUIUEW5NXL","title":"Five Stars","text":"good","rating":5},{"id":"R171DHSFWLN7HG","title":"Four Stars","text":"The product met my expectation.","rating":4},{"id":"R3KBASCB60OHN1","title":"not very reliable.","text":"Drops call very frequently, not very dependable.","rating":2},{"id":"R2ZHOLNA2U16G2","title":"One Star","text":"Not good at all","rating":1},{"id":"REUX4M6HHWY8T","title":"One Star","text":"P. O. S NEED MY MONEY BACK ASAP","rating":1},{"id":"R2X393IA5KYUB1","title":"I wouldn't recommend anyone to buy this","text":"Looks and feels so cheap. I wouldn't recommend anyone to buy this","rating":1},{"id":"R3SMBV08Z8UQH7","title":"One Star","text":"after about two or three weeks the phone doesn't connect to my provider","rating":1},{"id":"R1X0W2EAFNAX4D","title":"Really bad phone, had so many problems it","text":"Really bad phone , had so many problems it. I had to buy another one.","rating":1},{"id":"R2JEZ2PZYEP3Q8","title":"Two Stars","text":"Not really becose it doesn't have enough storage.","rating":2},{"id":"R19ABLQ9GUZQE6","title":"Seems to be working good. Arrived as expected in good condition","text":"Seems to be working good.  Arrived as expected in good condition.","rating":2},{"id":"R39695S05ZL57T","title":"Two Stars","text":"It never worked properly","rating":2},{"id":"R2E0TG37HS62C3","title":"One Star","text":"No phone has acted up very disappointed in the phone","rating":1},{"id":"R37LW5C0E6QINR","title":"One Star","text":"It's really bad. Network is not working.","rating":1},{"id":"R27V5BBB4ABE82","title":"One Star","text":"Not as represented.","rating":1},{"id":"R3LCD0WAPYTQX4","title":"Five Stars","text":"Perfect on vacation  music, pictures and games great","rating":5},{"id":"RP0Q9BFJ1HNW1","title":"I got what I paid for.","text":"My third BLUE. Best cell phone for the low price.","rating":5},{"id":"R2MNNIBYUN6MBY","title":"Four Stars","text":"Very good and fast if I recommend 100%","rating":4},{"id":"RQQG329FU6IJ4","title":"Five Stars","text":"I like this phone because I can use this to my country","rating":5},{"id":"RMFOD88KU2PB0","title":"Three Stars","text":"It's ok","rating":3},{"id":"R2XW2PBX2X9MW5","title":"Wouldn't accept AT&T service","text":"I must have gotten a dud because no matter what AT&T did. the phone would not accept service, got  a new SIM, reset everything, but no matter what, could not use the phone. Had to return...so sad. My previous BLU phone on the same account worked just fine. On the upside, return process is hassle free! Sadly cannot return the screen protector and case without paying more than the value in shipping...","rating":1},{"id":"R3DHGMFFLM02SP","title":"Three Stars","text":"Doesn't work on AT&T network","rating":3},{"id":"R2U6PUFK94PI62","title":"Three Stars","text":"A good product for my mom.","rating":3},{"id":"R2NP1OF7OA1ULS","title":"Three Stars","text":"Not too good","rating":3},{"id":"R267J7JRLN7VTC","title":"You won't believe what you get for 50$ bucks!","text":"I must say and admit I was a little concerned about this choice after I bought it but I said \"Well what the heck, let's give it a try!\" It was for my mom anyway but on paper it looked like a nice budget phone, and also I had extra concerns cause I'm not from usa so retuning this was out of the table. I had to accept whatever came on the box. Fortunately I was wrong.. The product came in perfect condition and brand new of course, no problems with packaging or shipping. And after first hands on the phone, you won't believe you pay 60 bucks (after taxes and handling) for this phone.. I MEAN IT! This guys  (BLU Inc. ) are doing an awesome job with budget phones. This phone is really awesome. Of course it doesn't look fancy or premium because it's obviously plastic but you fell like you have a 500$ phone in your hands..So if you are looking for a budget phone DO NOT hesitate of this one.. you won't be sorry!!","rating":5},{"id":"R20WLTUQ45Q2PJ","title":"Great Buy for my pre-teen","text":"I got this phone for my 12 year old daughter whose phone broke and I did not want to pay 200 for a deductible for a new one. I will just list pros and cons to make it easierPros:does not look cheapdecent sizecan get multiple apps as long as u get additional storageCamera is ok for the priceVery stylishCons:Opening it is an hassleHow to insert the sim card gets on my nerves and was confusinglack of directions gives you a headacheoverall for $50.00 the phone is definitely worth it. Now this is for my 12 year old. I would not buy the phone for myself unless I was on an extreme budget and needed something and I am 30. I asked my daughter for the review and she says that she loves it and is happy that I got it. I would definitely recommend buying a case and additional storage.","rating":4},{"id":"R1PYA1MKHIV21V","title":"The best cell phone I've had for a very low price","text":"The best cell phone I've had for a very low price. I love it works very well, I live in Venezuela and has excellent signal, use it with any carrier, good memory capacity. I recommend it for Latin America","rating":5},{"id":"R1Z3XMR1JWOD95","title":"you will come around a few problems like not being able to install many apps or running ...","text":"It's a very entry level android phone, you will come around a few problems like not being able to install many apps or running any new or currently updated apps without the phone running out of RAM or freezing. I recommend this for traveling or having an extra handset in case of emergencies when you lose or break your current phone. May also be good for the elderly who would like to learn to use current technology and not break the bank for it. Battery life is OK just like any phone, supports dual-sim card, BLU Android software is sub par.","rating":3},{"id":"R3E9A1HHVT6I3G","title":"There is a need to root this phone yet not all root apps or programs are good or safe to use","text":"Be aware that 700 million Android phones are plagued with a Chinese backdoor Virus that has plagued the Blu smartphones. Amazon has removed many of the models that were effected. This phone also arrived with tons of problems. You can factory reset the phone and the virus will continue to propagate. There is a need to root this phone yet not all root apps or programs are good or safe to use.For the moment, all vendors who were selling this phone are no longer selling it and only Amazon Warehouse is selling it.I edited my 5 star rating to 2 stars, and will hope to find a technical solution. I would advice not using kingroot","rating":2},{"id":"R3RQ98J7X29XYU","title":"Slow internet access","text":"Extremely slow phone. Takes forever to load on the internet","rating":1},{"id":"RU9RYRV2714WF","title":"More info desired","text":"Timely delivery, not much info on how to use it; I am a novice.  Found a manual online, so I could figure out how to install the battery.  The battery is used up in half a day, which is disappointing.  I heard later that, that was common with this brand of phone.  I would really like to know where to get a better battery for it.","rating":4},{"id":"R3USJ1FKKL8C9H","title":"Five Stars","text":"it is a really good phone for the price, i absolutely loved it and it did what it promises.","rating":5},{"id":"R3UK1GYG81Z3ZX","title":"GOOD BUY","text":"I purchased two BLU Studio X8 HD they have surpassed my expectation.  At first I didn't like the picture quality until I discovered 'Face beauty mode'. This feature allows your pic to look as though it was professionally done, It is a very good buy and the price is amazing.","rating":4},{"id":"R172GN2BN1ZRD1","title":"you get what you paid for a good starter phone for your kids a very fast phone","text":"you get what you paid for a good starter phone for your kids a very fast phone,has the look of an expensive phone without the price.The head phones are pretty good they last for a couple of hours.The best thing about this phone you pick the phone company you want whenever you want. I like this phone and it hasn't giving me any problems","rating":4},{"id":"RYXBI3FYAZVSI","title":"Mine must have been defective.","text":"I must have gotten a defective phone!  The battery, even if I did not use for pone calls had to be charged at least three times a day.  I had to send it back and purchased  another BLU phone in it's place.  Crossing my fingers!!!","rating":1},{"id":"R3VZYX6PXH8GE3","title":"Unable to hear the caller from this phone. Called ...","text":"Unable to hear the caller from this phone.  Called several people from this phone and none of them could hear me.","rating":1},{"id":"R2NUZ5KJF9GPY2","title":"shady business practices","text":"was working great but all of a sudden ads started showing up on the phone and it would turn on the data even when I turned it off. Buyer beware of this sellers shady business practices","rating":1},{"id":"R2T1FM6VF6E3BD","title":"Watching youtube videos on this is awesome.. I have it connected to my cable ...","text":"Watching youtube videos on this is awesome..I have it connected  to my cable wifi, so I dont need a phone plan..also makes a great skype phone","rating":5},{"id":"R384TDUFX669WW","title":"I'm satisfied.","text":"This is probably one of the cheapest gaming phones you're going to find. Build quality is meh but you get what you pay for. I'm satisfied.","rating":4},{"id":"R22A1YS0NVXYHD","title":"Cheap product, nothing but problems","text":"I bought this for my daughter and she's had nothing but problems. Locks up all the time, resetting several times a day. After a few months, it won't send/receive texts or calls. Will not buy Blu unless desperate for cheap product in a fix.","rating":2},{"id":"R1ZF1NN7B61O2T","title":"its good for the price","text":"its good for the price. But it has no support for 3G, 4G or LTE. Its so slow unless you buy a big SSD card","rating":2},{"id":"R5AB34PIDD4PJ","title":"Bad Budget Phone","text":"This phone not only freezes all the time but ads keep popping up on it. The wifi and data connection comes on without you turning them on. Wish I got a chance to return it before the time passed. Utterly frustrated.","rating":1},{"id":"R5330DJA02N12","title":"The phone is already shutting on and off there's definitely ...","text":"The phone is already shutting on and off there's definitely a malfunction, and the phone is way smaller than expectex","rating":1},{"id":"R2ETYUL9GNQNPE","title":"I loved the phone worked great","text":"I loved the phone worked great, camera also operates wonderfully and internet speed was good even though phone is 2g","rating":5},{"id":"R3KNA16WLMFBYK","title":"Works great for a product of such price","text":"Works great for a product of such price. I successfully convinced an 91 year old lady to start using this smartphone. Apparently being able to see the updates of her grandchildren and video chatting with them is a big attraction.","rating":5},{"id":"RSYC9YIF2WKFI","title":"Great phone for the price","text":"Great phone for the price!!! Runs smooth and fast, get a sd card and can use just like any other smart phone-without the sd card you are limited on apps","rating":5},{"id":"R9AEHOR4SX6FI","title":"I ordered this phone for my son for a Christmas ...","text":"I ordered this phone for my son for a Christmas gift. And we cannot get the phone to read the sim card. We have ordered 3 sim cards and it won't read them. We have bought so far 3 other blu phone and haven't had any problems. We are getting dicouraged. Please help","rating":3},{"id":"R2OLQBFQH94OZ5","title":"Five Stars","text":"Great Packaging Number 1 Amazon My highest rating AAAA++++ Just as Described!!!","rating":5},{"id":"R5AB34PIDD4PJ","title":"Bad Budget Phone","text":"This phone not only freezes all the time but ads keep popping up on it. The wifi and data connection comes on without you turning them on. Wish I got a chance to return it before the time passed. Utterly frustrated.","rating":1},{"id":"R2NUZ5KJF9GPY2","title":"shady business practices","text":"was working great but all of a sudden ads started showing up on the phone and it would turn on the data even when I turned it off. Buyer beware of this sellers shady business practices","rating":1},{"id":"R1ZJQX58UNX2IO","title":"Five Stars","text":"worked great in Ghana , West Africa. bought more for friends.","rating":5},{"id":"R27IEYDSP9LDU6","title":"Incredibly poor quality phone","text":"Very disappointed in this phone.  The first one arrived with a battery that wouldn't take a charge.  Assuming it was just a one-off problem, we exchanged it for the same phone.The camera is extremely poor quality- shots are blurry and out of focus.  The actual phone audio is terrible- can only hear calls by placing them on speaker mode.I have a Blu R1 HD and have really been impressed with it so I felt confident buying the Studio X8 but it is a really terrible phone.  Sorry, but don't waste your money.","rating":1},{"id":"R384TDUFX669WW","title":"I'm satisfied.","text":"This is probably one of the cheapest gaming phones you're going to find. Build quality is meh but you get what you pay for. I'm satisfied.","rating":4},{"id":"R3C1U7TO4ARUQU","title":"don't do it","text":"terrible phone. doesn't connect to my internet (fios)","rating":1}]