[{"id":"R1INRE7I7KPW88","title":"Four Stars","text":"Was able to use it internationally.","rating":4},{"id":"R13RJT5LGBKI3P","title":"Five Stars","text":"very pleased with this product","rating":5},{"id":"RR21TVZYTFGF9","title":"Four Stars","text":"Good for a kids starter phone.","rating":4},{"id":"R3FNSG11HB11BC","title":"Slow; unresponsive; weird market errors.","text":"I bought 2 of these phones as Christmas gifts for my kids. They are always asking to play Candy Crush or Talking Tom on our phones, so we decided to get them each one of their own. For the price, I thought this was a steal. After setting them up and trying to use them, I realized it was a robbery. Where my Note 3 takes a couple seconds to load Candy Crush, the Dash JR takes literally up to a full minute. Often times the kids would open it and just get some white screen. The market constantly crashed so downloading new games was impossible. I ended up returning them both and buying 2 of the Boost Mobile LG Volt. For $10 more each, I got a phone with Kit Kat (instead of Gingerbread which this phone runs), which has a much better front and rear camera (with flash), much faster processor, more RAM, much larger screen and everything works as expected. Please don't waste your money on this phone!","rating":2},{"id":"RAM8N5DY4SQ0Y","title":"It does not work well","text":"the phone does not work well, then I turned it on it goes crazy, I can not answer calls or messages, now after you restart I can not unlock it to access the phone functions. I do not know what to do.","rating":1},{"id":"R2E80QAJT87N9H","title":"I will say it works fantastic base on the impression i get from my stepdaughter","text":"This phone i bought this phone for my stepdaughter and she luv it more than breakfast lunch and dinner......I will say it works fantastic base on the impression i get from my stepdaughter.","rating":5},{"id":"R1UJDD5ILGGQL7","title":"False advertising","text":"Software problem (won't connect to my Google play store account for all my apps) !! Terrible customer service they refuse to answer polite emails requesting help.","rating":1},{"id":"R2KY2IP3AF4YD6","title":"This purchase was a waste of money","text":"This purchase was a waste of money. A full battery charge lasts for about 30 minutes. And the phone is made so cheaply that it almost looks and feels like a toy.","rating":1},{"id":"R1B52R5OF9H6ZM","title":"Doesn't have much storage and the camera isn't that clear ...","text":"Doesn't have much storage and the camera isn't that clear and it's a really small phone but it will work for your basic needs if you need something quick","rating":3},{"id":"RD7TZDSEPRDAS","title":"has very little internal memo, even installing an external ...","text":"has very little internal memo, even installing an external memory of 16GB can download programs, because they always need internal memory, not recommended","rating":1},{"id":"R3J2EYOU9U7TR3","title":"DON'T BUY THIS","text":"I needed an unlocked sim card phone for a trip to Costa Rica.  I read the reviews both positive and negative and decided for short term to just text, call and email this phone would be OK.  It wasn't OK.  Not even close to OK.  In addition to all the other negatives from other reviews I will add that the antenna on this phone is REALLY REALLY weak.  I never could make a phone call because at best I had 1 bar and the call didn't go through.  I never managed to get a text through but I did get the email to work.  Unfortunately, I could only send emails if I was sitting within 5 feet of the router.  Oh yeah, there is the battery life.  There isn't any.  OK, I'm exaggerating.  If you don't use it, it has a day or two.  If you forget to turn off Wi Fi you've got a couple hours.","rating":1},{"id":"RDN4M2KBNGWD6","title":"Blu Dash JR D141W Dual Sim Factory","text":"Nice little phone. I am not giving it a 5 star because of the small memory size, both RAM 256 but it works well as a basic phone which is what it is intended for - texting and phone calls. You cant install many apps on it....I just have whatsapp...and BB pin stalled....facebook already came installed. Camera is OK.MP3 player2G networkBluetooth v.2.1Android 2.3 (Gingerbread) OSGSM cell phone is WiFi capableMicroUSB 2.0 portRear 2-megapixel cameraFront VGA camera1.0 processorMP4 player3.5\" HVGA screenResolution: 320 x 480SMS and MMSEmailInstant messagingMade a small review which you can check out on youtube at...English - [...]Spanich - [...]","rating":4},{"id":"R28ESTUATND2Z0","title":"HOLY COW, don't buy this phone!","text":"I urge anyone reading this to not purchase this phone. I am not sure what I should have expected knowing the purchase price for a cell phone was so low, but I would have been able to overlook the extremely slow performance, lack of available storage and horrible camera quality if I could have gotten the phone to power on reliably. It would go to sleep, then we would have to hold in the power button to turn it back on sometime as many as 10 times to \"maybe\" get the phone to turn back on.Amazon was fantastic and took the thing back immediately which is a testament to their incredible service.I now understand that the \"DASH\" portion of the name describes the thoughtless manner in which they assemble these phones.","rating":1},{"id":"R8T5ANGCMD70E","title":"but if you are demanding with the performance but not have money you recommend that buy a Lumia 435 that is more cheap ...","text":"For a person that not is demanding with the performance of the cell, and you of a use very by under this well, but if you are demanding with the performance but not have money you recommend that buy a Lumia 435 that is more cheap and has best performance in all the senses","rating":2},{"id":"R2NZEQUEX07F8U","title":"The battery is very poor. After all that it actually works","text":"it's speaker is damaged, i can't hear the other pople talking from the other side and it  has its  details, internet loads very slow, the switch  for the screen on/off doesn't work very well, sometimes you have to push for a while , sometimes  you just need  one touch, so it is annoyng when  the screen doens't  display at the moment. dowloading from google play is the difficult, it goes very slow. i had to install What's app from a file APK. The battery is very poor.","rating":1},{"id":"R2O818AFXT2L0W","title":"First I thought this phone is not working with my ...","text":"First I thought this phone is not working with my sim card and I get to find out that I have to take the phone to the phone company for them to transfer my sim into this phone in order to work, but this phone is alright for the price.","rating":4},{"id":"R22EEYIDIN21EJ","title":"Horrible","text":"Absolutely the worst phone I have ever had. I can accept for the price not to have high expectations, but this is ridiculous.  I bought this phone as a international travel phone, but it is useless. I bought a 8gig sd card and it wont let me transfer any of the pre-installed apps. When i installed just Whatsapp the phone is out of storage. Dont buy this phone.","rating":1},{"id":"RTZPP215X96W3","title":"Absolutely the worst inexpensive phone I've ever encountered","text":"This product should not be on the market. Whoever at Amazon is responsible for acquiring this product should be fired immediately. Absolutely the worst inexpensive phone I've ever encountered. This was a starter phone for someone and after seeing it operation, I would not give it to dog to use.","rating":1},{"id":"R1ZESL0JQ7G7P7","title":"Issues on my phones","text":"Hi Srs. Amazon.On January this year I purchased 2 BLU Dash JR W D141w Unlocked GSM Dual-SIM... Phones from you.I got them about two months later due to delivery problems in my country Venezuela.After getting the  lines for them I started using them but one of the phone chargers didn't work to charge the phone battery at all, so I have used the second phone charger to charge both phones batteries.I would like to know if you can change the phone charger and at the same time I would like to buy two extra phone chargers for these two 2 BLU Dash JR W D141w Unlocked GSM Dual-SIM... phones.About the phones performance:One of the phones lost the phone directory I wrote into its own memory. I have written it again.The second phone works properly but it isn't able to keep the date for a long time so I have to write it over again now and then.Out of these troubles they are working properly as expected.Thanks for your timeGustavo Pernía","rating":4},{"id":"RK4RMP5Z6VHYH","title":"Never could get it to work.","text":"Start out by saying I love my BLU phones that I have had.  They were the more expensive ones, I liked the first one so much I replaced it with another one.  But this one, bought for a back up phone while my husband was in the hospital,  I never could get to work.  We took it to the AT&T store for a SIM card and activation with a new number and they tried and tried, even calling their support team, and it never would turn on/call/accept calls.  And yes, it was charged.  Unfortunately due to my husband having surgery and then me having an accidental injury myself, I missed the three week s\\window for returning the phone.  Lesson learned.  So now I have a phone that doesn't work.  Don't waste your money.  Just go get a GO phone, you will be much happier with it.","rating":1},{"id":"RZACTNFOCZB72","title":"Disappointed","text":"It was a cheap phone.  Complicated for a first time user.  Was happier with the Blu R1 HD unit.","rating":1},{"id":"RKEXYS7POFZPD","title":"Horrible Product","text":"Horrible product. I only gave it a 1 star rating because I had no choice . This product doesn't deserve any rating.Just started using it 7 days now and having no end of trouble. It freezes constantly .Seeking a replacement","rating":1},{"id":"R276LV8DRCRQM","title":"It doesn't function right. It turns it self off ...","text":"It doesn't function right. It turns it self off. I can hear when someone calls me but it plays the loud . .. not what I expected now am left with out a phone cause I don't have the money to return it to get another phone.","rating":1},{"id":"RAJ18H5RWUCEN","title":"It is a good phone for the 40.00 you spend on it.","text":"I have been told that this phone sounds better than my old one.  The flip camera is nice in being able to take selfies or normal pictures.  I am not able to find a case for this model anywhere.  It was also disappointing not to have a uhf hook up to charge from.","rating":4},{"id":"R1G1JPRKJ03NF6","title":"Get what you pay for. But we always hope for a deal.","text":"Very limited battery capacity, very little RAM or storage, a back level version of Android unable to use the benefits of the latest android apps.Purchased an RCA android Mobile for about 10 dollars more and it is an excellent phone with adequate resources. Battery lasts several days.","rating":2},{"id":"R3NATA09LB7ML","title":"I bought this phone for overseas travel and it worked ...","text":"I bought this phone for overseas travel and it worked perfectly well. Upon arrival, i bought a sim card, insert and startcalling and receiving calls immediately. For the price I give it a 5.","rating":5},{"id":"R1HTZD09QUJXYO","title":"Five Stars","text":"My daughter is happy","rating":5},{"id":"R1GGF3P4JE5UD6","title":"This telephone doesn't work well, when it goes to ...","text":"This telephone doesn't work well, when it goes to standby, the phone won't turn on again, I have to get the battery out to start the phone again. Dont recomend it at all, avoid this phone.","rating":1},{"id":"R3E6T8HNQT9AS3","title":"Sucks","text":"So this phone sucks. If I could give it a negative 5, then I would. It doesn't work unless it's plugged in and needless to say, my son doesn't approve of that. It takes away from being a cellphone.","rating":1},{"id":"RQ8VGQX4PFEOY","title":"This product requires a sim card to make it work ...","text":"This product requires a sim card to make it work and an sd card. It does not come with either of these. Then when i Did get them the phone still would not connect to play store even tho i was on wifi!!","rating":1},{"id":"R310VBC774URU5","title":"Completely useless unless you plan to make all your calls while ...","text":"I bought two and neither of them will keep a charge for more than a couple of minutes. Completely useless unless you plan to make all your calls while it's literally plugged into the wall.","rating":1},{"id":"RN9FHFDGQS3V9","title":"Terrible. I am now only using the radio feature","text":"It is an unbelievable phone.  Didn't expect during this era that a phone functions the way the Jnr. does.  Terrible.  I am now only using the radio feature.  That is the only feature that is consistent!","rating":1},{"id":"RWG6RMJFZ0NTC","title":"This is the worst piece of junk I've ever seen","text":"Firstly it takes me over 2 minutes just to power up the phone to unlock it. Secondly the memory is insufficient. Whenever you are on a call it malfunction. This is the worst piece of junk I've ever seen.","rating":1},{"id":"R3E0EDRBVPN7KP","title":"Responsable seller.","text":"Nice phone, it works with Movistar venezuela, movilnet and digitel venezuela. responsable seller. everything arrived on time. Thanks","rating":4},{"id":"RF8FZJEJMXOLX","title":"It was easy to find a plan but even after a sim ...","text":"It was easy to find a plan but even after a sim card was purchased the phone still will not allow my son to take pictures or download games","rating":1},{"id":"R3NDPY8L4RC12W","title":"Three Stars","text":"A lil smaller than expected, but serving a purpose for now","rating":3},{"id":"RQ0PD0BPT06DO","title":"Not good at all.","text":"Did not like this phone, too small memory, not lasting battery and crashes all the time.","rating":2},{"id":"R2FMUM8ZMH5A15","title":"Very dissapointed","text":"The phone is very slow when opening apps and going online. Trully dissapointed in it🙄😑You have to press really hard for touch screen to work and even turn lock it and unlock the screen for my to work.","rating":1},{"id":"RH76NHU1TIYLP","title":"I am very disappointed about this and the frequency at which the phone ...","text":"There are many difficulties accessing the internet using the WIFI feature..I am very disappointed about this and the frequency at which the phone has to recharge.","rating":2},{"id":"RAM8N5DY4SQ0Y","title":"It does not work well","text":"the phone does not work well, then I turned it on it goes crazy, I can not answer calls or messages, now after you restart I can not unlock it to access the phone functions. I do not know what to do.","rating":1},{"id":"RWG6RMJFZ0NTC","title":"This is the worst piece of junk I've ever seen","text":"Firstly it takes me over 2 minutes just to power up the phone to unlock it. Secondly the memory is insufficient. Whenever you are on a call it malfunction. This is the worst piece of junk I've ever seen.","rating":1},{"id":"R159RPE0OCSBE4","title":"Worst phone ever","text":"Worst phone ever. The phone only allowed me to download 1 app and the phone continued to freeze and stop responding after that. Terrible phone I'm sending it back.","rating":1},{"id":"RAJ18H5RWUCEN","title":"It is a good phone for the 40.00 you spend on it.","text":"I have been told that this phone sounds better than my old one.  The flip camera is nice in being able to take selfies or normal pictures.  I am not able to find a case for this model anywhere.  It was also disappointing not to have a uhf hook up to charge from.","rating":4},{"id":"R2FMUM8ZMH5A15","title":"Very dissapointed","text":"The phone is very slow when opening apps and going online. Trully dissapointed in it🙄😑You have to press really hard for touch screen to work and even turn lock it and unlock the screen for my to work.","rating":1},{"id":"R2G2CYNZD9L7AU","title":"Very Disappointed","text":"I got the phone within the expected shipping time and I was very excited to start using it. Unfortunately as soon as I opened the box, inserted my sim card and started using the phone I noticed that the camera on the phone would not work at all and gave me an error message when I tried to open the camera application and take a picture, saying that the memory is full although the phone is brand new. I even spent additional money and bought a memory card for the phone and it has not corrected the problem. I am very disappointed with the phone that was sold to me. I feel like I was robbed!","rating":1},{"id":"RXDWWAF7XH7IW","title":"It's good if you want a very basic smartphone for minimal ...","text":"It's good if you want a very basic smartphone for minimal use, but it is of very poor quality. The touchscreen is rather unreliable and the battery consistently dies right after I fully charge it. Memory is very small. I've used it successfully with SIM cards in Canada and Europe. Extremely difficult and time-consuming to connect to Wi-Fi networks.","rating":2},{"id":"R1D94QL22YA9I7","title":"Easy to operate","text":"This phone is a real pain.  Easy to operate, but, constantly has issues.  If the battery is the least bit weak, it drops calls constantly. Screen back light won't stay lit for any length of time...no matter how it is set up.  I have had this for 3 months & ready to dump it. Better inexpensive phones out there!","rating":1},{"id":"R28MVGBOAYHNVH","title":"update: battery exploded","text":"This phone was used a handful of times and the battery exploded. I knew i was getting a phone.with small memory. I thought it would have enough to run an app or two. Nope. I downloaded facebook and it left me without any space fo run it. I didnt.take any pics, no other apps, cleared my text messages, etc. Still no go. I gave it to my mom who is not at all interested in apps. Ill buy my tween a better phone.","rating":1},{"id":"R1G1JPRKJ03NF6","title":"Get what you pay for. But we always hope for a deal.","text":"Very limited battery capacity, very little RAM or storage, a back level version of Android unable to use the benefits of the latest android apps.Purchased an RCA android Mobile for about 10 dollars more and it is an excellent phone with adequate resources. Battery lasts several days.","rating":2},{"id":"RF8FZJEJMXOLX","title":"It was easy to find a plan but even after a sim ...","text":"It was easy to find a plan but even after a sim card was purchased the phone still will not allow my son to take pictures or download games","rating":1},{"id":"R1WLKOR4BT1KX","title":"also something is not good with the camera it looks green and when I ...","text":"hello,I'm vianneth camargo Im writting  you to report that the cellphone model: advanced 4.0 I bought on february does not work, it presents so many problems, the screen turns  white and when is turn on  for a while  it suddently turn off,also something is not good with the camera it looks green and when I try to take a picture the same is also green! I  appreciate and be glad if you answer to me what you can do to fix the problem with my order because i'm from venezuela.","rating":1},{"id":"RM3CSFMD4A0KZ","title":"worst purchase on amazon","text":"bought two of these for use in the caribbean, did not keep a good charge and unable to upload app which was the main reason for purchase","rating":1},{"id":"R3E0EDRBVPN7KP","title":"Responsable seller.","text":"Nice phone, it works with Movistar venezuela, movilnet and digitel venezuela. responsable seller. everything arrived on time. Thanks","rating":4},{"id":"R37QF45V6LY5VM","title":"Not powerful enough to run android","text":"I got this phone in May as a backup phone and it runs as you'd expect for $30 price. You need a micro SD, which is nice it has one, but if you take it out and forget, you're screwed. The Play Store is too slow to actually work, I downloaded about 5-10 apps and it stopped working. It will attempt to download apps for 15 minutes and then say it had an error. I'm on a very powerful WiFi network, so this should not be happening. The web browser works, it's very slow, but my main phone is an s7 so it probably would run fast for the targeted audience. The screen is washed out, but I say as long as you can see the screen (which you can) it shouldn't make you buy a different phone. I'm not saying you should get the phone, considering it tried to die on day two from memory errors. It took about 10 minutes until it'd stop giving me warnings and actually let me delete apps.The cameras are okay, but they're better than what I expected for $30. The pictures are way too sharpened and the colors are a bit off. Every pic of the sky has made it a light purple.The texting app is total garbage. Every message comes in individually, just like a flip phone. Pretty sad for an android device.Don't get the phone if you're able to save up a little extra money, for only $80 the Galaxy Core Prime is a much better deal.My video review is here> [...]Overall the phone is slow and confusing, not really a good mixture.","rating":3},{"id":"RLQBNJY92YCDB","title":"What a waste of money","text":"DO NOT BUY this piece of junk ! This product is a scam. I bought if for my sister to use with an international SIM card. Although I added a 8 giga mini sd card to it , it kept saying there is no memory on the phone and I couldn't even transfer any apps from the phone's memory to the sd card. Also , it did not connect to my wifi signal. What a waste of money !","rating":1},{"id":"R3BXSGJAQHK6QS","title":"worthless phone","text":"I bought this phone in April. Now it July and I getting a new phone. The storage on the phone is not good at all. I can't even update the phone because there not enough internal storage and it will not update using a sd card. It shut off when you in a middle of a call... I never get a blu product again.  If I could I would give it zero star.","rating":1},{"id":"R3PYGX0HFKXHAM","title":"Memory problem","text":"Haven't used it yet for phone calls.But when I check memory, I see 84mb used storage, and 36mb free after downloading google play (18mb) that's 120mb, not the  256 MB RAM advertised.  Even the 256 mb was an oversight, and I shouldn't have gotten it based on that.If you're going to get this, just get a flip phone.Yes, you can use a micro SD card.  Certain pieces of software can't be on the SD card though, and unless you like managing memory all the time, just spend a little more money and get more memory.","rating":2},{"id":"R15R4CD2SH4HVA","title":"Didn't work when I bought a SIM card in England","text":"Bought because it's an unlocked dual SIM card phone to take to England on vacation.  Bought a SIM card at the Louton Airport, had it installed by the sellers, and it NEVER WORKED.  Had to use it as a clock/alarm clock which is all it seems to be good for.","rating":1},{"id":"RQCJCTD10NWNR","title":"One Star","text":"This phone is terrible, very slow, short memory, google play don't work. Horrible, don't buy it!!!!!","rating":1},{"id":"R35A0SRDNG3QOT","title":"awful","text":"So not worth the money. Took forever to get here, crashes, doesn't accept an sd card, terrible camera and after two texts you have to restart it because its out of memory. Absolutely terrible quality all together.","rating":1},{"id":"RMW4CFQHI679G","title":"Horrible Horrible. Bought These 2 phones as a Gift ...","text":"Horrible Horrible.Bought These 2 phones as a Gift for My Relatives in Haiti/2 Pieces of Junk nothing works properly.What a waste.Now I have purchase 2 new phones because simply these phones are not what they are made to be.UUURRRGGGH!!!","rating":2},{"id":"RDT6662EKYAT7","title":"Avoid","text":"Avoid.  Purchased for a trip to Europe (combined with a SIM card and minutes/data purchased there.  Goal was to save money.  Failure. The phone, though new, retained a charge for only about 2 hours at a time, no matter the conditions.  And it only turned on on demand about 1/2 the time.  On the good side, when it did work, the display and sound were surprisingly good.  Didn't pay much, but got less than I paid for.","rating":1},{"id":"RAJ4M91JCES8I","title":"I bought it for a gif to a friend in ...","text":"I bought it for a gif to a friend in Venezuela but she told me that the memory is too small so it is almost impossible to download apps as Instagram or Facebook so keep on mind because I think that it is very important to know it .","rating":2},{"id":"R3F8RK3OO1OVU6","title":"Its okay","text":"I got this phone for my daughter knowing that she wouldn't be able to do too much the phone is great for younger kids like for emergencies that's what I bought it for she has like 2 games on there its only 8gb phone basically only good for calling and texting","rating":3},{"id":"RQCJCTD10NWNR","title":"One Star","text":"This phone is terrible, very slow, short memory, google play don't work. Horrible, don't buy it!!!!!","rating":1},{"id":"R3QJ6WQPKQM3PA","title":"No NO No NO No","text":"THE WORST!!! I cannot begin to tell you how terrible this product is. please please dont buy. This phone requires charging every hour, it powered down on its own. its just a total waste of money! the touchscreen is a nightmare, the camera is like looking through the eyes of someone wearing sunshades in the dark. less than 2h hours later, I had to switch phones. Na! dont buy!","rating":1},{"id":"R2ULJ0LW2Q88OQ","title":"This is the worst phone to get","text":"This is the worst phone to get, ,I bought this phone as a gift for my sister in the carriage an and it never worked,,not holding charge and not no screen face. I paid money and now I can't get my money back...UPSET","rating":1},{"id":"R1QKLKXPKH651Y","title":"If your a website developer using ghostlab or other simular software do not by this device.","text":"As a website developer I use a verity of mobile devices to ensure pages are properly displayed. I purchased this device because it was unlocked, therefore not requiring a phone service. I use these devices by connecting to my wireless router, which I was able to do. However, this device  will not load anything without a sims card, totally useless for me.","rating":1},{"id":"R1X5INGU3W0IQI","title":"So you definitely get what you pay for bought it for temporary use however within the short time of using it was a headache and","text":"Okay! So you definitely get what you pay for bought it for temporary use however within the short time of using it was a headache and pretty much annoying got calls and text which was the main use for it but in all it sucks don't waste your $$$ or time not worth it 👎🏼👎🏼👎🏼😑 and also it chooses when it wants to recognize your SIM card","rating":2},{"id":"R159RPE0OCSBE4","title":"Worst phone ever","text":"Worst phone ever. The phone only allowed me to download 1 app and the phone continued to freeze and stop responding after that. Terrible phone I'm sending it back.","rating":1},{"id":"R2T6B04EC2432G","title":"DO NOT BUY ITEM FAULTY","text":"I don't want to even give this phone one star, I bought this phone for my 4 year old son Christmas present an he's upset with me because he can't even use the phone because the play store would not work the only thing that seems to be working is the opera Mini browser an that is very slow. And yes I am connected to my wifi this phone was a waste of money an time I would not advise anyone to buy this product it's a total rip off.","rating":1},{"id":"R18DXRU0UYMGXK","title":"Not a good choice for app usage.","text":"Okay, if you only want to talk and text.  Got for my adult daughter, and she could download Facebook, but not enough memory to use it.  This should not be bought if you want to use any apps. I ended up getting something else.","rating":3},{"id":"R3TIV19AWGLTJL","title":"Can't say I would buy another but works fine but I would not use as my everyday phone ...","text":"Cheap basic phone seems to disconnect a lot during calls maybe because of face hitting buttons.  Can't say I would buy another but works fine but I would not use as my everyday phone unless I had no other option. This phone was purchased for my office.","rating":3},{"id":"R3F8RK3OO1OVU6","title":"Its okay","text":"I got this phone for my daughter knowing that she wouldn't be able to do too much the phone is great for younger kids like for emergencies that's what I bought it for she has like 2 games on there its only 8gb phone basically only good for calling and texting","rating":3},{"id":"RI5U5YUOE6CZM","title":"won't work on wifi","text":"why won't it connect to the play store or wifi?","rating":1},{"id":"R3JHOT2IOV3U11","title":"I like BLU phones","text":"I like BLU phones, but this one is not good. Small memory capacity, short battery life, bad internet and calls reception. sorry, it is the true. To be honest, I will like to return this phone. DO NOT BUY THIS PHONE","rating":1},{"id":"RYFZICTZQ2G1I","title":"Live in Learn go cheap n there goes ur money","text":"Didn't read the SIM card. Even the Cricket rep said it's the phone. My SIM card worked in every phone we tried in the store. Even at a flee market AT&T  phone.  Returning. Live n Learn n pay more for worthy product.","rating":1},{"id":"R6BZLWDLIP3TX","title":"HECK NOOOOO!! BEWARE","text":"NOT A GOOD PHONE, I CANT EVEN DOWNLOAD THE FB APP AND I HAD A SD CARD IN THE PHONE. IT WOULD LOCK UP ON ME AND ALL. iVE ALREADY PURCHASED ANOTHER PHONE WITHIN A MONTH OF HAVING THIS PIECE OF $HIT.","rating":1},{"id":"R1QKLKXPKH651Y","title":"If your a website developer using ghostlab or other simular software do not by this device.","text":"As a website developer I use a verity of mobile devices to ensure pages are properly displayed. I purchased this device because it was unlocked, therefore not requiring a phone service. I use these devices by connecting to my wireless router, which I was able to do. However, this device  will not load anything without a sims card, totally useless for me.","rating":1},{"id":"R3PDJHBLIF0LDY","title":"Not a good phone","text":"Dissapointed with the purchase unfortunately I bought 2 phones at a go. The camera does not work unless you insert sd card. I'm planning on returning the phones for my refund. I don't recommend it to anybody.","rating":1},{"id":"RNHK4V2O3D85Q","title":"and it doesn't seem to have good mic quality when paired with my bluetooth headset","text":"There's 3 rows of pixels near the top which are all black, and it doesn't seem to have good mic quality when paired with my bluetooth headset, but otherwise it works great. It makes calls just fine and works with the built-in mic.  The interface for which SIM to use is easy to use, and the Android OS interface is what you'd expect from any Android product.","rating":3},{"id":"R1WLKOR4BT1KX","title":"also something is not good with the camera it looks green and when I ...","text":"hello,I'm vianneth camargo Im writting  you to report that the cellphone model: advanced 4.0 I bought on february does not work, it presents so many problems, the screen turns  white and when is turn on  for a while  it suddently turn off,also something is not good with the camera it looks green and when I try to take a picture the same is also green! I  appreciate and be glad if you answer to me what you can do to fix the problem with my order because i'm from venezuela.","rating":1},{"id":"RE9PMQL0URDBM","title":"Three Stars","text":"It`s a kid phone, it doesn`t have memory!!!, funciona en venezuela","rating":3},{"id":"RQ4KYDOWD7L5V","title":"Don't. Just don't. It is cheap for a reason.","text":"Absolute crap. This phone has had me in tears twice now. It won't turn on by pushing the on button. I have to take the battery out and turn it on every time. It will say no service when my daughter who has the same service has service. I am totally disgusted with this phone. I would not recommend blu phones to anyone.","rating":1},{"id":"R25Y5TJF1SBVCE","title":"NOT recommended","text":"I purchased this phone as a cheap travel phone for an overseas vacation. (I was afraid of losing my real phone). It was an utter disappointment.The layout and key function did not seem intuitive at all. I had an extremely hard time setting up and using Contacts.The texting feature is extremely clumsy. Despite promises of 'auto-fill' or 'suggestions' in the menu,this feature never worked.  So sending texts was cumbersome.When I made phone calls, I could hear fine, but the people I called said I was very hard to understand.So the mic quality on the phone is not so good. I thought I would fix this by using an external microphone/headset. However, I discovered that the jack at the top of the phone is ONLY for listening, so the microphone didn't work.I never could get internet access using my data plan.  And it has such a reduced operating system that the typical apps I wanted to install were incompatible with the phone. Too big..  The wifi on the phone worked well . But when I tried to use the phone as a hotspot (which it says it could do), it never worked.  Within a week of use, the power button stopped working properly so it was hard to get the phone to come on and stay on. Oh, and the camera quality is REALLY poor. Like ... really poor.  Really, the phone was a total disappointment.  I wish I'd just brought my iphone and chanced it.","rating":1},{"id":"R3P80GUQ5CSWH3","title":"Low internal memory","text":"Internal Memory collapses when installing the modern basic apps like Whatsapp, so basically we have a new age android sistem wich potential we cannot use due to this memory issue. Also, battery is low durability, compared to other Androids. I'm not sure what other uses we could give to it, considering the limitations.","rating":2},{"id":"R3LAC7A86E1JWS","title":"No good","text":"Internet does not work it's very slow to load can't get to download  anything bought it for my 4 year old niece  christmas while I was away on vacation ...was very disappointed now I'm travelling back home...it's too late to return im In another country very very disappointed","rating":1},{"id":"R18DXRU0UYMGXK","title":"Not a good choice for app usage.","text":"Okay, if you only want to talk and text.  Got for my adult daughter, and she could download Facebook, but not enough memory to use it.  This should not be bought if you want to use any apps. I ended up getting something else.","rating":3},{"id":"R376YFBG2W5QI2","title":"Price is perfect for what I need it for","text":"I love this phone, I take it on vacation and it works well","rating":5},{"id":"R1D2YQHM24AQSM","title":"I bought the Blu because already had a good experience, but this junior Dash is horrible","text":"I bought this phone and brought to Brazil for my dad. the button on and off does not work. the Play Store not low applications. I bought the Blu because already had a good experience, but this junior Dash is horrible. I'm in Brazil and want to know how to return and cancel this purchase.","rating":1},{"id":"RPKODC7TR3MJR","title":"Five Stars","text":"Very good with useful functions.","rating":5},{"id":"R3KJAYJMOSXZPR","title":"Fit for purpose","text":"It was cheap, unlocked and accepted a regular SIM","rating":4},{"id":"R3PLSVVD92NC6A","title":"this is an honest judgement i forgot to mention that they gave me the wrong color but thats not that bad for me","text":"this is a terrieble phone it will not work. the phone loses baterry even when turned off and you can't download any apps after you have downloaded one also the app you download won't even work . It connects to wi-fi but the apps say it doesn't and it doesn't work properly. this is an honest judgement i forgot to mention that they gave me the wrong color but thats not that bad for me . The pictures are the only thing you can use unless you get a sim card but mine didn't work.","rating":1},{"id":"R29J92U5QHWGOJ","title":"Five Stars","text":"EXELENTE!!!","rating":5},{"id":"R1PYASFEMT7DMM","title":"Four Stars","text":"IT WORKS GREAT WHILE IT LAST.","rating":4},{"id":"RB6AOPNMXM3B","title":"Two Stars","text":"I don't recomme this phone","rating":2},{"id":"R18CUGJR3SGZ2Y","title":"Four Stars","text":"works ok good price","rating":4},{"id":"R27J0Q0DTXON2P","title":"One Star","text":"the worst phone ever","rating":1},{"id":"R1YGS4W9YT0GLX","title":"Five Stars","text":"Ok","rating":5},{"id":"RQKEXFCMHXCLU","title":"Four Stars","text":"Love the phone. Only bad part is that it doesnt come with SD card","rating":4},{"id":"RXR06OD463HB7","title":"WORST PHONE EVER","text":"i bought this phone to have as a regular cell phone. the first day was ok, but you really need a SD card to do stuff like download apps, or take photos. the battery life is about 10 minutes long at 100%. the second day it wouldn't even turn on. we returned it immediately","rating":1},{"id":"R39OKV9GTHLIR6","title":"One Star","text":"Nott good","rating":1},{"id":"R208MDVXY5BU90","title":"Four Stars","text":"good cellular nothing complicated","rating":4},{"id":"R3OW7S0R0L7L5Y","title":"Five Stars","text":"Good phone. It takes both US and African Sim Cards. Works well in Africa and US","rating":5},{"id":"R28MVGBOAYHNVH","title":"update: battery exploded","text":"This phone was used a handful of times and the battery exploded. I knew i was getting a phone.with small memory. I thought it would have enough to run an app or two. Nope. I downloaded facebook and it left me without any space fo run it. I didnt.take any pics, no other apps, cleared my text messages, etc. Still no go. I gave it to my mom who is not at all interested in apps. Ill buy my tween a better phone.","rating":1},{"id":"R34GX9ICVSL97P","title":"Poor phone. Short battery life of about 36 hours","text":"Poor phone. Short battery life of about 36 hours, despite few apps running, and turns off constantly. Takes multiple attempts pressing power button to turn back on. Need extra sd card to use camera. Am only using for phone and texting and far inferior to my old flip phone.","rating":1},{"id":"R36AKC7WA9VDBI","title":"Thanks for all the support on trying to fix the ...","text":"Thanks for all the support  on trying to fix the minor issues I had thank our very much people  upon the have to worry they are always willing to resolve  he issue if there is any thanks alot  again","rating":2},{"id":"R1DYTSTAMV3HKB","title":"It's a load of crap","text":"This phone is bulls***. It freezes, it turns off in the middle of a text and when I am trying to make a call it is not connecting or going through on my time apparently it goes through when it feels like it. This is so problematic.....DO NOT PURCHASE THIS FROM SELLER!!!","rating":1},{"id":"R3PG5AGCDH1N3Y","title":"Annoyingly bad habit of screen going black fast","text":"Just an average Android phone.Dual SIM is overkill for this level of Android.Annoyingly bad habit of screen going black fast...Doesn't seem to be much in settings to rectify the problem either.perfect 1st smartphone for teens and the like.","rating":4},{"id":"RGC32CUG2LDI1","title":"its a good phone for its price","text":"its a good phone for its price, but it didnt work for what i need it... awesome for a kids first phone","rating":3},{"id":"R202VQQD92S0GE","title":"basic","text":"nice color good size but too basic doesnt hold memory what so ever and its not loud enough .. phone pretty much is good for nothing","rating":2},{"id":"RNRFBQ0N8III4","title":"The phone kept telling me not enough memory and I ...","text":"The phone kept telling me not enough memory and I had a 16 mg byte memory card. I didn't care for the phone at all.","rating":1},{"id":"R20MEJHHIAZP7D","title":"A lemon of a phone. Failed to connect to ...","text":"A lemon of a phone. Failed to connect to wifi. Constantly dropped calls. I will never buy a BLU phone again.","rating":1},{"id":"R1EHDTB1HNLNK","title":"I didnt keep it...got rid of it","text":"I hate this phone....had to get rid of it...to pull the back of this phone drove me insane, so hard to pull","rating":1},{"id":"RGC32CUG2LDI1","title":"its a good phone for its price","text":"its a good phone for its price, but it didnt work for what i need it... awesome for a kids first phone","rating":3},{"id":"R1G4STV1JEETN","title":"DON'T BUY THIS PIECE OF JUNK","text":"Was a piece of junk.  It came to me non functioning, Would only get a slight signal if held at an odd angle. Signal strength was not the issue as their was a signal booster for the career in the house.","rating":1},{"id":"R2UUB5CWZOZ1KK","title":"Two Stars","text":"Good for just talk & txttoo slow to do something others... took 5min to just open play store","rating":2},{"id":"R2K0ZOL22X8X81","title":"battery life","text":"This cellphone seems to self discharge really quickly even after hours of charging.","rating":1},{"id":"R21EV2YGH4A8L1","title":"Five Stars","text":"love it..!!","rating":5},{"id":"R3AJ4BGBXASFON","title":"Four Stars","text":"Beautiful and functional cell...ideal for my teenage daughter :-)","rating":4},{"id":"R22EEYIDIN21EJ","title":"Horrible","text":"Absolutely the worst phone I have ever had. I can accept for the price not to have high expectations, but this is ridiculous.  I bought this phone as a international travel phone, but it is useless. I bought a 8gig sd card and it wont let me transfer any of the pre-installed apps. When i installed just Whatsapp the phone is out of storage. Dont buy this phone.","rating":1},{"id":"RTZPP215X96W3","title":"Absolutely the worst inexpensive phone I've ever encountered","text":"This product should not be on the market. Whoever at Amazon is responsible for acquiring this product should be fired immediately. Absolutely the worst inexpensive phone I've ever encountered. This was a starter phone for someone and after seeing it operation, I would not give it to dog to use.","rating":1},{"id":"RDLR7UK9I5LIW","title":"Not what I expected.","text":"The alphabet on the key board was so small and I have difficulty reading tiny words. Apart from that the Wi-Fi wouldn't work in public places and the SD card only supported pictures considering the memory of the fone is small.","rating":1},{"id":"RM3CSFMD4A0KZ","title":"worst purchase on amazon","text":"bought two of these for use in the caribbean, did not keep a good charge and unable to upload app which was the main reason for purchase","rating":1},{"id":"R264PURI21KXRW","title":"Five Stars","text":"RECEIVED works well in good condition from Venezuela","rating":5},{"id":"R33JR4RUAKUVES","title":"I have had GREAT BLU Phones......But this is NOT ONE !","text":"I wouldn't buy this again if I had a gun at head! And I wont even return it because warehouse deals would just sell it to someone.No usable internal storage right out of the box, web says an OTA upgrade to Kit Kat is available, well good luck getting it...because there is not any and even if there were you would have absolutely no room for the download to go to.Dual sims, neither would recognize my global sim card........","rating":1},{"id":"R2T6B04EC2432G","title":"DO NOT BUY ITEM FAULTY","text":"I don't want to even give this phone one star, I bought this phone for my 4 year old son Christmas present an he's upset with me because he can't even use the phone because the play store would not work the only thing that seems to be working is the opera Mini browser an that is very slow. And yes I am connected to my wifi this phone was a waste of money an time I would not advise anyone to buy this product it's a total rip off.","rating":1},{"id":"RWDDNAUYETMF7","title":"Not worth having","text":"This thing runs like crap. I don't know what tricks everyone else may be doing to get it to work well.I don't expect this thing to fly, or play games or whatever, but I expect it to be able to text and make calls.Between the stock calling / messaging app being slow, and random slowdowns and crashes, the phone is much more difficult to use than it should be. I almost started looking for ROMs to put on it, but for the price, it's not worth the effort.","rating":2},{"id":"RSJO0GRMSNS5X","title":"I am very disappointed","text":"It is much smaller than the pictures on the website, I am very disappointed","rating":1},{"id":"R3FW0RIFIW5B7F","title":"You get what you pay for - East German Quality","text":"I hope Amazon takes this back, because it doesn't work at all.1) the charger is simply a POS that may have been East German War Surplus2) the manual is basically worthless with instructions for nothing.3) I wanted a phone for basic text/talk and the lack of memory made the phone lock up all the time. It is simply worthless.","rating":1},{"id":"R21V36NGBLO3XV","title":"Two Stars","text":"1- THE PACKAGING IS NOT AMAZON2- THE TELEPHONE SCREEN IS ROTATE.3- THE PHONE BOX IS WRECKED.","rating":2},{"id":"R1DYTSTAMV3HKB","title":"It's a load of crap","text":"This phone is bulls***. It freezes, it turns off in the middle of a text and when I am trying to make a call it is not connecting or going through on my time apparently it goes through when it feels like it. This is so problematic.....DO NOT PURCHASE THIS FROM SELLER!!!","rating":1},{"id":"R3QABJNSCRQ43C","title":"This phone sucks! Even bought a new 32GB SD card","text":"This phone sucks!  Even bought a new 32GB SD card, and it wouldn't download any apps!  No GPS, I got a new phone with-in a week of buying this phone. Never again will I buy a cell phone off amazon, or the brand BLU !!!","rating":1},{"id":"R33JR4RUAKUVES","title":"I have had GREAT BLU Phones......But this is NOT ONE !","text":"I wouldn't buy this again if I had a gun at head! And I wont even return it because warehouse deals would just sell it to someone.No usable internal storage right out of the box, web says an OTA upgrade to Kit Kat is available, well good luck getting it...because there is not any and even if there were you would have absolutely no room for the download to go to.Dual sims, neither would recognize my global sim card........","rating":1},{"id":"RDT6662EKYAT7","title":"Avoid","text":"Avoid.  Purchased for a trip to Europe (combined with a SIM card and minutes/data purchased there.  Goal was to save money.  Failure. The phone, though new, retained a charge for only about 2 hours at a time, no matter the conditions.  And it only turned on on demand about 1/2 the time.  On the good side, when it did work, the display and sound were surprisingly good.  Didn't pay much, but got less than I paid for.","rating":1},{"id":"RWDDNAUYETMF7","title":"Not worth having","text":"This thing runs like crap. I don't know what tricks everyone else may be doing to get it to work well.I don't expect this thing to fly, or play games or whatever, but I expect it to be able to text and make calls.Between the stock calling / messaging app being slow, and random slowdowns and crashes, the phone is much more difficult to use than it should be. I almost started looking for ROMs to put on it, but for the price, it's not worth the effort.","rating":2},{"id":"R3QJ6WQPKQM3PA","title":"No NO No NO No","text":"THE WORST!!! I cannot begin to tell you how terrible this product is. please please dont buy. This phone requires charging every hour, it powered down on its own. its just a total waste of money! the touchscreen is a nightmare, the camera is like looking through the eyes of someone wearing sunshades in the dark. less than 2h hours later, I had to switch phones. Na! dont buy!","rating":1},{"id":"R3LAC7A86E1JWS","title":"No good","text":"Internet does not work it's very slow to load can't get to download  anything bought it for my 4 year old niece  christmas while I was away on vacation ...was very disappointed now I'm travelling back home...it's too late to return im In another country very very disappointed","rating":1},{"id":"RXR06OD463HB7","title":"WORST PHONE EVER","text":"i bought this phone to have as a regular cell phone. the first day was ok, but you really need a SD card to do stuff like download apps, or take photos. the battery life is about 10 minutes long at 100%. the second day it wouldn't even turn on. we returned it immediately","rating":1},{"id":"R1X5INGU3W0IQI","title":"So you definitely get what you pay for bought it for temporary use however within the short time of using it was a headache and","text":"Okay! So you definitely get what you pay for bought it for temporary use however within the short time of using it was a headache and pretty much annoying got calls and text which was the main use for it but in all it sucks don't waste your $$$ or time not worth it 👎🏼👎🏼👎🏼😑 and also it chooses when it wants to recognize your SIM card","rating":2},{"id":"R3G8VECNTFZ6B1","title":"Very pleased with quality for the price","text":"After trying out the BLU touchbook 8.0 I decided to give BLU phones a try.  I was a little disappointed in the first model I tried (Zoey II) but the Dash Jr is great.  It's responsive to touch and has a ton of functionality for the price.Very pleased and highly recommended.","rating":5},{"id":"R384JFPKUZAZJB","title":"Five Stars","text":"I'm really upset because the phone I stand failures from the first day of use I would like to communicate with me via email to make me change by one in better condition. The phone has flaws in terms of software and plug adapter for the charger get damaged. Please contact me.","rating":5},{"id":"R20OQY1QPOGKCF","title":"Your sononido or horns are not good. It is very limited","text":"It is very limited. I could only download a single application WhasApps. Your sononido or horns are not good. It is very limited. I could only download a single application WhasApps. Your sononido or horns are not good","rating":2},{"id":"R2NVH3X1K81TWH","title":"Five Stars","text":"Brought as first smart phone for a family member, great starter phone.","rating":5},{"id":"RE9PMQL0URDBM","title":"Three Stars","text":"It`s a kid phone, it doesn`t have memory!!!, funciona en venezuela","rating":3},{"id":"R3HRVRM73ZWI9U","title":"I love my BLU phone","text":"I love my BLU phone.It is tailored to my needs. Doesn't hold many apps and storage is small, but for that great price you cannot expect much.It's unlocked, and this is a great little phone with this feature.","rating":5},{"id":"R8XME2LYFOVMX","title":"The phone was ok just not adequate for my needs ...","text":"The phone was ok just not adequate for my needs.storage was too small","rating":3},{"id":"R376YFBG2W5QI2","title":"Price is perfect for what I need it for","text":"I love this phone, I take it on vacation and it works well","rating":5},{"id":"R2F8PFVOXKPG25","title":"Deceptive seller","text":"I personally would not recommend this buyer to anyone. I bought this phone as a birthday gift for my friend and I sent it out of the country. When she received the phone the touch screen was not working, thereby making the phone useless.","rating":1},{"id":"R33AYDMTIWX9KZ","title":"It was useless to me but not returning as the price was right!","text":"If you are looking for a phone that is limited to only making and accepting calls, this can work. Otherwise, you are unable to download any apps, use email or text as the memory is very very limited and the SD card won't help with certain featured that have to be saved to the phone. Also, you can't use Internet without error messages! You only get 1G regardless of the service provider or country.I wouldn't recommend this if you're looking for a smart phone or needs apps/internet.","rating":2}]