[{"id":"R1T2PZCIK7KGHK","title":"Best phone I've ever owned.","text":"In the past, I'd spend $500+ on each new phone I got, starting all the way back with my iPhone 3G. Had an iphone 4 which I loved, then made the excellent decision to switch to android with the note 2. After realizing the ridiculous amounts of money I was spending on phone service and phones, I'd come to the conclusion that cell phones weren't for me. Until one day, I came across a phone company called BLU, which exclusively sold well priced unlocked phones.Having always been interested in the next best thing, I was a bit skeptical at first, but was won over when I switched to T-Mobile and BLU, and saw my phone bill cut in less than half of what I was paying at AT&T, for arguably better service (in my area). I tried out a few different BLU phones, and used a ZenFone 2 for awhile. While they were all fairly nice, and excellent for the price, they did seem to have one thing in common that I missed with my expensive phones, and that is they weren't as fast. While it never really bothered me, I could always tell the difference when using a friends galaxy S6 edge, for example.When I saw this phone listed at $60, I looked at the specs and was, as always, skeptical. I figured for so cheap though, why not have a back up phone? WRONG. This phone, though having near identical specs to my last few phones, is fast. I'm talking home button -> new app in .79 seconds fast. While realistically no, I didn't run any actual tests, this thing is incredibly smooth and has thus far handled everything I've thrown at it with 0 stuttering at all. Honestly, I am in amaze at how great this super affordable phone is. I couldn't ask for anything more in a phone.Beyond speed, the battery life is pretty great easily getting me through a normal day with usually more than 50% left, the screen is bright enough to see in direct sunlight, as well as dims enough to comfortably use in the dark. It also looks and feels like I spent a bit more than $60 on it too, which is still blowing my mind. Amazon and BLU, you rock. 10/10 would buy again.","rating":5},{"id":"R3G6JCES23YJLS","title":"Very surprised with the quality of this phone for this price","text":"I was very hesitant to buy this phone at first for my wife. We have always had phones from well known brands like samsung, motorola, sony, or apple. I looked around at some other reviews of BLU phones and decided it would be safe to try this one. I must say I was extremely surprised. For the price this is an excellent phone. It has a very sleek look, good feel in the hand. The screen is nice and clear, speaker is good enough, and the speed is actually quite impressive. It might not be as fast with gaming apps or other RAM intensive apps but in terms of normal browsing it keeps up very well.Camera: We got this phone not expecting an amazing camera. And while it isn't amazing, it works really well. It's an 8MP so you can't have too high expectations, and for the price they have to cut back somewhere. Compared to other budget phones though, I think this camera exceeds most of those.The amazon ads: We weren't sure what to expect with the amazon prime ads on the lock screen, we didn't anticipate being bothered by it too much and that's pretty much how it is. Sometimes they actually look pretty cool and almost look like a neat wallpaper. They easily dismiss though as you go to unlock your screen. A very small inconvenience for the discount it gets you.All other functions of this phone work as expected. No glitches, no issues, no dislikes so far and my wife has been using it a couple months now. I am almost even tempted to get another one just to have a spare phone lying around. You really can't beat this price for this quality of phone. Screen size is just large enough too.If you're looking to replace your phone, or just get something new without breaking the bank, this is it. So far very reliable, runs the latest android, and can handle most of what daily phone users throw at it. It really makes it hard to look at other phones costing $200-$400 for the same thing. Until we run into issues, this phone will have 5/5 stars from me.","rating":5},{"id":"R2JF1FXV81YIOH","title":"Buy the $60 version","text":"Bought this for Android app development and was surprised to find that it's a good overall smartphone. Hardware specs are good enough for completely smooth operation without UI stutter, and day-to-day usage feels no different than that of any flagship Android phone. Software is mostly vanilla Android with little to no UI tweaks or bloatware, which is a massive advantage over most other smartphones. All games that I tried run perfectly well with no dips in frame rate (although I haven't yet tried any demanding 3D games). The display is good irrespective of the price and is great at $60. The rear camera is decent but not very good in low-light conditions; the front-facing camera is adequate—not great, but not terrible. The rear speaker is somewhat quiet and relatively tinny but is otherwise functional—it's not great and it won't fill a room with sound like an iPhone or a flagship Android phone, but it's adequate for watching videos without headphones in a quiet room, and it doesn't sound muddy or totally distorted like the speakers on inexpensive electronics tend to. The vibrating motor in this phone is somewhat mediocre and isn't very good at low-duration pulses (below 25 ms or so), but it performs as expected for anything above that, so this is probably nitpicking. In terms of design and construction, this phone looks and feels higher quality than expected—Gorilla Glass 3 with curved edges, aluminum sides, recessed buttons, simple design, relatively thin profile, etc.It's worth noting that the R1 HD features an SD card slot and two SIM card slots, things which can be difficult to find in more expensive devices.For the price, this is a good smartphone overall, and I can see it putting a small dent in the sales of more expensive phones which cost upwards of five times as much and yet offer more or less the same experience in day-to-day usage (albeit with better cameras and a better rear speaker). Buy the 2GB/$60 version and not the 1GB $50 version—it's a small difference in price for a large difference in performance.Screen: ASoftware: ACPU/hardware specs: ADesign, materials, construction: ABattery life: ARear camera: BFront-facing (selfie) camera: CRear speaker: C+ phone looks and feels reasonably high quality+ display is excellent+ rootable+ ads aren't at all intrusive if you don't want to root; only appear on lock screen and can easily be ignored+ has an SD card slot, something not found on many flagships+ has two SIM card slots, something not found on many smartphones here in the US+ vanilla Android!+ has an accelerometer, contrary to what another reviewer said (not to be confused with the gyroscope)- doesn't have a gyroscope, which means you have to play Pokemon Go with the VR setting disabled (who plays with it on, anyway?)- vibrating motor feels and sounds cheap- rear speaker sounds quite tinny and is between 50% and 75% as loud as my iPhone's speaker—it's the weakest part of this phone in my opinion, but it's still adequateMy guess is that the next step up in terms of quality for Android phones is the Moto G (and there's a Prime discounted version of that, too), although it'll run you about $180 at the time of this review.","rating":4},{"id":"R161SWTWRSHP7T","title":"Awesome phone for the price!","text":"I wanted to live with this phone for two months before writing a review and it is now 2 months since I bought this awesome and and all I can saw is, it is awesome!  I bought this $59 phone for my wife, she upgraded from the Blu Studio 5.0 to this R1 HD and she can't stop talking about how great this phone is.  We are a family of four and three of us have Blu phones, my oldest son is the lone holdout, he has to have the latest and greatest Galaxy phone!  This Blu phone, with Amazon Offers, is one of the best phones you can buy for the price!  We have the 16db storage with the 2gb ram.  for the extra $10 it is so worth it!  This phone is fast and you hardly notice the offers on the lock screen!  The screen is beautiful and the camera takes fine pictures.  Everyone seems to kill the camera in previous reviews however for the pictures my wife takes, it is fine!  She loves the Android 6.0.  I have the VIVO 5 and I would love to have 6.0 on my phone!  The Amazon apps, which are pre-loaded, are fine!  She shops on Amazon so she is used to having the apps on her phone. The phone didn't come with the case or screen protector, like our previous Blu phones did, however for for a very small price, you can pick them up when you buy the phone.  The phone has most of the 4G LTE bands you will need for T-Mobile.  Her internet is very fast on the 4G LTE.  Overall I am very happy I bought the phone for my wife and I am very happy to continue to buy Blu phones.","rating":5},{"id":"R2VMEB9QKHJX8E","title":"Love love love love!","text":"My IPhone 6 unfortunately broke, so I needed a phone that seemed durable and was easy on my wallet, and this phone ended up fitting the bill for both! I used hate Android because of a bad experience I had with a Samsung phone, but this phone changed my opinion of android as a whole! It runs very well and hasn't given me any problems so far! The only thing is that I didn't read carefully enough so I had to order a Sim card adapter to fit my nano Sim in this phone, which should come tomorrow! But overall great phone!","rating":5},{"id":"R39D8GWWQ3402Y","title":"Buyer BEWARE","text":"Like several other reviews, after a couple of months of use, the phone messed up.  Used this phone for 2 months and suddenly it can't read my SIM card.  The SIM card has been checked at my provider, and it works fine. It's the phone.  So we sent it back to BLU for repair.  Repairs take 20 days, and you have to pay shipping to send the phone back. We received the phone back today and guess what - it still can't read my SIM card. Be careful when buying this phone.  It seems to work great for a couple of months, then the problems start.","rating":1},{"id":"R2E237WF15BS3","title":"Excellent Bang for Your Buck","text":"Just received the Blu R1 HD. I got it as a backup phone since my LG G4 was having some repairs done. The version I purchased is the Amazon ad-subsidized edition with the 2GB RAM.First impressions are very good. It feels sturdy and not at all cheap, even for a $100.00 phone if you'd paid full price. Its very clearly 'inspired' by the look of recent iPhones, but it's not a bad thing at all.It's light but has a good 'heft', closer to the feel of a premium phone than of your gas store 'burner type' phones. The rounded edges (which feel like metal) give the phone a comfortable grip, and the power and volume buttons (on the right side of the phone) are very easy to use while holding the phone with one hand.The back cover, which can be removed to access the dual sim slots and the SD card slot, is a matte black plastic cover. Its the weakest part of the 'look and feel' of the phone but it's not a huge issue, as it's not something you'd often look at and it does the job just fine.So far, it's been very responsive for regular tasks like text, calls, email, YouTube and Pokemon Go. Other than the Amazon loaded apps, it's a very stock Android experience which is a good thing in my opinion. It may throw off someone used to Samsung or LGs overlays.So far, I'm very happy with the purchase. I'll update the review as I play around with it more.","rating":5},{"id":"R1Q3MYA8C74P4O","title":"Good deal","text":"For $60 this is a deal. Works great on Cricket. No complaints really on the performance, amazon ads are fine and does not take over the phone. I have had Blu phones before. I like the fact they work just as good as the expensive ones. Fyi I was a little mad there was no move to SD card option but with Android 6 it doesn't matter. The only semi problem is that you cannot wear polarized sunglasses or the screen is black.. I guess it will help stop using the phone and driving.","rating":5},{"id":"RQ4FNLIEOQOLG","title":"Can't get more bang for your buck.","text":"The phone is great for the price. The ads do not get in the way. The screen is excellent.  Definitely get the 16gb version with the extra ram.  The problems I have with the phone are the Bluetooth is wonky and I find this a problem with most blu phones. The headphone volume level is inadequate and just not very good but again this is also a problem I find with blu phones so no unexpected.  But the biggest problem is the external speaker is terrible.  I cannot hear hardly anything out of it. You are better off to keep it on vibrate. You are more likely to hear the vibration than the speaker notification.  Having said all that. . . Given the choice of owning this outright or having a contract on a flagship phone I will take this any day of the week.  I can deal with these small issues. They can be overcome.  For $59 thanks to Prime this is a steal.  Buy it and get an mp3 player or a headphone amplifier.  It's still way cheaper.  Well worth the money. Great battery life and performance and the stripped down version of Android is refreshing.  All my apps work great and the cameras are adequate.  If you can deal with the little hang ups which are really problems that I find all blu phones have then you are good to go.","rating":4},{"id":"R3K4QE2H4G888A","title":"Excellent buy!","text":"I bought this phone when my $900 phone went in to warranty repair and I was totally surprised. It handled everything like a breeze, performed well for what I needed done and I had no complains. Processor is fast, although I did not play any games on it. There is enough memory for my needs. Battery lasted a whole day and some. Screen is super bright and responsive. Amazon ads were not intrusive at all. Call quality is good. I am keeping this as a extra phone in the family now for those \"emergency\" situations.At this price point, following are a few things you have to contend with, not a deal breaker by long shot1. GPS sometimes likes to bounce around when you are stationary. Accurate when moving.2. Camera quality is acceptable, but not like a $900 phone.3. Experienced a few one-way phone calls (when only one person can hear the other), but that could be a the network setting as I never registered it with my carrier. Worked fine on a call back.4. Sound modes (general, silent etc) baffled me. They can however be customized and it might be more of an android thing.","rating":5},{"id":"RYHE2QUQULTX9","title":"Great deal, USES MICRO SIM CARDS","text":"So, I got this because I was looking to switch from Windows phones over to Android and wasn't looking to spend too much. I wasn't expecting too much, but this thing delivered!The screen looks great, the curved gorilla glass is very pleasant to touch and look at. The back is slightly rubberised, making it quite easy to hold onto. The back camera isn't as good as I'm used to, but it's perfectly serviceable. The front camera is much better than I'm used to, as most phones skimp out on the selfie cam. It has a decent processor with enough RAM to run many apps side by side, and still be very responsive. Like others have said, the deals from Amazon are unobtrusive and totally worth the $50 discount. One thing I would like to note is that it takes Micro SIM cards, not nano! If you're switching phones, make sure you have the right size SIM card!UPDATE: One thing I would like to note to anyone interested in Pokemon GO, this phone's orientation does not appear to be precise enough to use the AR feature of that game, and also cannot use the power saving feature of that game due to it also being dependent on orientation. It can detect upright or sideways for all other purposes, though.","rating":5},{"id":"R1JLBC756KTWX3","title":"Good riddance to crappy ripoff Iphones !","text":"I am soooo happy with this phone ! I cannot believe the fantastic price ($59.00 ! ) and same day delivery for me as a prime member !! I recently had yet another Iphone stolen , my 4th one over the years ..so I checked Amazon for another one and came across this phone . For the price , I decided I would use it as a temporary replacement  .But after receiving it, I will never buy another Iphone as long as this incredible surprise of technology is in existence !Talk about user friendly ! My  Tmobile sim had not even been put into it yet and I was amazed at how quick , easy , responsive and accurate this great device was ! Alexa came on while I was asking myself a question out loud , much to my surprise , haha ! AND it was 100% accurate and opened a google page to what I was trying to find ! Whaaaat ?! It has not let me down so far .A huuuuge difference from the constant errors and frustrating results I would get with Siri . Big , bright  , attractive screen . Stunningly easy to type , swipe and search with the lightest pressure ! I've had Iphones  (and multiple replacement screens at $75-$100 a piece!) since the 4th gen and droids have surpassed Apple's user friendliness and overall tech and ease of use in my opinion. Good riddance with the ridiculously overpriced , thief appealing Iphones and a big welcome to the ridiculously affordable and very excellent Droid devices  !!! I can buy nearly 12 of these for the price of 1 Iphone 7 !! I'm never going back ! Thank you Amazon ! Oh and you can remove the amazon ads , but honestly they don't bother me ! There is also an adorable little brush to sweep away all of your open windows with one finger. And Google 's cloud (contact transfers, etc.)is way  better in my opinion than Apples !I am no tech expert . I am pretty average as far as that goes. I use my smart phone as serious work horse for daily life , my busy businesses, music and video enjoyment ,etc . ,though and giggle with glee every time I discover another ability of this incredible gadget !","rating":5},{"id":"R3JWS7FVSTF5VZ","title":"Great phone for crazy low price.","text":"I bought this as for my little nephew to play Pokemon Go with me when we go hunting. I'm extremely happy.Pros:- Plays Pokemon Go pretty well even with the latest update (3/14/2017)- Plays many other games well (Clash Royale, Clash of Clans, Brave Frontier all play fine)- Design is nice, sleek, and solid- It's light yet durable- Price is just a stealCons:- Can get hot after extended play (2-3 hours) but that's because that's a lot of playing- Touch/Screen response could be better, not sure if it's an android thing but my iPhone response much better especially when catching Pokemon and throwing pokeballs (But not bad though)- Ads make having a lock screen wall paper a bit pointless but it's just an extra device with no SIM so I don't care eitherHonestly, the ads don't even bother me, it's not intrusive in my opinion. You just get used to it. Youtube ads probably bother me more.I have unlimited AT&T data, so I throw my AT&T SIM into it and we now have a LTE hot spot for all of my devices. AT&T disables the personal hotspot features on iPhones if you have unlimited data. This is a great feature (Hotspot). It can cast to your Chromecast with no latency. Plays high quality videos, such as youtube and netflix media without any issues.I love this phone. I may even get another one for my little brother since his birthday's coming up. Nice started Android phone. Has all the features of most other phones for literally a fraction of the cost. This would be my backup phone if anything ever happened to my iPhone.","rating":5},{"id":"R1XPB1G36XTAOR","title":"I am in love with my new phone","text":"I am in love with my new phone, after 6 months of searching all my needs where met without me having to sign my life away on a contract, or spending the equivalent of my rent on a no contract phone, you would never guess this phone was so darn affordable without skimping on the desirable features, I myself am a pay as you go plan fan so knowing it was as simple as adding my personal sim card I was sold it doesn't hurt that the phone looks great! The Gorilla glass alone would have made it worth it to pay double, the added bonus my Prime discount discount allowed me to spend less then $100.00 to bring this baby home.  It was so easy to set up, I love the camera, the lock screen Ads take nothing away from the phone, if you deal with having enail notifications on the lock screen it won't be any different, being a big fan of Amazon I love the fact it's pre-loaded with Amazon Aps I browse daily, the screen is vivid great for watching my Prime movies, so far I have no complaints I've had it for the past 5 days and I have a feeling 5 months from now my review wou","rating":5},{"id":"R32ITMZS1J4QP9","title":"A $60 phone worth more than the sum of its parts","text":"This phone is an absolute steal for $60. It is a really good value at $110, but when subsidized by Amazon, it e there another category. For most, $60 for a piece of technology is almost an impulse purchase price. For $60, you get an LTE, GSM network compatible smartphone with 2GB of RAM, 16GB of system memory, a decent mediatek CPU and 5 inch IPS LCD screen.You also get a 5MP front camera with a flash and a rear 8MP camera.The phone comes with the latest version of Android, 6.0.1, and a micoSD card slot.  Most phones this cheap are still on Android 5.1.Since this phone is subsidized by Amazon, Amazon will display ads on the lock screen. I am happy to say that they actually look nice and require you to press an easily identifiable on-screen button to go to Amazon. No sneaky tricks here. Once you are past the lock screen, the phone is on bone stock Android with the addition of 6 or so Amazon apps installed, like IMDB, audible, and of course, Amazon shopping.The lock screen ads and a few pre-installed apps more than make up for the $50 price reduction of the phone.The phone is not perfect, most notably in the rear camera, which is slow to focus. Also, the battery is not removable.However, if you want a cheap phone to play with , a backup phone for emergencies, or even a Wi-Fi capable Android MP3 player with a camera and a screen, buy this phone. For $60, you can't go wrong.","rating":5},{"id":"R3ORF9RPN5TLSP","title":"An amazing phone for $60","text":"I use an iPhone 7 Plus as my main and decided to get a second phone for foreign SIMs that I use for forwarding. Hence, I wasn't expecting much when I ordered a $60 phone (prime member) that was 1/12 of the price of my main.  This phone certainly opened my eyes on how much of the sticker price is the actual brand.PROs:- pretty fast for all intents and purposes, most apps open just as fast as on my iPhone 7, videos play instantly, just like my main phone, download speeds are just as fast as the iPhone 7 do on a 2.4 GHz network (i.e. maxes out at 54 Mbps).- The screen is beautiful, hardly can tell a difference to the iPhone in terms of resolution- pretty fast for all intents and purposes (can play games)- super lightweight- very good battery life, better than iPhone 7 plus- runs Android marshmallow- doesn't feel all too cheap, I mean sure it is not an iPhone, but it's not that much worse- dual SIM, good for travelCons:- The speaker is not very good, way too quiet!- The camera is really subpar, possibly a dealbreaker for anyone who seriously is considering using a phone as a camera for vacation- no 5 GHz WiFi support, so no 300 Mbps download. You're stuck at 54 Mbps!- missing LTE bands (such as 3 or 21 which are the only ones available in some smaller European countries)- DOES NOT WORK WITH VERIZON OR SPRINT IN THE USA, WORKS WITH VERIZON SIM CARDS IN EUROPE (ROAMING)- Second dual SIM slot won't work for AT&T (2G only)- no NFC payment, no fingerprint scanner (its just $60!)Summary:Good as primary phone for anyone who doesn't care about the fastest and best phone out there or even for children. Great as a travel/secondary phone if you need to be reachable from home.","rating":5},{"id":"R30L5P8R8SRIY5","title":"It far exceeds my best expectations.","text":"This phone is everything I'd hoped it would be and more.  I researched heavily and read everything about it, including all 1000 questions and answers.  I noticed lots of queries about whether it would work with the safelink/tracfone system.  It does and does the job perfectly.  I'm used to having real crappy phones with my lifeline system.  With the R1 HD, those days are a thing of the past.  First thing you do is buy the Tracfone BYOP(Bring your own phone) kit at any Wally world or here on line for less than ten bucks.  Then get a high speed 32 or 64 gig SD card, cause you'll use it.  If you download ES file explorer and turn on \"allow outside apps\", you'll be able to move anything you want over to the SD card with no problem.  The phone is a GSM system phone.  Take out the ATT sim card from the BYOP packet and punch out the micro sim section.  Go online with your home computer and google \"Blu R1 HD User Manual\" and then download it or bookmark it.  On page 3 you'll see an exploded view of the open back of the phone.  When opening up the SD and sim compartments you must first slide the metal piece about 1/16' up and it will clamshell open.  Once the sims are inserted close it and slide it back to lock it closed.  The manual goes into much greater detail than the little  booklet they give you with the phone.  Do no install the sims yet.  but the SD card can go in.  Getting the back off is a challenge.  it is hooked on at many small points.  I start at the middle bottom of the phone and get a fingernail under it and slowly move the fingernail around the edge between the top and bottom until it just releases.  You'll hear small pops as the back cover slowly releases it's attach points.  I've taken the cover off at least 6 times now with no problems with this method.  Do not try to pry it open from a corner.  It will crack and break.  Once the cover is off and the sim cards are laid out both ATT and T-Mobile (both GSM) call safelink customer service at 800-378-1684.  Go through the menus, which will be press 2, press 6, press 5, press 2, and you will get human tech on the line.  Don't use a cell phone use a landline for this process.  It took 5 minutes for the tech to take down the sim # and transfer all my lifeline minutes to the R1 HD.  It took 20 minutes on hold to get the tech though.  The phone worked flawless for incoming and outgoing.  One thing I was missing.  The home screen on my old tracfone always showed me how many minutes I had left.  I downloaded the tracfone app in google play and it loaded on page two of the home page and it shows you how much data, voice and text you have remaining.  It is very slow to update though.  A better way is to just dial *777*1#(star777star1pound) on your R1 HD and safelink immediately sends a message to you with the exact usage and remaining useage.  This phone does everything, but then maybe all the smart phones do, I wouldn't know,  but I'll bet they don't do it for 59.99.I decided to stretch.  I hooked up a plantronics M70 bluetooth headset and it is fantastic.  All I do now is grab my phone, go to voice recognition and say \"Call Dottie\" and walk out of the room and it calls Dottie.  I don't have to be anywhere near the phone. I can initiate the call with the earpiece and have a whole conversation with the phone nowhere near me..So I said to myself ,\"Why not?\"  I went to Wally world and bought a tracfone prepaid card for 200 voice, 500 text and 200mb of data for 15$.  I purchased another tracfone card for 1000 texts for 5$ and called safelink customer service back.  In ten minutes they had the t mobile sim in the phone in slot two, all the prepaid cards loaded and an entire separate number just for my 4 teenage grand daughters.  Teenagers hate to talk on the phone.  For them, It's totally uncool.  They love to text though.  Now I'll be texting them on my #2simm card number every day and night.  So for under 90 dollars I get 550 minutes voice over 2000 texts and 500meg of data, and two phone numbers and a great phone.  With the phone paid for, I'll get the same amounts every month for 20.00.  I love it and I highly recommend this phone.  If your old phone uses micro GSM sims then you can save 8 bucks by just inserting the sims from your old phone into the new one.  If you don't have teenage grand daughters who are texting freaks then don't bother with the second phone number but if you're on a lifeline program that uses a GSM network system, get this phone, you won't be sorry.  It works and works better than any one of the stock phones they want you to use.Hope this review helps some folks, especially seniors, who may be sitting on the fence because of the service they use.  No need to worry, this phone does it all for you.","rating":5},{"id":"R1QDWMER4W6BE","title":"... the price(59 dollars with the ads) I cannot be happier. The build quality is really nice and it ...","text":"For the price(59 dollars with the ads) I cannot be happier. The build quality is really nice and it feels like a much more expensive phone than what it is. I bought this phone as I have to send my Nexus 6P back as it has phone call quality issues so I just needed something for the 2-3 weeks of waiting to have it returned. The thing is I am unsure once I get my 6P back if I will keep it or just sell it on craigslist. That is how much I like this phone. Below are my pro's and con's but I really have zero con's for the phone at this price.Pro's-Build quality looks great and does not feel plastic like at all. Additionally, I really enjoy that it is not slippery like my 6P.  I also like how they designed the screen glass in appearance.- The screen quality is really good for the price. Honestly, unless you have a very hi end 4k type of screen you will not be able to notice much of a difference unless you are really looking hard.- Phone performance is snappy. I have not really noticed any lag at all yet I do not play video games or things like that. I just pull up webpages and apps like google maps and this performs basically the same as my 6P.- Amazon Ads- I was really worried about the ads and if it would be obtrusive while trying to use or be a drain on resources. I can tell you it is not. It is so unnoticeable and you literally just swipe it away like any other type of notification on your locked screen.- Phone call quality is great. I have had a couple of test calls and everything tested clear as could be.- I have not had a chance yet to test the bluetooth yet if it is anything but solid I will come back and update.Cons- Camera- I struggle even to list this on a 59 dollar phone yet  if a camera is incredibly important to you then you may not ever be happy with this phone. Now, if you can only afford a 59 dollar phone then it is what it is. But out of everything that is where this phone lacks the most.- Speakers- Honestly, they are not terrible but not loud. Also, I always just use headsets so to me it really holds no value.- Battery- No quick charge battery, yet again its a 59 dollar phone. If you expect a 59 dollar phone to have that you are kind of a moron yet wanted to point it out as that could be a deal breaker for some people(It almost is with me).Overall I love this phone. I owned a Asus Zenphone 2 that I purchased around 15 months ago that I paid 200 dollars for. This phone absolutely destroys it in every way. From look, the build, to the screen brightness and feel. It's a 59 dollar phone folks but you will not be embarrassed to be seen carrying it.","rating":5},{"id":"R2ZIXWQTADZFK","title":"Surprisingly Great Phone!","text":"I'm shocked at what a good little phone this is. For $60, I was expecting it to be the cheapest of the cheap... but it's not. It's actually totally solid!PROS:- Reasonably bright and crisp screen- Snappy, quick app switching even after a couple of weeks of use- Almost completely stock Android!- Two SIM cards, neat!- MicroSD card slot?! Are you kidding me!? Awesome!- Great call quality- Solid build, feels good in your hand- Pretty attractive design- Amazon ads are not at all intrusive, srsly! Good job, Amazon. I'm happy with the compromise here.CONS:- Camera is so-so. It's not terrible, but it certainly isn't a flag-ship phone! It's probably on-par with my 2013 Moto X. Notbad.jpg!- Mostly stock Android... with a few weird modifications, like no percentage next to the battery icon, and the included notification sounds are super annoying.- Uh... no 5 GHz Wi-Fi? Ok, I'm nitpicking here...If you need a cheap Android phone for use with T-Mobile, boom. This one right here. You've found it. We bought it to replace my wife's aging phone... I'm seriously thinking about replacing my 2013 Moto X with one of these. It's that good!","rating":5},{"id":"RH8DDCZMTYCOE","title":"Great phone; unbelievably good price","text":"My previous two phones were an iPhone 4 and Nexus 5X and I love this phone.  After breaking the screen on my previous $450 and $350 phones, I decided to get something cheaper because (a) I don't play any games so I don't need fancy hardware and (b) I'll probably break this one too.This phone surprised me.  It doesn't feel cheap; it actually feels great in my hand and works well.  All my go-to apps work fine, which for me are maps, Audible, Yelp, and assorted other low-power apps.  I can't say how performant it would be for games.  The camera seems decent enough as well.I doesn't have a fingerprint reader, so you'll unlock it with a swipe pattern or passcode, unless you have an Android watch.  It paired with my Motorola watch without issue and a newly released feature allows you to keep the phone unlocked while in proximity to the watch, so I don't miss the sensor at all.I opted for the version with ads and they don't bother me.  There's a panel on the notification page as well as a widget you can put on your last page of apps with your infrequently used stuff.  It's really unobtrusive.  I generally dislike ads but since I felt I was taking a chance on an unknown brand phone, I decided to go real cheap in case it was a dud.  To the contrary, it's a gem -- a good phone for a rock-bottom price.  I'm amazed.The best part is the microSDX slot, so you can expand the storage.  My previous phones didn't have that capability.  Indeed, it was that feature that encouraged me to take a chance on this phone.  Now I have plenty of room for all my apps, a dozen audiobooks, and can take photos and videos with impunity on my vacation without worrying about uploading to the cloud to make room.If you're just looking for a decent functional phone, this is a great choice.  I'll never buy an overpriced phone again.","rating":5},{"id":"R1HMCYNOFC28VO","title":"Phones great speaker is crap","text":"The phone is amazing and for the prime price no other phone on Amazon beats it.camera is OK. Plays Pokemon go fine with no AR mode.The main reason I returned it is because the speaker is very weak! You can barely hear it outside when I'm walking my dog.","rating":3},{"id":"RNBHLIN2J46JG","title":"Wow, greatest budget phone I've ever owned","text":"What an absolute delight it was when I received this BLU R1 HD smart phone, I mean sure I already knew what the specs of this phone were,  however, I never expected the overall feel. I've owned several budget friendly smartphones over the years including a few other BLU phones but, this R1 HD is by far the better of ALL the BLU phones I've owned. For starters, it's sleek, thin and lightweight but it doesn't feel like it's cheap or cheaply made (if that makes any sense). The screen is super smooth glass, bright, crisp and sharp it truly does appear to be HD screen, the touch screen is super responsive with minimal if any \"dead zones\", videos look extremely good, colors seem accurate and vivid. Although the CPU isn't going to shatter any speed records, it really does an excellent job, pretty quick when loading web pages, not laggy or slow. The 2Gb of RAM plus the 16Gb of memory is also unusual (for a budget phone) but welcomed addition which, for my particular needs is more than adequate, especially after I  added a 32Gb micro SD card. Picture quality is decent with built in quick photo editing software you can tweak your pics on the fly without having to open up a separate app, I personally love the front facing selfie cam which boasts 5MP with flash. Battery life is also surprisingly good, going nearly 12 hours of normal use i.e, FB, Instagram, WhatsApp surfing the web, checking emails etc before needing to be charged. As a prime member I ordered the phone with the ads on your lock screen, I figured the heck with it I'll deal with the ads even if it means having to sit through ads but, surprisingly they do not take anything away from this phone what's so ever you just swipe and go on about your business. The only complain or con is the sound quality, the phones speaker isn't going to blow you away but, then again, show me a smart phone that will, it wasn't enough to turn me off I mean most of us use ear buds anyway right?In conclusion I gotta say I really am impressed and I'm loving this phone, I mean sure it's only been a couple of weeks and if anything comes up I will surely update this review but as for now not much to complain about.By the way, I DID NOT RECEIVE THIS FOR FREE OR AT A DISCOUNT, I PAID THE ACTUAL PRICE FOR THE VERSION I BOUGHT WITH MY HARD EARNED MONEY AND THE OPINIONS EXPRESSED IN THIS REVIEW ARE MINE AND NOT INFLUENCED BY ANYONE ELSE BUT ME.","rating":5},{"id":"R2B648LTRRB3I6","title":"Great phone for price.","text":"Ok, I have had this since release.  It performs great.  Texting, apps, internet.  Downsides are the camera quality and processor speed.  I knew that going in, I am not a teenager taking selfies non-stop, nor do I demand my phone be able to perform like my gaming computer I have on my desktop.  It has not given me any trouble, decent phone use, texting is great.Dont get me wrong the camera is fine.  It takes pictures, I can see pictures and like them for posting to FB, if you want there are plenty of post picture editing apps available, many which I use on this phone.Battery life is so far, fantastic.  Sometimes at teh end of the day, with moderate use (Soundhound, Facebook, google, gaming apps, calendar use, picture taking and so on) I still have around 70% at the end of the day.  Buy this.  The ads are just on the lock screen and since I am a Prime user...  They have actually sold me items on the lock screen...","rating":5},{"id":"R22IW41T1SEAFO","title":"Very impressed with this phone.","text":"Very impressed with this phone. It does come with some basic Amazon bloatware which you can disable. Ads are just on the lockscreen (you can remove the ads widget). Some people have rumored that the ads lockscreen can be disabled with a 3rd party lockscreen app, but this is not true. It will just show you one lockscreen followed by the other (ads one). The recent update has quickly patched an internet posted 'hack' so... don't try too hard as you probably won't get anywhere! In any case the ads show up as a notification among others, if you have at least one notification. Otherwise it's full screen - sort of like on the Kindle Fire. Pretty sure it will be hard to root being on Marshmallow and having a locked bootloader but people might eventually figure it out.Build is good. It's sturdy (slightly heavier than it looked to me) but sleek and looks almost like the iPhone in its size and shape. The power button is below the volume rocker which can be a little strange to some. It even has the corning gorilla glass. The camera on the back sticks out a bit, kind of like on the iphone and other phones (I guess they can't make an 8mp camera slimmer) which makes me nervous about damage but the blu case will protect that.Performance is excellent. Marshmallow runs well. I have not had any lags, freezes, or bugs. Touchscreen feels and responds nicely (I have had touchscreen issues with another blu phone). Don't hold your breath on further updates on Android OS as Blu is notorious for breaking promises.Battery life lasts the day. To me it's pretty standard. Charging speed hasn't bothered me. Charger doesn't make high pitched squeaking like a previous Blu charger I had.There *IS* an LED notification light which I really appreciate. that shining beacon that tells you you have a missed text without having to wake your screen.Camera is better than I thought, just don't rely on it for award winning shots and you'll be happy. They're good enough to be focused and look decent. It's pretty impressive that it even has front flash.Dual SIM is nice as an option for people who travel or need a second line. I love the options on Marshmallow that allow you to control which SIM is the preferred one for calls, texts, and data. You can also just switch one off.Despite this being a \"budget\" phone, I will happily use this phone as my primary and only phone. :)","rating":5},{"id":"R2OLURCPCUAKYZ","title":"Great phone","text":"I bought this phone when my Samsung s3 stopped working after a couple of years. I didn't have a lot of money to put into a new one so I took a chance with this. It worked with my straight talk plan. I like it, and compared to my samsung, I would say what you are paying for is the ability to use apps and text and make calls. The camera isn't anything great, and for some reason  my GPS is weird but that might just be me. My favorite thing is that when you're using something on your phone and you get a call, the answer/dismiss buttons are at the top and out of the way so you don't hit one on accident.","rating":5},{"id":"R1HAKEFO0P9149","title":"Amazing phone","text":"I love my new Blu R1 HD 16 GB. Not only for the low price of $59.99 but how responsive everything is about this phone. From touchscreen to CPU speed. I havent had any issues at all. My text messages seem to go thru faster and so does my phone calls. I also notice my reception on some places I never got before now I do. The selfie front camera at 5 megapixel is awesome especially with flash. Not much new phones around that has a 5 megapixel with a flash right now even the galaxy s6 and iPhone 6 doesn't have that capability and your talking about a $600+ device. I say this phone overall is great and for the price it's amazing.","rating":5},{"id":"R29ULJXXOH39P1","title":"Is band 12 compatible now?","text":"There seems to be controversy about whether this phone in band 12/700 compatible. I am revising my original rating from 2 to 4 stars because BLU support has been responsive, a recent auto update may have indeed added band 12, and reception is reasonably good, though not quite as good as my iPhone 7 which I compared the BLU to and which had me wondering if it is band 12 compatible.It is a lot of phone for the price. I do not find the advertising at all annoying. Rugged too. I dropped if about 4 feet onto tile and I see no damage whatsoever (it did land flat).Battery life is much shorter than my iPhone. Something to watch out for is the SIM slots. It is not obvious how to lift them to insert a SIM and in trying to figure it out, my nail snagged and bent a pin rendering that slot useless.","rating":4},{"id":"R2ABWSVLP0NUS9","title":"Limited capabilites (2G only non data sim)","text":"I knew this phone would not be the best given the price and the specs so I had lowered my expectations.  What really disappointed me is that I bought the phone for the dual simple capabilities.  I shortly found out that the second sim (as defined as the non data sim) would only connect to 2G.  A discussion with my provider embed in a disclaimer that their 2G network would be completely shutdown by the end of 2016.  The specs advertise that both sim slots are capable of 4G (which is true) but nowhere was I able to find any documentation that warned of only 2G.  I was also meet with frequent lagging and freezing.  I could not even consistently connect to my Fit bit.  Every time I opened the app I would be met with a \"the application is not responding\" message.Overall the phone was functional and had I not needed the second sim to work consistently I would have probably kept it as a backup.","rating":3},{"id":"R64LTQIN0LOV2","title":"I just cannot believe the quality for this price!","text":"I've had this phone for two weeks and I love it. For the price, it can't be beat. I compare it with my 4 year old flagship, the Samsung Galaxy S3. My minimum criteria was fully met, which included LTE, camera specs comparable to Galaxy S3 (8MP,5MP), 16GB built in storage, 2GB RAM, Quad-core processor, Minimum 4.8 inch screen. Although the phone is not perfect, it is more lovable than my Samsung Galaxy S3, especially for the price, which is why I give it 5 stars.Pros.* The 5 inch screen is beautiful to look at and the rounded glass on the edges make it a delight to hold.The Screen is bright and auto-brightness works great. Text seems easier on my eyes than old Samsung Galaxy S3.* Battery life is great! lasts 1.5 days with heavy use (video watching, audio listening, tethering) and 2 days with normal use. Tethering is quick, flawless, lightning fast LTE (hit 35mbps download!).* Android 6 Marshmallow is buttery smooth. Camera software is feature rich! Cameras have a higher dynamic range than SGS3 and exposure is better, especially on skin tones. I can take panoramic selfies, dual-view pictures that use both cameras at the same time. Wide-angle selfies are very good. In fact, the front-facing camera is significantly better than my old Samsung Galaxy S3.* The phone is sleek, light, and fits just right in my medium sized hand. I love that you can set it to turn on and off on a schedule.Cons.* Media Volume could be louder, but it's acceptable. Screen goes completely black when viewed through polarized glasses. (Only went 70% black with old Samsung Galaxy S3). This makes it dificult to use with polarized sunglasses outside.* Marshmallow phone-dial interface is fast, but is missing features. It is dificult to search for a contact and view or edit it. It always defaults to calling them when you find and select a contact.* Photos with the main rear camera are marginally lower quality than those with Samsung Galaxy S3. Even though exposure and dynamic range is better, the pixels themselves are smudgier than those on the Galaxy S3.* Speaker-phone volume could also be louder but regular phone volume is very good.","rating":5},{"id":"RVBL4WYZNMOI","title":"No a bad budget/burner phone","text":"Surprised at the device vs. cost.First thing I want to say is reading all the negative reviews, there are way too many who seem to expect a $60 phone to perform and work as a $600 phone does, Not going to happen. The R1 HD is a BUDGET phone. Heck, I even say it is a BURNER phone. But for the $60 paid it works wonders. **For those who bought the $50 version (1GB RAM/8GB storage) you are at a huge disadvantage. 1GB RAM is far to small for Android 6.x and with only 8GB main storage you will only be able to add a couple apps. Additional memory card foes NOT expand you main storage, only storage for music/photos/videos/etc.**The good points about this phone:1.Almost a stock Android experience. All the additional functions of Samsung/LG/HTC/etc. are not part of Android. They are added by the manufacturer. This is very close to stock Android except for the Amazon apps and a few minor other things.2. Dual SIMs work well for people who need to use this with two different providers. Remember only ONE sim can be used for data. The other can only be used for calls/SMS.3. With T-Mobile I have had no problems using it with data. I even use it as a hotspot and have not had any problems. WiFi and Bluetooth work well for me. Settings for them are straightforward.4. Screen is decent for a $60 phone. Works well indoors and out of direct sunlight.5. Amazon ads ONLY appear on the lock screen. reviews you read from others saying they pop up all the time are incorrect. They are most likely caused by an app they installed that likes to feed full screen ads all the time. This is a user issue, watch, and READ, what you install. Free is not always free.The bad things about this phone:1. Screen is poor in direct sunlight.2. External speaker on the back is set so low you can barely hear it, even on full volume.3. USB port is backwards from all other phones I have ever encountered. Might limit your use with a dock.4. Battery capacity is small. If you are a heavy user this may be a problem for you.5. Support from BLU for Android updates will most likely be non-existent. They have a terrible track record.One final thing. Concerning the Wireless Update app that was determined to be sending info to the marketing company in China. The paranoia runs rampant in the USA. The issue was fixed by BLU. Current phones will use the Google OTA software. Older phones will be using the original OTA software but has been updated to remove the date packet sending. Plus what is some China marketing company going to do with your info? Give it to their government and do what? It's not like Google/Apple/Microsoft don't do the exact same thing to your other devices. Get a grip.This is a fine BUDGET/BURNER phone. If it breaks at least you are not out $600+ for a new one or $200 for a repair. Just buy another or opt for something that can handle your usage and handling.*Update* Added a couple photos with and without the case made for this phone and sold by amazon - https://www.amazon.com/dp/B01GIRTG7G/ref=twister_B01I0ZP29U?_encoding=UTF8&psc=1","rating":4},{"id":"R2BR4I9U8U0WLW","title":"BEST BANG FOR YOUR BUCK !!!!!","text":"I received the BLU R1 HD - 16 GB – Black yesterday in the mail.  I was too excited to receive it and for $ 60, I did not expect much out of it.  As I opened the package, I found a nice looking box in the package.  It was nicely sealed and well packaged.  I opened the tab and could not wait to get my hands on this amazing product.  As I opened the package, the phone was nicely wrapped in a bag with a screen protector on top to protect the screen from scratching.  After I took the protective cover from the phone, I found an amazing looking screen the fitted in my hand nicely.  The curved screen is often found in high-end phone but I was surprised to find in a phone under $60.  Once I got my hands on the phone, I was looking for the battery to put it in and get it started.  However, I could not find the battery.  It turns out that the battery is built in and it is non-replaceable battery.  But that’s ok, for $ 60, still not a bad bargain.  I turned the phone on and it took about 10 minutes for set-up and update the phone.  After that, I put my sim in and I made couple of phone calls.  It has duel sim card slot and one micro SD card slot ( The maximum accepted is 64GB).  The sound quality was very good.  I tried the speaker phone and it was loud as well.  After that I downloaded couple of games to try.  I was blown away with the speed of processer.  It held up very well.  What was more impressive is that it stands by its name HD.  That’s how the picture quality was.  After that, I jumped on Amazon videos and started watching movies.  Again, the clarity of the picture was outstanding.  Another benefit of this phone is that because it is BLU-Amazon partnered phone, you can download Amazon Prime Videos on the phone when you have Wi-Fi so you can watch it offline when you have no internet connection.  To me, it’s a plus benefit.  Now comes the part of actually putting the phone to the LTE test.  It did stand up to the LTE test.  It downloads and uploads in a zoom.  The down side to the phone is that the phone camera quality lacks a little.  However, for $ 60 it is to be expected.  Another reason this phone receives four stars from me is that the manual is very poorly written.  In the packaging there is no headphones like other manufacturers do.  But again, for $ 60 it’s a great phone.  Not advanced as other but very well designed and easy to use phone.THE PROS OF THE PHONEPRICE ( WHEN COMPARED TO OTHERS)1.3 GHz Quad Core ProcesserQUALITY 5.0 “ CURVED  SCREEN & RESOLUTION4G LTE UNDER $ 60 (FOR PRIME MEMBERS)ANDROID 6.0 (LATEST VERSION UPON RELEASE OF THIS PHONE)2 GB RAMEXPANDABLE MEMORY (UP TO 64 GB)CONS OF THIS PHONEPOOR PACKAGING ( not bad but could have been better comming from Amazon)POOR MANUALNO HEADPHONESREAR CAMERA (ONLY 8 MP)FRONT CAMERA (5MP)In short… this is the best phone you can buy under $ 60 (for Prime Members)I AM A NEW REVIEWER THAT HAS ACTUALLY PAID FOR THE PHONE AND HAVE NOT RECEIVED THE PRODUCT FOR FREE.  THEREFORE YOU CAN TRUST MY REVIEW AS I HAVE NOTHING TO GAIN OUT OF IT.  [...].  THANK YOU FOR TAKING TIME TO READ MY REVIEW.","rating":4},{"id":"R1K03IBUILYEB0","title":"The only thing \"cheap\" about this budget smartphone is the price!","text":"The reasonably low price is the only thing that is cheap about this smartphone! I purchased this phone with the intent of using it for when I go on vacation (especially abroad) and don’t want to risk anything happening to my expensive iPhone. The fact that it is unlocked makes it easy to just pop in my sim card and go as I see fit.FIRST IMPRESSION:My first impressions of the phone are that although light, it does not feel “cheap” like you would expect a phone in this price range to be. It is about the same size as an iPhone 6, or Samsung Galaxy S5 in case anybody was wondering.Typing on the phone is easy and feels good, due to the responsive feedback. The auto-correct is accurate and makes sending texts messages a breeze.SPEED:The phone features a 1.3 GHz Quad core processor, and 1 GB of ram. Although there ARE phones with better specs out there, I have found that this phone was able to keep up with just about everything I wanted to do, whether it is browse Reddit, order on Amazon, etc. The phone comes with Android 6.0 Marshmallow which is very easy to navigate and user friendly.CAMERA:The camera quality on the smart phone is OK. Not horrible by any means, but not the best either. The camera does not perform very well in low light, and will take grainy pictures if a good amount of light is not present. Comparing to my iPhone 6s Plus, I have found that although the R1HD does not capture as wide of an area as the iPhone, pictures come out a bit warmer, which was a pleasant surprise. The camera is 8 mega pixels, and the front facing camera is 5 mega pixels. Not bad for $50. I was not impressed with the video option. Videos come out a bit shaky and grainy. Please see my picture and videos for reference.SOUND & CALL QUALITY:The sound quality of the R1HD is good. Calls come in clear and do not sound muffled. I really like that the manufacturers of this phone decided to put the speaker on the back. This means that when lying down and watching videos, the speaker is not covered like on the iPhone. While I do like the placement of the speaker, it is a bit small. I would have liked a dual speaker design like the iPhone. If you plan on showing a group of friends a video, it may be a bit difficult to hear. In short, the speakers are not the strongest. I would definitely recommend using head phones if you plan on listening to videos of movies. The speaker is OK at best.OTHER:The lock screen offers do not get in the way as much as one might think. In fact, I have found that I’ve already been introduced to some products I wouldn’t have normally known about. I have included a picture to show what the ads look like. IF the ads bother you, you can spend a bit more money and purchase the version without ads.OVERALL:Overall, for a smart phone in this price range, you can’t go wrong. Although the video quality and speaker could be a bit better, you can’t expect much more from a smartphone in this price range.Please let me know if I can answer any questions about this Smart Phone!","rating":4},{"id":"R1M1BUKIFTBFT1","title":"Awesome Phone for the Price, and in General!","text":"I've had this device for about a week now. If there is anything that comes up that I don't like after a month I will update the review.***Usage***The main thing that's missing in all reviews is how the people are using their device. This device is actually being used as my daily driver. I upgraded from an ever aging galaxy s3 which was rooted with cm 12.***Hardware***I know I know this does not come with a snapdragon 820 or 4 GB of RAM. Is it as fast as a galaxy s7, or a One Plus 3? No. But this costs sixty dollars where as the One Plus 3 costs $400, the s7 costing about $650. In fact if you look up on YouTube this device vs Galaxy S7 speed test, the S7 is barely faster. With my usage the hardware is just fine. The processor is snappy enough. I've had little to no lag. I've experienced no force closes. The 2GB of ram can keep about 5 apps open. And 16 GB of storage is more than enough for me. However, there is a micro SD card slot if 16 GB just isn't enough. The screen is better than my s3 screen. No it's not 4k. It isn't even 1080p. It is a 720p IPS panel. This pannel seems like a very good 720p pannel. Viewing angels are great, and colors seem good enough to me. The pannel is also protected in Gorilla Glass 3 which should offer enough protection for most people. Finally, the build quality is awesome for this phone. I know people will hate me for this but the build quality is better than a Galaxy S5 (However the Galaxy S6, S7, and One Plus 3 all have better build quality). The S5 has plastic edges, this has metal edges. The S5 also has a plastic back. So does this. This is an A+ in build quality for the price. And a B+ in build quality for any price. All in all the hardware for the Blu R1 HD is superb. I'm a geek and I have no problem what so ever with the speed of this phone. If you do basic stuff like Facebook, Instagram, Web Browsing, Music Listening, YouTube, and even games like Candy Crush or Temple Run this phone will do very well. Even more demanding games will do okay. However if you want the best performance, fastest game playing device, this is not for you. Instead look at a One Plus 3, Galaxy S7, or an iPhone 6s.***Cameras****The cameras on this phone are not any where close to as good as an S7, S6, S5, or S4. I would say the back camera does a little bit better than my Galaxy S3. The camera also shoots way fast. I would say the Back camera can snap a picture about as fast as the Galaxy S5 does. The front camera in my opinion is equal to the S5 front camera. And it even has front facing flash so low light quality should be better than the S5 on the front camera. All in all for the price point the camera is excellent, and in general the cameras are okay. I'd give an A+ for the price point, and a B- in general. I will include some sample shots in the pictures section.***Speakers***My biggest complaint about this phone is indeed the speakers. Yes it is a budget phone. No I don't expect these speaker to have good mids, lows, and good bass. However I do expect the speakers to be loud enough. These are anything but loud. Most YouTube videos require you to turn the volume all the way up just to barely here what the person is saying. If you watch movies these should be just fine if you like turning the volume up all the way. In this price range I would give the speakers a B-, and in general a C.***Wifi, Cell Service, and Bluetooth***The wifi is great on this phone. I seem to get the same signal strength out of this device as my mom's S7 does. However on our 100mbps fiber to the home network the S7 would get almost always 110mbps. Where as the Blu R1 HD would get about 37mbps download. The Blu also does not support the 5GHZ band.As for cell service, the Blu worked wonderful on AT&T's network. Cell strength was always the same as the S7. The Blu scored on average 61 mbps on AT&T's LTe network. I have yet to test my mom's S7. However, in the future I will update this review with the results of my mom's S7. Bluetooth was just like any other device. I could go about 15 feet away from my Bluetooth speaker before music started to get choppy. Bluetooth streaming was also smooth with little delay. There was also no \"choppiness\". All in all for sixty dollars; connection wise this phone gets an A+. And in general a B- (because of the wifi speeds).***Call Quality****Call Quality is just like a flagship from 2012. There is no HD Voice. There is no Voice over LTE. And there isn't even support for Wi-Fi Calling. However, calls were always loud enough, and sounded just the same as my Galaxy S3. I also received no dropped calls. All in all for the price point, call Quality is an A-. And in general, a B-.***Software***The software on the Blu R1 HD is nearly stock Android. The only differences I could see was that Blu does not use the Google Now Launcher. And there are some extra display, and sound settings. There is also a separate Gallery app. And the camera UI is tweaked. The software always runs smooth, and is very fast and fluid. There is also no bloatware, except for the Google apps.If you get the Amazon Prime version, you will also have Amazon's apps preinstalled.You will also have ads on the lock screen which I personally do not mind at all. I have no complaints about the software, and I'd wish all budget phonrakers would take the Stock Android software approach.***Updates***Many people say BLU does not have a good history for updating their devices. This is true; however, I've already received two software updates in the two weeks I've had this phone.***Final Verdict***In my opinion there is no better phone you can get at this price point. If you don't do a lot of heavy gaming this phone is a much better choice than forking out $650 plus for an S7. I would also only buy the 16GB and 2GB RAM model if only because in this day and age that is the minimum.","rating":5},{"id":"R1OUEIW4C1HATT","title":"For $60 you can't go wrong! Works PERFECTLY with FreedomPop. Step by step instructions at bottom of review!!!","text":"I absolutely love this phone! I reluctantly replaced my Samsung Galaxy S4 (was beat up cosmetically) with the BLU R1 HD and I'm not sorry I did. Compared to the Galaxy S4 I was using it's just a fast from the lock screen to running apps, slimmer, and the display is beautiful with the curved glass. I equipped the phone with a BLU R1 HD ArmorFlex Case + Screen Protector - White/Gold for a case, a SanDisk Ultra 64GB microSDXC UHS-I Card with Adapter, Grey/Red, Standard Packaging (SDSQUNC-064G-GN6MA) in it for use as internal storage, AND on top of everything else it has worked perfectly with a FreedomPop Global Talk, Text, & Data w/ 3-in-1 SIM Kit to use FreedomPop as my carrier!Pros:* Slim Profile* Curved Glass, Bright Display, and Vivid Colors* Glass is smooth to the touch. Not sticky feeling and not a fingerprint magnet.* Dual Camera w/ Dual Flash* Dual SIM* Unlocked* Useable with FreedomPop* External SD Card can be used as Internal Storage* Amazon LOCKSCREEN Ads are not Intrusive* CHEAPCons:* Back of phone has a tad rubbery grip feeling (personal preference)* Phone was picky about the brand and size of SD Card I used. I tried many Samsung Class 10 and UHS-1 cards that ended up not working. Worked perfectly with all SanDisk UHS-1 cards I put in though.* SIM Slot 1 gave me problems with the FreedomPop GSM SIM. SIM Slot 2 works perfectly.FreedomPop Setup:I was worried I wouldn't be able to setup the FreedomPop SIM because of other people having issues setting it up. I have to say that it was pretty straight forward. The instructions that came with the FreedomPop GSM SIM were correct however it missed a few things so i'm going to list the instructions below in 10 easy steps.Step 1 - Download the \"FreedomPop Messaging\" app from the Google Play Store.Step 2 - Insert the FreedomPop GSM SIM into SIM Slot 2 and lock it down.Step 3 - Go the \"Settings\" -> \"... More\" -> \"Cellular networks\".Step 4 - Turn on \"Data roaming\".Step 5 - Click \"Access Point Names\"Step 6 - Click the + in the upper right corner.Step 7 - Set Name to \"FreedomPop\", set APN to \"freedompop.foggmobile.com\", set APN type to \"default\" and \"dun\".Step 8 - Click the 3 dots in the upper right corner and click \"Save\".Step 9 - Select \"FreedomPop\" as your new APN and click the back arrow.Step 10 - Restart your phone.I guess another step would be making sure you activate your new GSM SIM card on FreedomPop's website but that's simple enough and it only cost me $0.01 to activate it.Overall I would say that I am very pleased with my purchase and am actually planning on getting a few more of these phone with the FreedomPop GSM SIM kits for family members.","rating":5},{"id":"R2YWILZF3SXDFU","title":"Amazing","text":"I am a bit of a smart phone addict and I couldn't resist seeing what a $60 smart phone looked like so I ordered the 16GB version and it arrived a week ago. Over the past 24 months I have had a Nexus 5, Note 4,  Moto G, LG G4, Nexus 6, Nexus 6P, Nexus 5X, Nextbit Robin, LG G5 and the Blu R1HD. I had low expectations for the R1 despite the mostly positive reviews so when I pulled it from the box I was surprised how solid the build was and even more impressed with the rolled edges of the screen. The back is almost as grippy as the 5X and has a nice matte finish and it doesn't creak, pop or flex like the plastic back cover of other phones. The power and volume buttons have a quality feel to them, but having the power button below the volume rocker is taking awhile to get used to. The matte finished metal trim around the egde feels nice and seems to be durable and the phone is very comfortable to hold.The screen resolution is very good and max brightness will allow you to use it outdoors in direct sunlight  with no problems. Its definitely the best 720 screen I have ever seen.  Battery should get most people through a full days use. Call reception has been good and no one I have talked to has noticed I am using a different phone. Signal strength has been excellent, but I am in a great area for T-mobile. At home I average 80Mbps up and 25 down which is similar to the other devices. Bluetooth has worked flawlessly with my Pebble Time and there have been no problems with wifi reception. The back mounted speaker is the only complaint I have. It sounds okay, but max volume could definitely be higher.The cameras are better than I expected for a $60 phone and the front flash is a nice feature for those that like to take selfies.More surprises for a $60 phone were the dual SIM trays, it runs on Marshmallow and its always nice to have expandable storage. The ads are a very minor inconvenience and amount to nothing more than a tiny ad on the lock screen each time you turn on the screen that can be swiped away in a fraction of a second.The speed of this phone is so good that one morning I was thinking I was using my 5X, but was on the R1.This phone is so good that after a full week of use I have not had the urge to pull my G5 or 5X out. Granted if I was going to take some important photos I wouldn't use the R1, but those situations don't happen daily for me so it hasn't been an issue.  IMHO there is nothing that comes close to this phone for even double or triple the price and I honestly thought I would be disappointed and return it, but its a keeper.  It will be used for a backup phone for me or one of my kids or a friend that needs one in an emergency.I paid full price for this phone and have received nothing in return for this review.  Its simply that good!","rating":5},{"id":"R1GGVCOV8KK0JE","title":"Good phone, great price, bad speaker","text":"I find the screen great - bright and sharp, despite the reduced number of pixels (1280x800 I think.)  I can see the screen even when the sun is shining directly on it.  I cannot see any difference between its screen and the screen on my Samsung S4G (2560x1440 pixels.)The phone works great after I had some trouble getting my AT&T SIM card and Samsung SD card to work.  The phone didn't recognize the SIM at first, but after several removals and re-insertions, plus a reboot, it worked fine.When I inserted a fresh Samsung 64gb microSD card with newly copied data, the phone reported that it was corrupt.  After reformatting in the phone, the data was gone and had to be replaced.  The phone offers two options for formatting: 1) for use only in the phone, and 2) for use in the phone and in other devices. I suggest using the second option if you want to load data using an external card reader.Edit after one month:I added a second SIM (AT&T) and both lines work., but ...I find the low speaker volume a big problem.  I can't hear it ring!  When making or answering a call, I can barely hear the other person, even in speaker mode.  I am taking off another two stars for this problem.","rating":2},{"id":"R16JOO9R6R4WR8","title":"Purchased two of them and they are the best phones.","text":"I purchased two of these phones. One for I and the other for my wife. We received the phones two days after the release day.Phones we own; One 16 GB + 2GB RAM and the other 8GB + 1 GB of RAM.To get a hold of two with one Amazon Prime account, Amazon makes you order a slightly different phone because they have a limit of one of these great deals per customer. It was because of this that both phones were not 16 GB + 2 GB RAM. If given the option go with the more RAM as it is worth the extra money and makes the phone run a little smoother.The applications that I have been mainly running on this phone are Ibotta, Waze, Facebook and Netflix and each application runs flawlessly and quickly. I used Waze in a 3000-mile trip and not once did Waze or my phone let me down. The picture quality of this phone is simply incredible as it is bright and vibrant. It truly looks like a high definition image and one will not have any problem with this phone in broad daylight.The screen is made up of gorilla glass 3 and if one searches youtube and looks over the many videos one will see that the screen is almost scratchproof. What this means is no more screen protector with bubbles. I have been walking around with this phone in my pocket with keys and the screen is as perfect as ever. This doesn’t mean it will not crack, it will, but if you are like me and don’t drop your phones often you shouldn’t have an issue with cracked screens.Many who might consider this phone may also be FREEDOMPOP users who are interested on how this phone works with that service.  So how does it work with FREEDOM POP? Flawlessly! Every month I get 200 minutes and 700 mbs of data absolutely free and this unlocked phone makes it possible to get this service.Over all I am a satisfied customer and would purchase these phones again. I honestly don’t understand the one star reviewers as this is only a $50, $60 phone and not a $900 I phone.Below is a sample of the pictures I took with this phone.","rating":5},{"id":"R274UJ0T6397GY","title":"BLU R1 HD - Black - Prime Exclusive","text":"I upgraded to Amazon's new smartphone  BLU R1 HD - 16 GB - Black- for the special price of $60.  It is a great bargain. My son and daughter loved their Black BLU R1 HD smartphones. My daughter and I bought the white trim over tan color case while my son has solid black case cover.  The phone is slim. The phone is fast.  I use Google to look up information. It does more things than the phone we had before. The headphone jack are at the top.  Great to place the smart phone in one's jacket when one is taking a walk.  One can listen to music while walking. The Camera - there is a front camera, rear camera and flash logo.  If you are going to take a picture in a dark place, one can use the flash logo meaning more light. \"Google OK\" or Voice actions comes on when you open your phone.  You can ask the smart phone to Call Jack, Get Directions,  Email Joe, Set Remainders, Schedule  meetings, play music, Set Alarms, Wake me up in 30 minutes, Open Calendar, and What's the weather in San Francisco????It has many Amazon Apps like Amazon Alexa, Amazon Kindle, Amazon Video, Amazon Music,  and Good Reads.I do my emails and composing by smartphone when the computer is not available.  This is Prime Exclusive!","rating":5},{"id":"R22C3RRFTJU704","title":"An ideal companion for a trip to Europe","text":"For the record I am writing this review on the Blu 16gb phone that I bought from amazon two weeks ago. I bought it to use as my primary phone on my vacation in Europe. When I am in the US I use an iPhone 6s  and didn't feel like going through the hassle brought about by  swapping out sim cardsSetup was fairly straightforward on its arrival. I got onto my home wifi in a few minutes since the phone already had some charge and downloaded Google maps and a few travel apps. Then into my travel bag it wentIt came out in Paris three days later at which point I bought an orange holiday sim card. This bought me two gb of data and a ton of calls and texts to use around Europe  I popped in the card easily  and could text and phone in the minutes. Orange would have put the card in if I needed them to. It  took me about twenty minutes to set up data as I had to walk myself through the android centric steps of adding an appn for the orange 4g sim cardThe phone worked great. Google maps for driving directions as well as for some restaurant reviews. Google for information on our tourist sites. I added Uber soon enough and that was seamless.The main weakness is the camera. Definitely inferior to other current phones but still OK if you don't want to carry around a separate device.Overall for the specific mission of acting as a primary phone for a  European vacation the Blu works perfectly.","rating":5},{"id":"R391I037V0X98Z","title":"98% Pleased, and the  other 2% doesn't matter  much in the  long run. :D","text":"I've been cruising  for a sim card  cellphone for a few  weeks.  this  popped  up on my prime account and  after thinking  on it a few hours, i snagged it.  as for the  phone itself.  man this is the ABSOLUTE NICEST  cell i've ever had!  it  looks  slick, using it is  simply FLAWLESS!! i mean it is a BEAUTY!!in my  opinion she's fast, handles everything well,  not tested the calling ability as  i'm awaiting  my sim cards to get here. i loaded some  movies  i had  on my pc hardrive and they played perfectly!  now, i did try  n watch braveheart via netflix.  there was occasionally a  slight hesitation in the  playback. a  minor issue in my  opinion.  i'm blown away by the screen.  it's so vibrant and  just all around a treat  to see.  it's solid  in the hand, i've  moderately large hands  for a female, and  this sits  oh so comfy  like in my hand.  the buttons were WELL placed!! i know  on one of my  other  phones  i always  hit the volume  buttons, had  to be conscientous  to make sure the  sound was  up to hear  it ring.  no such issue  with blu!! i played a  few  video games  via emulators. it performed  perfectly!  it was a  joy to play games  on.i played  some  music.  REALLY good sound. folks for  $59.95?  WELLLLLL worth  it!!i AVIDLY await  my Sim cards arrival so i can take this baby for a FULL test drive! :D 1  issue though, i've had  this 2 days or thereabouts and  for the  LIFE of me  i cannot get to my amazon app's list!! I  LOATHE  amazon underground and  on all my other devices use  the separate \"amazon app store app\". WELL on this? it  simply won't work.  if ANYONE has a workaround for this? i'd be seriously  blissfully happy to get that  info and  get  it running  on my  blu.UPDATE: i broke down n downloaded  \"Amazon underground\" and through there  is  a \"your apps\" link..so i CAN get to my apps, but it's way more effort than the  old  \"amazon appstore app\"  progress DOESN'T mean adding  more steps to do the SAME EXACT JOB, folks. that's  not PROGRESSION, thats DIGRESSION.  think about it.  the phone still ROCKS!! despite this silliness. :D  I'm surprised how SOLID this feels!!  you  know  cells  at this price are  somewhat, hmm, flimsy? fragile?  not this one.  i'm just tickled pink!!  Cheers!","rating":5},{"id":"R61D93TJ0VIXT","title":"Great Phone for a Cheap Price!","text":"As I do not have Amazon Prime I did pay the full price for the phone. I did not see the value of prime before so spending $99 to save $50 didn't appeal to me. White noise is only heard with my Sony MDR-7506 and not on any other headphones, I have not heard this sound with my Sony's from anything else either. Charging this phone is a pain via usb only. 2 Hours to charge it says and 2 hours later I have 1 hour and 54 minutes left. Plugged it into the wall and I got it to 100% in 30 minutes. Love that I was able to expand my storage internally for a total of 75GB of usable storage as this makes storage management much easier. Coming from a previous Blu device (Advance 5.0), this upgrade is night and day in all aspects.All other problems with this phone I've had has been with the software and was easily fixed.UPDATE 1 (10-5-2016):After playing around with this device for a longer period of time I can say that I like the battery life and the charging is not a big deal for me. Battery life for my usage lasts between 1.5-2 days from 100%. The wall adapter only takes 2hrs to charge the device 0-100%. For screen brightness I usually keep it very low when indoors and between 75-100% outside. I suggest turning GPS down to device only while turning off WiFi and Bluetooth scanning. Changing these settings gave me enough battery to last the 2 days instead of just one. I will recommend getting the 2gig version of the phone as the memory stands at around 750Mb when you receive it. I have then installed a few decently sized apps, 11 apps total, I now sit at ~900Mb of memory and at 7.2Gb of storage used. Expanding the storage is great as I am able to have all my music(20Gb) on my device to save data while on the go. I would also suggest grabbing a decent micro sd card as the one I put in has slowed down in read speed considerably, but the upside is that you can switch storage per app if you experience slow boot times for your big games. For the backfiring speaker this phone has, it is loud enough when in a semi-noisy environment. The quality of sound could be better, my older BLU Advance 5 sounds better when compared, but other than notifying me for a phone call or text it rarely gets used. Some kind of bluetooth headphones is preferred as mentioned above, the interference that comes from the headphone jack has spread from just my Sony's to other headphones and earbuds. As with my Sony's, this white noise is only heard from the BLU R1 HD and nowhere else.Pros:-Stock Android Feel-Feels solid and not cheap-Two gigs of RAM-Clear calls-Expandable Storage up to 64Gb-Dual SIM-Long Battery LifeCons:-Charging via usb takes forever (wall adapter speeds this up)-White noise interfering with my Sony MDR-7506 (has spread to other headphones)-Lower end on call volume (to me)-Speaker quality isn't great","rating":4},{"id":"RXTRXDMRAR0IQ","title":"Buy an unlocked phone and ditch your phone plan.","text":"This is an incredible phone for the price-Wow!  Spend the extra 10 bucks and get the 2gig of ram and 16 gig of memory.  Very beautiful, smooth and fast phone.  Battery life is pretty good, too.  Blu unlocked phones are amazing and so inexpensive.  Why anyone would rent or buy expensive phones is really dumb.  I have been a Tracfone user for years and it hasn't been til recently that they allowed the \"Bring your own Phone\".  I pay around 7 bucks a month and occasionally buy a little extra texts and data.  If you don't have a money tree and are on a budget, ditch your phone plan or contract and buy an unlocked phone and refill as needed.  Saving several hundred dollars a year is YUGE!  Still can't believe they offered this phone for 59 bucks.  You won't be sorry or disappointed.","rating":5},{"id":"RRGIKWS2SKUEE","title":"Great phone for the price","text":"updates 08/24/2016about a month into having that phone, it stopped ringing on incoming calls. i checked all the settings and everything is fine. i did a factory restore, it worked for a little bit and then started doing the same thing again. i think the phone has a software bug. and now i can't return it due to return window closed :(old review:Pros:1) Value: I Bought this phone for only $49 for Prime Members. i gotta tell you for the price it is a great buy.2) Graphics: the Phone is really HD and the screen is very sharp.3) Looks/ Feel: the phone looks and feels great. 5'' screen is beautiful and the material of the phone is rich.Cons:1) Camera: the front camera is not that good  if you planning on taking nice selfies. but it is not horrible either, back camera is better but also not very good. over all picture quality is decent for the price, but don't expect great picture quality.2) lock screen: the phone is sold with lock screenOffers & Ads which can be very annoying for some users. for me i don't mind it, but others may dislike this feature.","rating":1},{"id":"RXKEYMO0GS3RX","title":"Wish I got the BLU R1 before I got the Galaxy S6.","text":"I like this phone so much I got another one for my wife. I am replacing my Samsung Galaxy S6 edge plus with the BLU R1 HD. I really can't see enough difference between the two phones to justify the price difference. In fact the BLU R1 gets better cell reception on Net10 than my Samsung S6 does. Of course the BLU R1 doesn't have a camera as good as the S6 edge plus but it works fine. It's also not as pretty as the S6 but once you put a case on both phones how does that matter.\\This phone has no problem watching videos on Amazon prime and plays Youtube with no problems at all. The screen is sharp and clear. For me less to worry about if something ever happens to it and the fact that it works great is more than enough reason to stop buying over priced cell phones.","rating":5},{"id":"R21BDC03VWM370","title":"Excellent value smart phone!","text":"I am ecstatic with this phone! It far exceeds my expectations for an inexpensive smart phone.I do have two complaints -1. The camera SUCKS. If you are going somewhere special, make sure to have a good digital camera and/or video camera with you, because this takes terrible pictures.2. The call volume doesn't go high enough. I don't have bad hearing, and I have to turn it all the way up to really hear a conversation.But, hey, for $60, I can't complain. The speed and functionality of the phone is comparable to the Samsung Galaxy S6 I had before. I can do all the same things I did before, such as use Google Maps, play games, use FB Messenger, etc. I highly recommend this for anyone on a tight budget. Combine it with the Net 10 SIM card, and you've got a great budget combo.","rating":4},{"id":"R14QRPISSA48WW","title":"Great phone, I bought another one!","text":"Here's what everyone wants to hear. The Ads. I have only bought the ones with them. I have two of these, I would know. It's NOT A BIG DEAL! There will only be fullscreen ads on the lockscreen if there's no updates on your phone aka messages, IG updates, emails, missed calls, etc. Even if there is? It's really not a big deal! I love Amazon and I don't mind their ads, in fact, I have already seen things that I ended up needing and purchasing them, even some free apps that I will be using for a long time. Anyone with a Kindle, you understand. It's not a big deal. If you aren't a Prime member and are really anal about seeing things you don't want on the homescreen, get a different phone. Okay, or just get the ad free one.Now.............GREAT phone! Unlocked goodness. I use it with T-mobile, but will be, shortly, switching to Cricket Mobile for the savings.I came from an LG G3 that was having sim-card tray issues, so it was a big change (downwards) for me, but this phone is still awesome. It's relatively light, has great colours, uses the latest Android OS, and is relatively quick compared to my LG G3. I got this phone on Prime Day 2016, so I've had it quite some time now. It has two SIM card trays, which is great for someone who travels overseas often or is brave enough to use one phone as both a personal and trap phone......o.O nevermind. It can keep up with the amount of apps and games I was using on my G3, so that's a plus.There are, obviously, downsides to this phone. One is the sound quality. It's NOT BAD, but it's so low compared to my G3, which I have problems with. That's even with the headset on. Secondly, people complain about...certain...phones having thin screens that shatter easy? This is one of them. I was recording myself doing a trick (skateboarding) and the phone fell on it's back. The camera lens was fine! Til I turned it over. Big crack. Then just recently, the phone fell indoors and broke a big chunk of the glass. There was an issue last week where the phone was freezing up, but would be fine upon restarting. That was a slight inconvenience but..yeah. There's no \"Music\" or \"Notepad\" app installed, so for music, for now, you must use Google Music app and download a notepad app. I bought another one, though, that's how much I like this phone.","rating":5},{"id":"RW4QO3YRFYL48","title":"Good Traveling phone","text":"I bought the BLU R1 HD as a travel phone. One that it wouldn't hurt if it got lost or stolen while traveling. I has delivered what was expected, you get the best bang for the buck a the price range (Amazon Ads). It is not super fast as expected but with with Android 6.0 the external memory card can be used as main memory, so the 16 GB is not a problem. My unit was updated to use LTE Band 12 OTA and it worked in Peru (Claro) fine. It did not work with Cellcom in Israel since Cellcom uses Band 3 which is not supported, I ended up with 3+G, a bit slow but it worked fine.I'll be taking it to Croatia and see if the LTE works over there. One drawback that I have noticed lately is that it seem WiFi is draining the battery a bit too fast, Even with smart power management, the WiFi seems to drain 30 to 40% of the battery overnight, and it won't last through the day.","rating":4},{"id":"R124Q93AT0QAX0","title":"Ok phone, not near nexus-level but it's working fine for me....camera sucks","text":"So far so good, 1 month in.  4 stars compared to my old nexus 5 which would rate at 5 stars, but took a tumble which cracked the screen.  I was worried about the camera, but it's not so bad for what I really use it for which is snapping equipment pics, model info, serials, etc.  It is a bit far-sighted vs the nexus5, I sometimes used the nexus5 camera as a magnifying glass to see stuff I couldn't make out, like numbers on a bluetooth device, etc.  It's a bit more responsive than my nexus5.  There is no compass or gyroscope, so you'll need to learn how to orient via the sun, etc.  There is no qi charging but I never got that to work reliably on the nexus5 anyway.  I don't think cyanogenmod is worked out yet for this device, but I heard it is in the works as of 161020.I love these cheap phones.  I think I paid more for the CASE that my iphone 3gs went in.  And $650 for the new pixel?  I think I'll hold out for a while and see if they put out something closer to the pricing of the original nexus5.  This blu r1 hd can always be used as a backup phone if I upgrade.170103 update:  phone is still working.  The camera sucks for close up shots like serial numbers, etc, it just won't focus.  I had to go through the firmware to make sure the Chinese malware was gone, thanks for that Amazon.170321 update:  gave up and fixed my old nexus 5.  Much better camera than the blu r1 hd.  I couldn't encrypt the blu or install cm/lineage os.  The blu seems well built, the back cover comes off easily with a thumbnail to access the internals.  I just wish they used a better camera.  The bluetooth disconnects/reconnects sporadically.  For $60 though, this is a decent backup phone to have around.","rating":3},{"id":"R3P10HZ216PKD8","title":"Best Budget Smartphone!","text":"As a quick summary… GET THIS PHONE! You get 90% of the bells and whistles of a premium “flagship” for a fraction of the price. For $60 you simply cannot go wrong. Phone works perfectly and does everything I need it to do.In depth: I purchased this phone as a temporary replacement after my LG Nexus 5 died. This was supposed to hold me over until I could figure out a real phone to purchase. My expectations were extremely low for such a cheap device. I opted for the $60 version since it had twice the memory and RAM as the $50 one. This was a good move and something I HIGHLY encourage you to do if you get this device.As I unboxed the phone and held it for the first time I couldn’t believe this was a budget phone. It has a slightly curved Gorilla Glass display that gives it a real premium feel. I had it up and running in just a few minutes as it accepted my T-Mobile SIM card without issue. The phone ships with Android Marshmallow and BLU claims they may update it to Android N in the near future. Speaking of T-Mobile, it does not support Band 12 for their extended range LTE service yet. According to BLU, this will be resolved in a future over-the-air software update. Don’t worry, though, 4g LTE is blazing fast on it. Spec wise it is fair, actually pretty comparable to my LG Nexus 5. It runs most games without problems, even more intense 3D games such as Real Racing 3 (that does lag a little but is totally playable).Breaking this down to pros and cons:Pros:$60Running current Android softwareDecent performance and specsGreat solid feelAwesome battery lifeBright and clear displayGood GPS signal locksSolid cell signal receptionExpandable memory with SD card slotDual SIM$60 – worth mentioning againCons:Slower than some of the more premium phonesSomewhat low pixel density (but not really that noticeable)Touchscreen could be a little more sensitive/responsiveCamera quality is not that goodSub-par built-in speakerNo NFC, compass or 5ghz WiFi capability (2.4ghz WiFi works great though)Regarding the Amazon Prime version… Yes, there are ads on the lock screen… and ONLY the lock screen. If you don’t have any notifications on your tray, the ad is full screen until you unlock the phone. If you have notifications, the ad is much smaller and appears just as another notification with “ad” specified in front of it. I always have current weather conditions on my notification tray, so I only see the small ad. This is not a big deal. If you so choose, the ads will be relevant to your shopping history on Amazon, so useful things will appear. This is how Amazon brings the price down for this phone. Otherwise, it’s $110. A $50 savings to deal with a small ad on my lock screen is worth it to me. You won’t see any other ads on the device. It does come with some Amazon apps pre-installed but those can be disabled if you choose. There’s also a default Amazon Prime widget on one of the home screens that you can also remove. I should point out a recent software update pushed out by BLU appears to have eliminated the work-around some users of this phone had to get around the lock screen ads. Installing a third-party lock screen no longer bypasses the built-in one.Summary: After spending a week with my new device I have already decided I won’t be shopping for a new one any time soon. I am so impressed with BLU that I will be keeping this phone and pocketing the extra $740 I’m saving by not getting the Samsung Galaxy S7 Edge (maybe I’ll take a vacation with that extra money instead). Sure, there are some features sacrificed to save money, but don’t let any of that scare you away.","rating":5},{"id":"R16AD4OM7IKV88","title":"Just a phone...","text":"Well it's a phone... I bought 4 of these phones 2 8gb and 2 16gb phones. I took a 16gb and split the other phones with my kids. It works as good as the price. Many features on my phone don't work. I can't add any favorites or make a group of contacts or add photos to contacts either. I don't like the fact that the only info you can add to a contact is a phone number. Sometimes the phone freezes. I'm not a person that needs a lot of features but I do like to have my basic ones. And this phone doesn't have it.","rating":2},{"id":"R27AJYROPWODVK","title":"Believe the hype. This phone is amazing!","text":"Waaaaay back when Android phones first came out, my wife had several and they were all hunks of junk. I eventually ended up switching from Blackberry to iPhone and vowed to never, ever go the Android route. Fast forward about six years later and I've found that I've fallen in love with Android by accident.In an effort to save money, my wife and I decided to ditch AT&T, downgrade from the iPhone 6, and take a chance on metroPCS. We initially decided to go with one of their free options at the time, the LG K7, with plans to upgrade to new iPhones later. I ended up very surprised. It honestly wasn't a terrible phone for the three months I used it. The phone was much better than previous Androids my wife had, even though what she had was supposed to be the best on the market at the time. The economic Android has turned me away from the iPhone, at least until Apple decides to let their users have a bit more control.Of course, this left me wanting to explore a better Android option, which led me to the BLU R1 HD. From reddit, to YouTube, to techie websites; all of the information I found about this phone was positive with very few cons. After a month or so of research, I finally decided to make the purchase.We've only had the phones for less than a week and I couldn't be more satisfied with the purchase. The ease of use is amazing. The phone is quick to respond and the pictures are comparable to that of the iPhone 6 (except for low light settings). There's nothing cheap looking about the phone at all. It feels good in your hand and doesn't feel like a cheap piece of plastic like other econ Androids.Right out of the box, the battery life is better than any other iPhone I've ever owned. On a typical day with my last iPhone I would be at 20% or lower by midday. I'm currently nearly finished with my workday and am currently at 43% with the BLU R1 HD with normal daily usage.I'd also like to mention it works perfectly on metroPCS (metro PCS). In fact, their service works much better on the BLU R1 HD. Phone calls are much more clear and aren't dropped like they were on the LG K7. However, I was unable to activate the phone online or by phone. I had to go into the store. Take your sim card with you. Since they use micro-sim cards, you'll need a nano adapter if you want to use your current sim. They may have an adapter that they'll give you for free. They were all out while I was there. If they don't have one available, you'll be charged $10 for a new sim.Also, if you're worried about the ads, they're hardly noticeable. I only get full-page ads once every couple of days or when I reboot the phone.If you've been reading about this phone and have been thinking of getting one, believe the hype. I really can't believe the 16GB with ads was only $59.99. I cannot say enough good about this phone. If and when it starts to crap out, I'll be sure to update this review with my issues.One more thing, I would recommend getting BLU R1 HD Case,[3 Pack] ATLY(TM) [Black][Clear][Purple] Soft TPU case From BLU R1 HD instead of the case BLU makes for this phone. I ordered both and the brand case did actually feel cheap and pocket lint stuck to it badly due to the type of rubber it was made of. The ALTY cases are sleek.","rating":5},{"id":"R1JQ0LLLRH67YY","title":"The BLU R1 was the perfect price, and the compatible phone case was affordable ...","text":"I finally had to retire my old Samsung 2G phone because cellular carriers are no longer supporting 2G.  I wasn't planning to purchase a new device, and I didn't want to spend a lot of money for a phone that I only use for emergencies and texting.  The BLU R1 was the perfect price, and the compatible phone case was affordable too.  Maybe I was just used to the really old phone, but I am super happy with the BLU R1.  The phone was easy to set up, it responds quickly, and is easy to use.  I'd recommend the YouTube instructions for placing the SIM cards.  I never would have known the metal piece over the SIM card area slides up and folds out making it very easy to insert SIM cards.  The best part is if the phone gets lost, stolen, or broken I'm not out $700, and at $59 I don't need to insure the phone.  I use my phone with PureTalk which is serviced through AT&T and I haven't had any problems.  I also plan on using the second SIM when I travel internationally.This would be a great product for youngsters, budget orientated people, or someone that isn't concerned about having the latest and greatest iPhone etc.","rating":5},{"id":"R1UTMINKN9U4IX","title":"BLU R1 HD: Pretty good smart phone for the price !!!","text":"R1 HD is super good smart phone especially for the price with Amazon ads (I got 2GB RAM and 16GB internal memory ofcourse you can expand it).Pluses:- Feels solid in hands- Looks good especially from sides and front (back is bland)- 1080p screen, goes pretty bright, It doesn't have AMOLED screen like Samsung galaxy S7 or One Plus 3 but its pretty decent. Nothing to complain.-  Amazon ads are not too disturbing, they are similar to regular notifications on your lock screen (sometimes full size)- Very close to stock android (runs 6.0)- Battery life is very good (1 full day with normal usage)- Performance is impressive for it's price point.- Expandable memory- Dual sim card slots (micro)Minuses:- Cameras (front and back) are poor. Offnote front camera too has a flash which is nice.- No gesture controls- Back of the phone looks pretty bland (you can manage with a case but BLU case which is available in amazon for $6.99 is bulky and you lose the look of the phone)- Power button and volume down button are too close. Texture of these buttons are same, so I often get confused and change ringtone volume (volume down) when switching off the screen.All in all it's a very good smart phone especially for the price.I definitely recommend R1 HD especially to elders or who don't care about cameras.","rating":4},{"id":"R2Y2MCCO0U36VD","title":"An excellent entry level phone at a great price","text":"BLU R1 HD - 16 GB - Black - Prime Exclusive - with Lockscreen Offers & Ads If you're looking for a good phone at a better than good price then look no further. The BLU gets a lot right with the R1 HD, with its solid design and build quality, decent performance, and excellent software experience. The price point more than makes up for any negatives like the annoying ads, (with the Prime exclusive version) and the fairly low-quality camera. You will be hard-pressed to find a better phone under 60.00$ Highly recommendedSpecs:Display  5-inch IPS LCD display1280 x 720 resolution, 294 ppiProcessor  1.3 GHz quad-core MediaTek MT6735 processorMali-T720 GPURAM  1/2 GBStorage  8/16 GBexpandable via microSD card up to 64 GBConnectivity  Wi-FiBluetooth 4.0GPSFM RadiomicroUSB 2.0Battery  2,500 mAhCamera  8 MP rear camera, f/2.0 aperture, LED flash5 MP front-facing camera, wide-angle, LED flashSoftware  Android 6.0 MarshmallowDimensions  143 x 70.7 x 8.5 mm142 grams","rating":5},{"id":"R19QRLYE0UJPUY","title":"Prime Phone - Blu 16GB","text":"I'm giving this four-stars right now, but I may bump it up to five later. I just got the phone today and have spent the morning setting it up. The phone I'm replacing was a BLU Studio 5.0 HD LTE which I was using with a pay-as-you-go Straight Talk account. Transferring the service over was as simple as pulling the SIM chip from my old phone and sticking it in the new. I also went ahead and put in a new 64GB memory card (Samsung 64GB EVO Select). The phone had issues with the memory card, telling me it was corrupt and needed reformatting. I let the phone reformat the memory card - but when it was done, it told me that it had a slow transfer rate and I should consider using something else. I going to use the card till I can get another one. I also bought a case for this phone when I ordered it - BLU R1 HD ArmorFlex Case + Screen Protector - Black/Black - which came with a screen protector. The case looks good on this phone.Like I mentioned, I was already using a BLU phone - there are some differences I noticed. This new phone is pretty bare bones - all you get in the box is the phone and the charger/cord. My other phone had come with a case and screen protectors. Another difference with the two phones - my old one had a removable battery, this new one's battery appears to be part of the phone. That concerns me a bit, as when my old phone would lock up for whatever reason (say during a reboot), it was easy to just pull the battery and then put it back in to get the phone working again.Once I got the sim card and memory card in and the phone turned on - I spent awhile updating a lot of the pre-installed apps and downloading some of my own from my Google Play account. I also had to open a lot of the pre-installed apps and logging into various accounts (like Google, Amazon, Kindle, Audible, Amazon Music, etc.). Speaking of apps - you have access to both Google Play and the Amazon Appstore (now called Amazon Underground), getting to your Amazon apps is a bit more challenging than the Play store - you have to drill down a bit in the Amazon store's menu to get to it.The phone works great - calls seem to be clear, speaker phone mode seems to work OK. I haven't done much with the camera yet - but the one picture I took as a test appears to be good enough for me - but I noticed that there are two settings for photos - 8MP (4:3) & 6MP (16:9), apparently shooting widescreen photos requires you to use 6MP.The lockscreen offers & ads are about as obtrusive as the ones on my Fire / Kindle devices - I'm use to seeing them to the point that I really don't notice them as being that obtrusive.All-in-all I like this new phone and I'm hoping it will serve me as long (or longer) than my last one did (two years). I'm more than happy with my purchase (and the discount that getting the offers & ads model provided me).ETA - just some random observations..1 - This phone seems to be missing some of the basic apps that I had on my previous phone, the default android music player and the sound recorder for instance. I was able to get those from the Google Play store but wondering why those were left off. My old phone also had the capability of doing FM radio (hardware & software), this new phone apparently doesn't have that feature.2 - I don't know if this is something unique to this phone or to Android 6.0 OS, but the phone has two options for using/formatting the 64GB memory card I added to the phone. One option allows you to use the additional memory for apps and data, the other lets you have access to the card to put media on it (music/video/etc). I tried the first way, but wasn't happy that I couldn't access the card directly (via the USB port) to simply drag-and-drop files from my computer onto the card. So I ended up formatting it the other way. But now I'm guessing I can't install apps onto the card. My previous phone allowed me to do both - put media on the card and off-load apps & data to it too.","rating":4},{"id":"R2GBXPHIC2IPOH","title":"Quality phone at an unbelievable price.","text":"I've had my BLU R1 HD phone for about a week and a half and I am very pleased with it. It is well built (does not feel cheap), has snappy response, good size display and comes with Android 6 (Marshmallow).  At the full price I think this phone is a great bargain, but at the reduced price with ads it's a steal.  The ads only appear on the lock screen, they don't show up anywhere else.  The ads take up the entire lock screen unless there are notifications. I use a weather app (WeatherBug) that keeps a widget on the lock screen so the ads take up no more room that a regular notification, I don't really notice them.  Some other reviewers have commented on the number of pre-installed Amazon apps that cannot be uninstalled.  I don't find this to be an issue, I simply disable the apps I don't need.  As for taking up storage, by using a Micro SD card set up as permanent storage it becomes a non issue. While on the subject of storage, there is no reason to purchase the 8GB model.  As for performance., my wife has a Samsung Galaxy 4 S and aside from the lower resolution, the BLUE R1 HD performs as well at a much better price. I only have two issues with the phone.  The quality of the pictures from the rear facing camera are not on par with the quality of the phone.  They are acceptable, however if you are an avid \"phone photographer\" you may be disappointed.  The second issue, which is rather insignificant, is that I find the body of the phone to be too smooth. I dropped the phone several times when I first received it.  My previous phone, a Moto G LTE, had a non-slip body which was very nice.  I recommend buying the BLU ArmorFlex Case for this phone, it is a non-slip case that protects the phone and is well made.  All in all, if your looking for a quality unlocked phone at a budget phone price I don't think you can go wrong with this phone.","rating":5},{"id":"RL175GYA92ARL","title":"One awesome phone, would give six stars if possible!","text":"This phone is awesome for $60 bucks. Screen is crystal clear, and it runs quickly (at least on the 2GB model). My only reservation was that the Prime Ad Supported version had a locked bootloader, but as of this weekend, root and custom TWRP installation have been achieved, so the possibilities are now limitless. This phone it worth it, if for nothing more than to tinker with. So very impressed at this point, and can't speak highly enough about it. Only negative, as others have said, is the volume of the speaker, however, for $60, who cares? How many of us use their phone speakers regularly anyway?It does not have NFC or a gyroscope, but at this price, you would not expect to see either of them.Update: I did have one episode where I used a somewhat sketchy USB cable to charge it at my desk. Powered the phone off, and put it on the cable, immediately it attempted to power up and the white Blu Screen popped up and shut off every 3 seconds until the battery was exhausted, and the phone would not shut down, or recognize any button presses, so no way to get into recovery, or anywhere else. Once the battery was exhausted, the phone booted up just fine, and is working properly.tl;dr Use a non-Blu charger and USB at your own risk, and if the continuous reboot issue occurs, once the battery dies, you should be good to go.","rating":5},{"id":"R11S4BECN26R7V","title":"The BLU R1 HD Delivers, With Only One Caveat","text":"After using an HTC Evo 4G LTE for the better part of the last 4 years, I was in dire need of an upgrade, but was really tight on cash. Luckily I found this phone. I have heard good things about BLU's phones over the past year or two, so I figured it was worth a shot.Fortunately, the phone performs very well. The device features Android in almost stock form, which means the phone is not being held down by custom skins and additions that may hinder performance out of the box. The cheaper \"Prime\" version also features ads on the lock screen. They're rather unobtrusive and much of the time, I forget they're even there. If it's a nuisance to you though, you could always root and install a stock ROM or CyanogenMod, which is very simple to do.The phone is also built surprisingly well, featuring an aluminium body and Gorilla Glass. The only \"cheap\" part would be the plastic back cover, but even still, it doesn't feel like it will break without intentionally applying force. The screen looks great, and although it's only 1280x720p, the PPI is high enough that when held at a normal distance from your eyes, everything looks clean and sharp. The phone also features \"MiraVision\", where you can make your own adjustments to the brightness, contrast, saturation, sharpness, etc. I used a few THX patterns from Google image search and got the screen pretty well calibrated now. The screen has a bit of \"black crush\" out of the box, so at the very least, adjustments need to be made in the brightness level there.Unfortunately, there is one drawback to a phone this cheap: The rear camera. Sadly, the front 5 megapixel camera often takes cleaner pictures than the 8 megapixel lens in the back. I would gladly have paid an additional $10 for an upgraded rear camera with a better lens, even if it were the same 8MP resolution. I will have to continue to play around with the settings in Open Camera (one of the more fully featured cameras on the Play store) to see if I can squeeze any more quality out of it.The phone also plays all of the games I've tossed at it so far with little to no hiccups, including \"Pokémon Go\", which runs very well. You should have no problems playing your favorite games on this device, which makes it's \"$60 with Prime\" price point that much sweeter.Whether you're looking for a decent phone to use as a daily driver, or maybe a cheap phone for the kids to play their favorite games on, if you're on a tight budget, and having a mediocre rear camera is of no bother to you, then BLU's R1 HD is a definite contender.","rating":4},{"id":"R26CRSA1W6B8ML","title":"You get what you pay for...","text":"Terrible phone. It lasted almost a year with no problems, I loved it. Now it decides no stop working, the phone constantly reboots for a short while, showing a glichy startup screen. Upon a force shut-off, the phone no longer responds to the power button, never to turn back on with full charge. This phone has lived its entire life inside of a case, ironically even that doesn't protect it from breakingYou get what you pay for; a cheap and terrible phone","rating":1},{"id":"R216T20KMGD9QD","title":"I have had a lot of lower end smart phones. I didn't like my last Blu from ...","text":"I am a retired person on a limited income so I can't afford an $800.00 I phone or a $600.00 Samsung Galaxy. I have had a lot of lower end smart phones. I didn't like my last Blu from a couple of years ago and I hated the windows phone. Then as I have recently joined amazon prime I discovered the Blu R1 HD and wow. It is by far the nicest looking phone I have ever used. It fits perfectly in my hand and so easy to use. The curved glass is nice and it looks high end.  The Amazon commercials are not a problem at all in fact I have seen several items I want to buy. I am looking forward to amazon underground. Oh and another nice feature is Android 6.0 Marshmallow. I had a friend asked whats the difference with 6.0. One big difference from some earlier Android is transferring apps to your sd card. On  older versions some apps wouldn't work if transferred to the sd card but with 6.0 you can designate the card as internal storage so the card is seen just like the internal memory. In closing I would highly recommend this phone, at this price it is a no-brainer","rating":5},{"id":"R1SE2M6717BNV3","title":"Good reliable phone and you should buy","text":"So I have had this phone now for little over 6 months. I bought the 16gb version and so far, so good. The phone is what it is, it's a budget phone. I wasn't expecting something to blow me away, I just needed something reliable to use. The ads aren't really that bad as some might think it is, I honestly never notice them. The camera is fine, it will get you by normal pics but  don't expect the most amazing camera. Call quality is good and works good under the T-Mobile network. Not slow either, the only fault is the speaker. The speaker is not that loud, so if you want to blat music out loud, make sure to use a speaker.  The phone hasn't crashed on me or any problems. BLU made a really good phone with this and I would recommend it most definitely.","rating":4},{"id":"R1OQT6ICJDGFLJ","title":"Perfect for my son!","text":"Our family does not do cell contracts or buy phones from cell providers. This unlocked BLU R1 HD has been a great phone for my 13 year old son.  With the 2GB of ram and 16GB storage he can pay all the games and do all the apps with his friends who have $400-$500 Samsung phones.  I would probably switch to this BLU model or similar BLU model if my Nexus 5x ever dies.","rating":5},{"id":"R8A4K9914IBSS","title":"The phone has been much better than I expected for such a cheap phone","text":"The phone has been much better than I expected for such a cheap phone.  I'm really pleasantly surprised.  I use my phone for calls, e-mail, web browsing, and texts.  I don't use it for any gaming so I'm not sure about that.  I've streamed Amazon music and video and the quality is much better than I expected.I was skeptical of such a cheap phone but so far I was definitely wrong.","rating":5},{"id":"R9T13ZLVVS3AZ","title":"Great for international travel","text":"I took this on a trip to Italy. When I got there I easily purchased an Italian SIM card for cheap.The phone works really well. I used it for google maps and it was nice to have a local phone number. Great operating system and I didn't encounter any bugs/glitches using the smartphone apps and features we all love.","rating":5},{"id":"R137T102B0TDK8","title":"Great Phone & Good Value","text":"Needed a phone to use for travel abroad & did not want to incur the cost of any of the high end Apple or Samsung phones. It was a great choice as it functioned flawlessly with an international SIM card. Screen is somewhat small by current preferences but more than adequate & comfortable to use.","rating":4},{"id":"R1NEP2RA705RB7","title":"Excellent Value","text":"I bought this phone as an interim fix while my much more expensive phone was being fixed.  The bad thing is that I had to get a replacement of this phone.  The system update function did not work - it turned the phone into a brick.  So I have not run the update on the replacement phone. All in all I would say it is an excellent phone - especially for the price.  Quick responsiveness, good cell phone reception.  Adding a 64GB SD card takes care of storage space.  This phone is great for the average user.  Surprised it is so cheap for what it provides.","rating":4},{"id":"R2OTLQ4ZFLP88W","title":"Worked 2 months junk","text":"Nice phone and you cant beat the price. Ads don't bug me and since I am an Amazon Prime member anyway there all based on what I been looking at anyway. I use this phone with Pure Talk and I have no issues. Its fast and has good amount of storage. Issues have surfaced and Amazon will send you to manufacturer. They do not stand behind this.","rating":1},{"id":"R39R4JLHDR3FPN","title":"Great phone! Too bad Amazon stopped selling these!","text":"Too bad Amazon stopped selling these!  My kids lose or break phones with unsurprising regularity so I bought these as replacements and made them earn the money raking leaves and mowing lawns in the neighborhood.  They work great!  One child recently broke his and I went to replace it yesterday only to find Amazon was out of stock and wouldn't be stocking them any more.  Whats not to like? LTE, 16GB space and a very decent screen.  Snappy performance too.","rating":5},{"id":"R1ZIA2XFSRY27W","title":"Outstanding phone at an outstanding pricepoint","text":"Purchased this phone after I broke the screen on mine and we did a sim card shuffle with the rest of the phones in the house.  So far, very, very pleased with all aspects of this phone.The price point can't be beat.  We opted for the Prime Exclusive offer which very nearly halved the already more than reasonable price because it would come with the Amazon apps installed and would show ads.  It's worth noting that the ads only show up on the lock screen and you can swipe them away in an instant (though, lets face it, the ads will probably just wind up being enticing).  As far as the apps go, you can disable them, so if you don't really want them, not a very big deal.The phone itself is very light, but it doesn't feel like it's poorly made or like it will break under the barest of pressure. The size and weight are very comfortable in my hand.  The battery cover has a matte feel (if that sort of thing matters to you) and is very light.  In fact, as far as I can tell this is probably the lightest and least weighty part of the phone.  I imagine that the only reason you'd need to have the cover off is to add or remove a sim card (this has dual sim card slots) so I can't see a whole lot of worry that it would break.Screen is sturdy and strong feeling.  Power and volume buttons are on the right side of the phone and are easily depressed and spring back into place, no stickiness.The touch screen responds very well, swiping, scrolling, selecting an app and moving from one thing to the next is pretty seamless.  The resolution on the screen is great and everything shows up clean and clear.Along with the dual sim card capacity I mentioned, the phone comes with 16 GB of storage and has a memory card slot to expand your storage if need be (music anyone?).  The memory card can be formatted in one of two ways, first, would be a your standard memory for various media, such as photos and files, etc (you can then swap this media card out with others), and the other way would be formatting it to be treated as internal memory(once you've done this you can't swap it out with another phone, your memory card would be good only in this phone).A nice little feature (both generally and as a battery saver) that comes with the phone is the ability to schedule power on and off times.  You can set times for the phone to automatically shut itself down and eventually to power itself back on.  Great if you want to conserve battery power over night and still be able to have your phone turn back on to use the alarm for waking up.SInce the phone is unlocked it's perfect for BYOP type services but is also compatible with most service providers out there, all you need to do is pop in your sim card.The camera is the one drawback, as it is not quite as high quality as the rest of this phone, but make no mistake, it takes a good picture.  Just not as good as you're used to if this is a downgrade for you.  Overall though, I don't find that this changes the way I feel about the phone because I'm still capable of taking a really decent picture with it.","rating":5},{"id":"R2UBGR5FCZ7Y2Y","title":"So far, way beyond expectations","text":"Only two days into using it, but very impressed so far. I bought it as a backup to my year-old top of the line phone... which just died. Its reception is comparable. It is just as snappy in web browsing and general performance, maybe better, little or no lag in anything. Battery life is much better. Screen is clear and bright (though smaller). I won't compare the cameras, since I just use it for snapshots, but it works fine.","rating":5},{"id":"R2FYJHZ8CMZ648","title":"Freaking stellar bang for the buck!","text":"This is a great budget phone made even better with the Amazon Prime exclusive price point. $50 for a phone with specs along the lines of flagships from the past few years is just insane. I cherished and babied my LG G3 all that I could, but that couldn't stop it from getting its screen cracked, suffering from bad battery life and up-and-dying on me a month ago. But there is where the BLU R1 HD came in. Sure, it isn't the top of the line most HD, ram-filled, octuple-cored-badass-phone on the market, but it doesn't have to be. That QHD screen on my LG? I barely made use of it; never streamed content in anything higher than 720p just because my internet isn't fast enough and I don't have a data plan hearty enough to do such a thing. The 32GB of storage? Never filled it; I have a micro SD for that. 3GB of RAM\" Doubt my casual use every pushed that to it's limit.Point of the matter is that all these nice, fancy phones on the market are expensive and overrated. I didn't NEED a QHD screen, 3GB of RAM and 32GB of storage, but I got it because I heard nice things about the phone. Sure, I liked it, but the phone bit the bullet way to quickly. Hell, it bit the dust before it was even finished being paid off!The BLU R1 HD doesn't have all the bells and whistles we've become accustomed to, and that is exactly what I like about it. For $50, I got a phone. A GOOD phone. It has stellar battery life, expandable storage, two SIM card slots, Android 6.0, both front and rear facing cameras and is unlocked out of the box. That's enough for me, and way more than I expected for just one Ulysses S. Grant!Out of the box, the Amazon ads are on the lockscreen, sure. In a way it's a bit creepy. It's definitely a bit annoying. But the smart cookies (myself included) can figure out ways around the ads if they so desire. Most people will likely be fine with them, especially considering the trade off being that you get an entire damned phone out of the deal.The main highlight of the device though - for me at least - has got to be the battery life. Because the phone has a 720p display (which is all you honestly need, come on now), the battery isn't constantly being consumed because it has to power a big, QHD/4K AMOLED-whatever screen. The average charge lasts me well throughout the day, despite having WiFi, Bluetooth and 4G enabled, the screen set to medium brightness, and vibrations all kept at standard settings. The screen on time is surprising, for such a cheap device, and I find that it NEVER gets hot in my hand. It's fantastic, and a wonderful change compared to my old phone that damned near burnt me, killed itself and exploded it's own battery after just 30 minutes of light use.The one and only thing about the BLU R1 HD that I don't like is the really stupid, small and insignificant stuff like the notification LED only being capable of displaying 3 colors (red, green and red-green) and the back camera not being super good (coming from the LG G3, which had probably one of the nicest cameras I've ever used). But in every other field, this phone is absolutely wonderful.Whether or not you need a replacement phone, want a new device, or are just a prime subscriber with 50 bucks and some free time to blow, get this phone!","rating":5},{"id":"R1II319FMD6PPT","title":"Update!  A Solution for low speaker volume.","text":"Fine phone. BLU update is available in the \"About Device/Wireless Update menu. Also, MiraVision settings in display menu can increase contrast and enhance screen color. TRY \"SPEAKER BOOST\" app at the play store. Unlike other so-called volume boosters, this one actually works! I use a 10% setting and the volume is dramatically increased.","rating":4},{"id":"R35TDXIMB2BDD1","title":"This is a good phone, for 60 bucks you really aren't going to find a better deal.","text":"I'll start by breaking this review down to what this phone is and what it isn't as opposed to pros and cons as those tend to vary person to person based on intended to use.First, what this phone is.Lets get this out of the way, this a phone that advertises to you. It will do it 24-7 that is part of the deal to get a 60 dollar phone. A good 60 dollar phone at that. At first I thought i couldn't handle the adverts, but, that has passed. I installed my favorite weather app that has a always on notification on the lock screen and I have yet to see a full size lock screen add since.. The adverts are small and pretty unobtrusive once you have a notification on the lock screen. Mostly the ads are for books, games, and movies. No adds are inappropriate and they keep showing the same ones repeatedly and after awhile they are very easy to ignore. Overall for me, it was good trade.Its a budget phone. One that has the look and feel of a much more expensive phone. The fit and finish is really very good for a phone of almost any level. The aluminum side accents with the beveled glass really create a nice aesthetic to it usually reserved for higher end phones.Its great for watching streaming video, listening to streaming music, or listening to music downloaded to the phone. The sound quality that comes out of the phone over bluetooth is good, however, the sound quality that comes over a wired head set is a little flat and a  tinny even with the audio enhancements enabled.The screen is quite impressive for this price point. Its sharp and the colors are nicely saturated without being overly so. One critique I can offer is that it doesn't dim enough (for my tastes) in low light situations. The touch accuracy on the screen is a little unforgiving at first and requires some getting used to in order to be able to get the icon or menu you clicked on to open properly. This seems to be especially noticeable near the edge of the screen. Overall though, the screen is quite impressive and I would put on one level below many of the flagship phones I have had the pleasure of using.Open up a web browser and the phone's performance is more than acceptable. Pages load quickly, movies play with relative ease, pics are fast to load and easy to view and the overall experience is pleasant. However, again the touch screen issues do come into play here and can lead to some mis-taps which may be a little frustrating at times.Phone calls are clear, the voices easily heard over both bluetooth and the phones speaker. I was heard easily and clearly on the other end of the line and the experience was exactly what I expected from a phone.What this phone isn'tIt is not a camera phone. It does have a camera and it captures snapshots of important moments that will look nice on a small screen and to share with friends through text and even on face book in a reduced size. Zoom in, or view them on a large screen, the lack of a high end camera becomes apparent. The photos are soft, and have low saturation with a high level of noise. For most everyday purposes, the camera will get the job done. For those who want this to be the replacement for a good point and shoot or a DSLR or MILS camera, you will be disappointed. For everyone else, this camera will most likely be just fine.This is a phone for gaming on or performing processor heavy tasks on. The processor bogs down loading content intensive pages at times (not to the point that its unbearable but it is noticeable) so trying to play a graphics laden game of performing other tasks that require alot of processing power would probably not go well with this phone.This is not a flagship phone. There is no finger print scanner to unlock it, no extra sensors for fitness tracking, and really not any other frills. Its basic and it gets the job done.Overall, this is a good phone. It works. It makes calls, it plays music and videos, and does that well all while looking and feeling much better than a 60 dollar phone has any right too.","rating":4},{"id":"R3BJGDDFG8GNT8","title":"Great Bargain Phone for Teenager--Big, Fast, Great for Social Networking and Games","text":"Great Phone!! I bought this for my daughter after hearing for the 30th time that my old iPhone 5 I had her on with T-Mobile was too small. I'm not about to buy a 15 year old a new iPhone for $700 so I shopped around for unlocked Android alternatives. Happened on a review of this phone on YouTube. We've had it now for almost a week and she loves it. It's big, does everything she needs it do do: play games, take pictures, social networking. We transferred all of her music from her iTunes account to Google Play with Music Manager (recommend doing it from a PC). I also changed the UI to Zen UI from the Play store. It makes a prettier setup and really works well with the phone. Tweaked a few settings to make the apps open/shut smoother. All-in-all, I can't say much negative. The only reason extra star missing is that after charging it to 100% at about 11 pm and taking it off the charger for the night (leaving it hooked into WiFi and not on cell data and shutting off all app windows) the charge goes from 100% to 88% by 8 am. I'm not really sure what's sucking the charge but it's been awhile since I had an Android so I guess it just has to be tweaked to reduce that charge drain. Thus, I deducted one star for that. I will update if any good or bad comes up but overall, $60 for a newer, bigger phone to make the kid happy is quite a bargain.","rating":4},{"id":"RHOJ197JFV1Z1","title":"How to Improve Camera Quality","text":"I've only had this phone for 3 days, but so far I'm thoroughly impressed. After reading some of the other reviews, i wanted to write this one to let others know about how to improve the Camera Quality.Right out of the box, there is a near invisible peace of protective plastic on the Camera. I didn't see it at all the first day I had it. Obviously, once it was removed, the quality of the pictures improved vastly.Also, the camera settings are set to use a lower set of pixels by default. The rear camera settings is set to use 6M, but can be changed to 8M. This is the also the case for the Video Recording and Front Facing Camera. The Video Recording is set to 480p, but can be raised to 720p or a full 1080p.I'll update this review once I've had more time with the phone, but I just wanted to let everyone else know about the camera.","rating":5},{"id":"R2NL0NSE0LVX7M","title":"this is definitely a great deal. I went with the 16GB model for ...","text":"For the price, this is definitely a great deal. I went with the 16GB model for the 2GB of RAM, because you can never go wrong with more RAM.Setup was a breeze, and everything is running smoothly. As others have said, the camera is \"OK\" – which is fine by me, as I don't take a lot of photos and the ones that I take are mostly to say, \"Hey! Look what I just saw!\" or along those lines.Taking the back off to insert the SIM card was a little unnerving at first. I was afraid to break a plastic connector. Once it came off though I noticed that they were like small teeth that wouldn't break off as easily as some of the clips on other phones. Usually those types have far fewer clips, thus the larger size, which lends more easily to snapping.The advertisements are unobtrusive and, in my opinion, well worth it for the deep discount on the already discounted device.","rating":5},{"id":"R198564XHZ3147","title":"A great phone if you're looking for a backup device or ...","text":"UPDATE: In light of the spyware on this device, return this thing immediately. Don't take the update, the damage has already been done. Issue a return request.---A great phone if you're looking for a backup device or are not a heavy user. Has a glass screen, great specs, and it only costs $60 for the higher specced model if you have Prime. Also for those wondering, you don't actually need Prime (or an Amazon account) to use the phone. You can have a friend buy it for you, no problem.However, this phone makes two major compromises which are really annoying: camera and gyroscope. The back camera has a very noticeable shutter lag, and photos almost always come out blurry unless you have incredibly stable hands. The phone also doesn't have a gyroscope, which means no panorama pictures, and no games that involve tilting your phone.If you can live with these limitations or just need a cheap temporary phone, this one is amazing. Otherwise, I recommend going for a higher-priced phone.","rating":1},{"id":"R301KSZKOC57VR","title":"Good phone ... Awful Customer Service","text":"Love the phone, the functionality, the screen, the battery life. Don't love the speaker output (a little underpowered).But I had to deal with the company to replace my screen and that has been one of the most horrible experiences ever. For that reason alone I would urge anyone to stay away from it. If you ever have to deal with BLU directly, then you are SOL.","rating":1},{"id":"R14DISGAHJ7YDC","title":"Great Budget Phone","text":"I bought this phone actually just for a stop gap while waiting for another phone to be returned from service. But I must admit it is much more than I thought it would be and actually has some unique features that I had to download an app on other phones to use. It comes loaded with Android 6.0 and has the speed to run it very smoothly. The screen is plenty bright and colors appear to plenty vivid to me. The battery life has been quite good and seems to last as long or longer than Iphones, LGs and HTC phones in the house. The ads really aren't that intrusive or bothersome either and about the same as those that are many apps and don't affect the functionality.  I will start looking at other Blu products going forward since AT&T no longer subsidizes phones and I haven't seen anything that is worth $400-$500 more than this one.","rating":5},{"id":"R27RU0JV1QAW4M","title":"Great Basic Smart Phone, would recommend!","text":"I wanted a phone that did a simple job.  Let me text, let me talk and let me take pictures.  The BLU R1 HD for Prime members does just that, and with the subsidized price to $59.99 for a 16GB version is worth the advertisements.  They sit nicely on the lock screen, and really they can be ignored.  Sometimes they show relevant items, other times it's tv shows.  But that's not a problem at all since the rest of the phone is great.Roughly the same size as a Samsung Galaxy S5, this phone only has two buttons.  A power button, and a rocker volume button.  The navigation is all built into the phone screen.  I was pretty intrigued by the way the phone handles.  I got this phone to replace my Samsung Galaxy S5, and it does a fairly good job.  The weight is less, and it comes with a SD card slot that takes a 64GB card.  One of the many problems I had with the S5 was the SDcard would corrupt, or not load if over 4GB of video was stored to it.  That doesn't happen with the BLU R1 HD.  The software for the BLU is lacking compared to the S5.  The S5 comes with a plethora of settings, adjustments and so forth.  The BLU is bare bones minimum.  But a lot of the features in the S5 were not ever used by me.  So losing them didn't matter.  Using the S5 required a lot of charging time.  I would find even if the phone sat idle on my table from a full charge, it would drain to 28-38% left by 4pm.  So it was common for me to charge the S5 on and off each day.  But the BLU, being stripped down of many background processes and routines, has a far superior battery life.  I can leave the phone 12 hours on idle, and still have a 75% charge left.  This truly awesome to me.Other features the BLU does that outshines other phones, is a sleep mode.  You can set schedules on the BLU to turn itself off at a perticular time, and then it will turn itself back on at another.  I like to set mine to turn off at 11pm, and then to wake at 6am.  Then at 7am my alarm goes off on the phone to wake me.  By having the phone shut off for 7 hours a night, it practically extends the battery life.  I have used a 100% charge for 2 days without additional charging, having used maybe 2 hours of talk time, and 20 minutes of watching youtube on it.  It finally reached a 3% charge at close to 47 hours from start to stop.  So, I've been impressed with what this phone can do.For me, this is a great phone at a bargain price.  It isn't water proof, or shatter proof, or got a lot of bells and whistles like NFC or accelerators.But what it will do is help you lower your bill.  You can take this phone and get a t-mobile family plan at walmart.  If you mostly just use 1GB or less of data a month, you can get a $30 plan.  It's  unlimited calling, texting, and 1GB LTE4G data.  This is why this phone is great.  I took my $90/month sprint bill with a $600 phone, and lowered it to $30 and a $60 phone.  Significant savings.  Just make sure you use your work wifi and home wifi all the time and you will never have to worry about data.The reason I gave this phone only a 4 out of 5 stars is because it still needs some work.  The phone has a problem with understanding my Beyond app which plays podcasts.  If my bluetooth headset is sync'd, and I start to play a podcast through the app, it works fine - but if I get a text alert or open another app that might start playing music - the entire phone starts to freeze up.  I have to reboot the phone completely to fix it.The other issue I have with the phone is that the battery cannot be removed.  It can be if you have the right tools and expertise to do it, but if the phone freezes and you cannot turn it off to reboot, it would be great to take the battery out to full reset.  Since you can't, I can see it being an issue later.  BUT, it is a $60 phone if you get the advertisements.  Sooooo, that's still a good deal.The final problem I notice is that on the Lock Screen, it will marquee scroll in the notifications area that I do not have service for my Family Plan from t-mobile - which is clearly a glitch because I do have coverage, full bars with LTE4G.  It does that all the time.","rating":4},{"id":"R3ELB02OBAWNGI","title":"Adequate","text":"I've been using this as a replacement phone on the ATT network for 2 months now. The phone was easy enough to turn on and get going. It functions fine with all of my general apps like Gmail, Textra, Twitter, Instagram, and WordPress, as well as Fire Emblem Heroes, which is probably the most stressful app I have for the phone, it doesn't seem to have a problem running it at all. (I'm not a very phone-intensive user as far as apps go.) I keep it in a case (I have butterfingers when it comes to phones), but it feels nice enough when not inside the case.It seems to be surviving the drops onto our tile floor just fine (Once again--in the case!)Recently I've noticed that the phone will NOT stay on silent mode. It doesn't matter if I choose the silent \"audio profile\" or one of the Do Not Disturb settings (I've tried the timed ones and the ongoing ones with no difference). The phone was not always this way, but I'm not real sure what I can do about it. It seems that once I receive a call, it knocks the silent mode off for the following calls/notifications. Compared to what I was dealing with as far as my old phone, I'd take non-silent over non-functioning any day.Also, having switched from a Samsung phone (Galaxy Alpha), I feel like the contacts and phone functions are very basic, and I think backwards from what I was used to (I'm still accidentally dismissing calls instead of answering them).The camera is okay, it suffices for my needs.I also found that the phone seemed to be keeping ALL the data from anything I'd ever done, and had to manually create storage by clearing app data within one month of use.The ads aren't too intrusive, not too different from what's on my kindle paperwhite.Overall, I find the phone is adequate for what I need.","rating":3},{"id":"R2NTINKAFON7T","title":"Where is the the band 12 / voLTE update they promised \"shortly after launch\"?","text":"The reason I bought this phone is that Blu promised to support band 12.  This band allows the phone to have a stronger signal when indoors: \"Extended range LTE\" is what T-Mobile calls it.  Well, the phone has been out for months now and they still have not delivered what they promised  Right on their web page as in the image below, it says:  4G LTE band 12(700 MHz) will be available via OTA (Over-the-air) update shortly after launch.Blu - where is this important update?  You can't promise it and then not deliver.  It is the only reason that I bought this phone model.  I saved a copy of the webpage where you said you were going to do it here: [...]I will increase my rating on this phone to 5 stars if they will release this overdue update.","rating":1},{"id":"R10FPCUZHD0FBC","title":"Dangerous!  Phone battery caught fire!","text":"Phone battery caught fire!!!  Dark black smoke followed by flames almost a foot high. Phone was used less than 30 days. My 10 yr old had to be taken to Emergency Room for blistering and scorched skin.","rating":1},{"id":"R3TKWBEP1LBY9T","title":"Screen cracked, upset that I couldn't replace it, but it was a great phone.","text":"So I used the phone for 3 weeks.  Absolutely loved it.  Then I dropped it for the first time when my arm was hit by a car door.  It shattered the glass on the screen.  Powers up everything is fine, but the touch screen is a no go.  So yes I acknowledge this is my fault, I dropped it.  So I was willing to buy a replacement, since I had to do phone interviews on Tuesday (this was Sunday).  I tried to order and found they had a limit on the phones per account, I was guessing so people couldn't bulk order them.  So I contacted amazon via chat (since this phone was my only phone), after talking with the employee for about 30 minutes it was revealed there was nothing I could do.  I cannot exchange the phone, send it in to repair (wasn't even asking for that) NOR could I buy a replacement.  I'd have to either buy a different phone or \"open a new account\" I then pointed out I'd have to get prime on that new account, because the phone is exclusive for prime members, which means it would be cheaper to just get a different phone...  The only other option was to contact someone didn't already have the phone and who had an amazon prime account to order me replacement.  Problem is most of my friends already bought the phone the same time I did...  So yeah... Kind of screwed.So anyway, this is a highly personal experience, I put it up here so people are aware if you break this phone, there is absolutely nothing you can do to replace it outside of getting a completely different phone.  So hang onto it for dear life.The phone itself is good, the ads are generally un-intrusive and it's speedy, plays any app that doesn't require a gyroscope, so yeah Pokemon Go works, but not with AR camera mode on.  There is literally nothing bad I can say about it, other than it's a touch heavy so if you drop it from any kind of distance your screen might shatter like mine did...  I'd suggest getting a screen protector and case just to make sure you don't suffer my fate.For comparison I have used the following list of phones and this has been the best so far at least as far as first impressions go: Fierce One Touch, Kyocera Icon, Asus Zenfone and a Nexus 4.","rating":5},{"id":"R34RIRV68U55TX","title":"Beyond My Expectation!","text":"If you are not a power user or a gamer, then this phone might be perfect for you. Many use their phones not as phones any more, but portable entertainment device + communication device. But for some, they primarily want simple communication device that can also occasionally entertain them (web surfing, YouTube, etc). If you are looking for something cheap but does the job efficiently, then you want to seriously consider BLU R1 HD (2GB RAM + 16GB storage). For my needs (I am not a gamer or take a lot of pictures, I just need email, text, call, social media, web surfing, and YouTube, etc), and I was looking for something between $100.00 - $150.00. My choices were: Moto G4 Play (either with Amazon Ad or without), Moto G4 (with Amazon Ad), BLU Life One X2 (2GB + 16GB variant), then I saw Amazon selling BLU R1 HD for $59.99 (with Amazon Ad), I jumped on it. After reading about the product and its spec, $60 was a bargain. Amazon Ad on the lock screen does not bother me one bit. There are many reviews already (both good and bad - you can judge them for yourself), and I just want to add few more info and tips that might help you.UPDATE (12/21): If you wait a little, BLU will come out with R1 Plus (a slightly upgraded version of R1 HD). The rumor is, this item will be also available for Amazon Prime variant. You can google BLU R1 Plus for more info on the item.PROS (considering the price):1. BUILD. The phone is nicely built. No loose parts, feels solid all around. I was a bit surprised by this. Certainly not premium build (like Zenfone 3 Deluxe that costs $499.00), but certainly better than expected. Aluminum frame with curved Gorilla glass 3 is a nice touch - feels good to hold in hand. Polycarbonate removable back cover is also solid to touch.2. POWERFUL. The spec is not high end, but for the price, the spec is better than expected. Media Tek 6735 chip performs better than Snap Dragon 410 (Moto G4 Play - which costs more). Some say it is with par with SD 410, but it is not. It is snappier and handles the RAM better. With 2GB RAM, I had 15 apps (no games) opened, and it still had 500 MB RAM left. Almost everything was done under 1.5 GB RAM. This was really surprising, multitasking between several apps was great experience. But occasionally my sports app (CBS Sports) would crash, but interestingly ESPN app did not. I tested with another smartphone that was equipped with Snap Dragon 652 with 3GB RAM and R1 HD opens the app .5 second later than mid-range smartphone. That's just incredible. For a budget phone, the performance was very good.3. SCREEN SIZE. 5\" screen is perfect for me. I have 5.5\" screen, it is a tad big for my small hand, but 5\" screen is comfortable to hold and able to maneuver better with one hand. Of course, this is subjective to each user, but for those who have small hands this is a welcome form factor.4. DISPLAY. Wow, this thing is bright. Even though it has 294 ppi (just like Moto G4 Play), because of its 420 nit (nit refers to unit of brightness. Certainly much brighter than Moto G4 Play) you can easily see the screen outside. Even inside, i am using screen brightness to almost 15%.CONS (considering the price):1. SPEAKER. It is located on the back instead of the bottom of the phone. While it is livable, the sound is weak and low, but not distorted. If you want to watch a YouTube clip and want to hear it, you need to raise the volume almost to the max.2. NO ACCESSORIES. BLU usually ships their phones with: ear buds, screen protector and slim TPU case. But R1 HD only comes with a charger. So you need to get your own case and screen protector. There are decent cases and screen protectors in Amazon, so you can browse them for your need. For decent protection: i got a case that has four bumpers on the corners to protect further from the drop. Also for screen protection, I got QIBOX QIBOX BLU-01 HD Screen Protector Anti-shock (Fits better and More Durable than Tempered Glass) Nanoshield HD Clear Shatterproof Protector for HD Phone Anti-bubble3. NO MARSHMALLOW 6.0.1. This comes with 6.0 and not 6.0.1. The BLU does not guarantee it will update it to 6.0.1. Still it is better than many other Android phones that come with Lollipop.TIPS (for maximizing phone performance):1. BE PATIENT and UPDATE Everything. When everything (system) is updated, the build version will be V.7.4.2 (check setting -> About Device -> custom build version). Security patch level (October 5, 2016). it may take 2 days to get the all the update. So be patient.2. UPDATE all the apps. I love the fact that R1 HD is almost stock Android with Amazon apps (that can be removed, but cannot be uninstalled). When all the apps are updated, you will see its performance as it was expected.3. If you need more storage, please get Class 10 micro SD, anything slower than that will slow down your apps. Consider Samsung Evo Micro SD Samsung 16GB EVO MicroSDXC Memory Card with Adapter MB-MP16DA/AM. Anything less than Class 10, you will see lag and stuttering in your apps.4. If your battery drains real fast after overnight recharging (this is a software issue FYI), you can power it OFF (not reboot) and turn it ON again, then the battery will normally discharge. Apparently for some, this issue exists not just for this phone but many other Android phones.5. If you cannot access your phone from Windows 10 PC, then you must enable USB MTP mode.  To enable: Go to \"device manager\" -> Select Exclamation marked device -> \"Update Driver Software\" -> \"Browse from My Computer\" -> \"Let Me Pick From a List of Devices\" -> then select \"Show me All devices\"  -> Select \"MTP device (USB) -> It should work after that.All in all, this is a quality budget phone or a backup phone. But for many, who do not play games and take picture often, this will be more than enough. I really love this phone even with the ad. Highly, highly recommended!","rating":5},{"id":"RQ8TTYLU8MSGU","title":"Apple-ish Android?  Appdroid?","text":"I cannot believe this phone is being sold at this price.  It genuinely represents the best value in cell I have ever seen.  Period.  The display is not as sharp as some and Hasselblad has nothing to fear from the camera.  But it is reasonably snappy, light but solid, the build quality is amazing regardless of price, and functions like a phone should.  I mean, my 6P doesn't have a front-facing flash like this does!The one inexcusable choice Amazon made is to neuter Google apps.  For instance, even though I pay for Google Play music and can log in with my account I cannot import any of my existing playlists nor download music to the device for offline listening.  Come on, Amazon!  I know you want to push people to your own services but even APPLE lets you natively do these things on iPods/iPads/iPhones. If your goal is revenue generation via a partially-walled garden you're just going to end up driving people to root the phones and install another OS.I bought this to function as an Android-sourced iPod alternative so I could install my workout apps and download music to listen to while jogging.  The inability to accomplish that second step (without paying for data while streaming music) is just about a deal breaker.  The irony being I also subscribe to Prime and have used Amazon's music service since it was introduced and would have continued to use those apps without the Google Play restriction.  All you've done is made me SUPER annoyed.Update: I found the handset would not display the correct time (always two hours behind) even though the time settings were for network time and location. Ordered a replacement and did a factory reset (time still showed wrong after reset). Messing around with it tonight, manually set time and zone then switched back to network driven and now it seems to be correct. Also now shows me the option to download music from my Play playlists. Must have been a beck of a glitch in the OS.Update 10-17:  This thing has some quirks.  I am still only using this as a music player and exercise tracker.  The battery life is not very good.  The phone will fully discharge after being turned off in about 4 days.  What is more weird is having turned off mobile data (still with no SIM installed), turned off wifi, turned on airplane mode, and then shut the phone off, I will still receive new email notification via the flashing light.  HOW CAN THAT BE???  I have tried this multiple times with the same result every time.  There should be no reason the phone is scanning wifi while off, much less in airplane mode with wifi disabled.  Even if I leave the phone on in airplane mode with wifi off I will still get email notifications.  Very disappointing.","rating":4},{"id":"R3O7HA2DIRSVH7","title":"BLU R1 HD 16 GB Phone","text":"I have used cell phones since I first bought the Motorola Bag Phone in the late 80s. I love this phone. The Android system is great! This phone is set up for the Amazon Prime benefits which are great! This phone fits in my pocket easily and is so slim. The phone allows you to use Google Play to download Google items in addition to the Amazon Prime benefits. I added a 16 GB SD micro drive for extra space. I paid the extra $10 for the 16 GB phone and it is well worth it. I have easily used 10.47 GB of the internal memory and 3.56 GB of the 16 GB. Many of the apps can be moved to the external storage (the micro card drive). I use WiFi extensively.The screen is a bit over 5\". The choices you have between Google and Amazon apps is outrageously large.I first saw the name \"BLU\" in a recent major film. Everyone was using them. I never heard of BLU, so I checked it out. The brand is well known in the rest of the world. They have a US base. It is a great phone!!!I am amazed at what you get for the money. Very clear screen, quad core ram, very sensitive screen, Gorilla glass, etc. I have read that some people object to the ads. Hey, they're nothing. One tap on the screen and it is gone. They're not videos.I use AT&T and receive unlimited talk and text, plus 100 MB of data for $30. I do not use the data except to occasionally use the Maps programs (driving directions). I use an average of 18 to 20 MB of Data a month.Thank you Amazon for making this phone available to us.","rating":5},{"id":"R1TFQH6G7U6P2P","title":"Great as a Budget Smartphone, but...","text":"Well, I'll start by siting the things that I really like about this phone.PROS:Visual appeal of a high-end smartphoneFast loading and swipingEasy to close down multiple appsLots of room for storageFast data speedsComes stock with Google Chrome (and Google everything else)Fast access to Amazon Prime shoppingFast download speeds for appsEase of useSemi-fast charging (do not use any other charger than the one provided to you with the handset. Using any other charger could cause a fire).Easy to transfer SIM data from old phone to this phone via a TRACFONE Sim Kit.CONS:WIRELESS UPDATER TROJAN COMES PRELOADED ON THIS HANDSET! Say what?! Yes...it's true. This is the only reason I'm giving this phone 3 stars. This Trojan is potentially life altering, and not in a warm, friendly, fuzzy, happy, fun way either. What's worse, is I can't remove it from the phone. I've already looked into the research behind this issue, and it has happened to many BLU handset users over the past 2 years. Unfortunately, based upon this research the customer service runaround is intensive, involves 2 to 3 different entities (people you have to talk to to get the issue fixed), and typically ends in your sending the phone back for a refund. You may be wondering how I know it's a trojan, and the answer is simple. I purchased Webroot Antivirus for my computers, desktops, and mobile devices. While scanning the phone for the first time, my PAID subscription of Webroot found this Trojan, and no matter how many times I attempted to quarantine it, it could not be quarantined, deleted, or uninstalled. From what I've read on the matter, it is part of the Google Mobile Updater system, which creates a force updater situation.This trojan is of concern to me, but I've only just begun to use the new BLU handset today after spending an hour and a half switching my carrier service from my old cellphone to this BLU smartphone.I will certainly post updates should they be warranted. For now, just know that this may be an issue for you should you choose to buy this phone. Now, it's important to note that I purchased the Prime Member Special Offer for this phone, which saved me about $50 on the price. Does this trojan come on the \"no amazon ad\" version of this phone? I can't answer that, as I don't know.Aside from this wireless updater trojan issue, I'm relatively happy with my new smartphone! Only time will tell if I remain happy or not.","rating":3},{"id":"R2IHRLGU85AOK9","title":"Good phone, not a great speaker, Sandisk 64GB sd works, How to set FreedomPop","text":"This budget Phone is working well. The speaker on the back is not very good, but the screen and everything else is nice. I put in a 64gb micro SD card and it works fine. I put in a ATT and T-Mobile sim at the same time and those work too. I still have more testing to do. See my pics that show the 64gb card works. The Amazon ads aren't too bad, but it made the phone cheaper and that's what counts.Update 07/28/16: I am now using a freedompop gsm sim which took a bit of settings and switching sim slots to get it working properly. I tried a Samsung 64GB EVO Select micro sd and it doesn't really work, took several minutes to format and showed a message that my sd card was \"slow\". The 64GB Sandisk card works fine with no errors. Hopefully firmware can make the Samsung cards more compatible.Info on FreedomPop: I was new to FreedomPop but it does work on BLU R1 HD.First you need the GSM sim version. Freedom pop is a voip service so it runs through their app. You have to download the app to use the service. Put in sim. Then go to cellular setting and add new APN. Set as follows:Name: FREEDOMPOP [This is optional, you can really put anything here]APN: freedompop.foggmobile.comAPN Type: default and dunMCC: 234MNC: 20IP Protocol: IPv4APN roaming protocol: IPv4Bearer: UnspecifiedMVNO type: noneSet roaming to on or it will not work. I started with the sim in slot one, but had problems with calls, then with GSM data. I then put it in slot 2 and it is working fine.","rating":4},{"id":"RDF3UVO1JUG9","title":"Great phone value, superb features at this pricepoint - UPDATE again","text":"I switched to this phone from a Moto X because I wanted to use a cheaper phone service. This phone is significantly slimmer. As already noted by some reviewers, this phone does not have NFC. The glass pour on the screen leaves a \"rounded\" look (other than perfectly flush or flat into the bevel), which is something different than I have seen on other phones, this might bother some; however this does not bother me. The other missing feature is USB host mode which seems to be missing in the firmware. Also the first day I got it, I tried to load the Starbucks app and it would continuously crash. However there was a wireless update and it appears to no longer crash. Another strange thing that keeps happening, my Dolphin browser keeps getting removed from the device for absolutely no reason. Onto the good: It feels good in the hand, it has sufficient bulk to not feel cheap and plasticy like some Kyocera phones. The physical buttons feel like the Blu HD Win LTE phone, which I particularly like. The charge port on the front requires you to plug the phone in with the cable flipped the other way round. I would have preferred the speaker to be in the front. Overall, for the money this is hands down the best phone per dollar spent anywhere, without argument. I have the amazon ads supported version, and I do not find the ad integration disruptive at all. The amazon app integration would be less useful to those who do not already have Amazon Prime. (Auto unlocking via Smart Lock will not work with this device due to the lock screen showing regardless of your Smart Lock settings.)  I would recommend this phone to anybody looking for a good value smartphone.There is a bug that presently will remove your Dolphin or Firefox browser from your phone upon reboot if installed to external memory. I am confident that a fix is forthcoming.  Also it may be worth noting to some that the daydream feature will also not work on this version of the phone, due to the restrictions placed on the lock screen. Checked on 7/23/16 and it is still removing browser on reboot.UDATE: 8/7  Blu has isolated the issue and it appears to be a common bug for Android M. A work-around would be to sideload the browser. I feel like a fix is imminent and am very satisfied with the level of communication with this company. <3 Blu.7/26: Sorry if my phone screen looks dusty in the video, the screen protector with the blu case is abysmal.Blu HAS contacted me via email. I am very impressed with their customer service so far. They have been very straightforward with me and I feel very confident in their knowledge and abilities.If you order the Blu R1 HD case, I highly recommend throwing the screen-protector away and getting a Zagg or Xtreme one.","rating":4},{"id":"R2WLCUAP1LPMRX","title":"Very usable phone","text":"This is a decent phone. I don't even want to say \"for the price\". I am not bothered much by the Amazon ads. With 2GB RAM it runs most things just fine without any lag. Spend another $10 on a 32GB microSD card and you even have decent storage for your music and photos. There's even room enough to download a few episodes of your favorite shows on Netflix or Amazon Prime Video. The screen is decent.  The battery life is good. If you are not too demanding on your phone and you don't want to spend a lot of money and you are used to ignoring ads on web pages, this is a viable low cost option.Oh, it works well with Tracfone's BYOP program on AT&T service. So if you want a low cost all around option, you don't have to spend a whole lot of money to have a decent phone with decent service.","rating":5},{"id":"RCRI2MJS7QKB4","title":"This phone is amazing. My gripes are the speakers and power drain.","text":"This phone is amazing compared to a Windows 520 phone, but has problems that worry me. One gripe is the speakers.  The volume is lower than I would like at max volume.  The sound quality isn't the greatest. I sometimes compensate by running a cable from the headphone jack to external speakers on my clock radio and that helps.  I have had other budget phones but they were always hampered with not having enough memory.  I have learned that lesson.  I bought a micro card to add to supplement memory, although sometimes the phone seems reluctant to accept the card.  The screen is OK and the processor very fast.  I use the phone just at home on my bedside nightstand and on home WIFI.A major problem for me is the phone drains power even when off, just as if on.  I can have it fully charged and then turned off completely...eight hours later the battery is completely drained.  I have done all I can think of by turning off things except for the home WIFI access.  It still does this.  It is as if the phone can not be really turned off and somehow it is being used when I am not using it.  Every other phone I have ever had does not drain power when it is turned off.","rating":2},{"id":"R3R2ZO19Q726XP","title":"Great phone but has it's quirks","text":"This phone is a great deal at $60! I was previously using the Fire phone but frustrated that apps were so limited.  I really appreciate having the best of Amazon and Google with the BLU R1 HD. The processor is slightly slower and the camera is average but I can live with that. The advertisements are not a bother either. My main complaint and reason for 4 stars is battery life. It does not hold a charge. I will charge it to 100% overnight and within10 minutes of disconnecting it the battery will drop to 90% and I'm not even using it! With average use it needs to be charged at least twice in 24 hours.All in all though this is a great phone for the price and fit my needs well.","rating":4},{"id":"R2TPXEUW6Q8WQK","title":"Great phone, excellent price.","text":"I've had this phone for a couple of weeks and I am so pleased with my purchase. I'm still discovering all the things it can do. It was easy to set up. I have straight talk using at&t network. I did have to buy a new SIM card because my old one from my galaxy wasn't micro. But that was the only frustrating part because I had to wait for my new SIM card so that I could use my phone. So if you order this phone, check your SIM card so that if you have to get a new one, it will arrive the same day as your new awesome phone.I love that I can use this as my own personal wifi hotspot. Now I can use my tablet anywhere. As some others wrote, the sound isn't the best but you can easily fix that with an app.The camera is fine for my purposes, which is capturing things in the moment.And I have taken some really good pictures with it so far.I would say, as others have said, that this is a great phone for the price, but I think that this would be a great phone even at a much higher price.","rating":5},{"id":"R17IPXYWIX9USJ","title":"Best pokemon go huntin entertainment device that rivals ipod touch, and International Travel tested","text":" All the features of a high end smartphone, except for touch id scanner.I really like this phone, not only as an entertainment aiding device (so i dont waste battery on my main phone) it’s the best travel phone, as well as for pokemon hunting.I like that if i were to have it stolen, or lose it - It’s not that much of a loss financially.All amazon prime video, music and photo perks work right off the bat, byfar one of the best screen resolutions as far as amazon products go.Downloadable prime movies are amazing as well.I can transfer main device memory to a fast MicroSD card (something my s7edge can’t do)Expandable memory is a snap, and can carry 2 sim cards! are you kidding me? I wish my iphone could do this.I was able to activate a European/russian sim card, and a rogers card from the UK, as well as my at&t and tmobile cards (tmobile offers free data overseas)It was able to handle my 64gb sd card without any issues.Google play store is open, meaning I can access my main apps I paid for from my s7 edge phone.Camera is better than ok, not the best but really good for general use, beats most amazon device cameras so far.Video options are only 710, 1080, or 480Pictures photos (see video review) they are sharp mode, meaning it adds sharpness to the already good photo.As far as games, I still have any slow down issues, games were smooth and responsibe.even though the bench marks are515 SINCLE CORE1562 MULTI COREIT is abue the same as a Sony Experia Z and Asus NExus 7 tablet, so it still holds up.NOtice all android smartphones slow down when updating or installing apps.I love watching Time Warcner Cable at home, use it as an extra tiny monitor, also like listening to Sirius XM radio.Battery life is just like any smartphone, no difference here (use it too much it drains, leave it alone it keeps up)911 - yup even without any service this phone can be used to make emergency calls so thats an extra bonus for me.ADS:I like them, sometimes I’ll get offers I really like, and it notifies of me great deals.  Im sure they’ll be a root for it to remove in the future,.Pokemon go:Some issues I have is that it cant orient which way Im facing, so I put the catchmode in AR mode, otherwise it’s hard to see the pokemon with the camera.  Gps works fine.Overall its hard to find any faults for a device at this offering with so many features, access to free premium games from amazon underground, access to Google Play store, able to install outside applications, camera is fair to actually good.  Only con would be if you enable security mode, you have to enter a pattern or code, no fingerprint unlock which is fine.Compared to apples Ipod touch offering, this byfar beats it.Can work without sim cards as well, and for amazon underground prime account isn't needed.Very happy with it.","rating":5},{"id":"R1QDWMER4W6BE","title":"... the price(59 dollars with the ads) I cannot be happier. The build quality is really nice and it ...","text":"For the price(59 dollars with the ads) I cannot be happier. The build quality is really nice and it feels like a much more expensive phone than what it is. I bought this phone as I have to send my Nexus 6P back as it has phone call quality issues so I just needed something for the 2-3 weeks of waiting to have it returned. The thing is I am unsure once I get my 6P back if I will keep it or just sell it on craigslist. That is how much I like this phone. Below are my pro's and con's but I really have zero con's for the phone at this price.Pro's-Build quality looks great and does not feel plastic like at all. Additionally, I really enjoy that it is not slippery like my 6P.  I also like how they designed the screen glass in appearance.- The screen quality is really good for the price. Honestly, unless you have a very hi end 4k type of screen you will not be able to notice much of a difference unless you are really looking hard.- Phone performance is snappy. I have not really noticed any lag at all yet I do not play video games or things like that. I just pull up webpages and apps like google maps and this performs basically the same as my 6P.- Amazon Ads- I was really worried about the ads and if it would be obtrusive while trying to use or be a drain on resources. I can tell you it is not. It is so unnoticeable and you literally just swipe it away like any other type of notification on your locked screen.- Phone call quality is great. I have had a couple of test calls and everything tested clear as could be.- I have not had a chance yet to test the bluetooth yet if it is anything but solid I will come back and update.Cons- Camera- I struggle even to list this on a 59 dollar phone yet  if a camera is incredibly important to you then you may not ever be happy with this phone. Now, if you can only afford a 59 dollar phone then it is what it is. But out of everything that is where this phone lacks the most.- Speakers- Honestly, they are not terrible but not loud. Also, I always just use headsets so to me it really holds no value.- Battery- No quick charge battery, yet again its a 59 dollar phone. If you expect a 59 dollar phone to have that you are kind of a moron yet wanted to point it out as that could be a deal breaker for some people(It almost is with me).Overall I love this phone. I owned a Asus Zenphone 2 that I purchased around 15 months ago that I paid 200 dollars for. This phone absolutely destroys it in every way. From look, the build, to the screen brightness and feel. It's a 59 dollar phone folks but you will not be embarrassed to be seen carrying it.","rating":5},{"id":"R7IGMEF8IZHXT","title":"Unstable, Underpowered","text":"I really wanted to like this phone.  It's beautiful.  The screen is great.  The touch response is good.  The size is perfect, and the price.  However, this phone is even more frustrating then my Windows phone.  Constantly rebooting, rings, doesn't ring, very slow at times.  Put anything on the SD card then the settings will no longer give you information about the phones internal storage, just sits there and spins.  Let it sit on this for an hour, no change.  Also, the camera is not very good.  This is saying something when I think my Windows Nokia 640 has a better camera.  I think maybe the processor with the phone is just under powered.  As, a phone (besides the issue with ringing/not ringing) and for simple games, the phone works fine.  Also, don't use the SD card.  Go beyond that, well maybe I expected too much from a budget phone.  Finally, I gave up and am returning it.  Amazon, makes it very easy to return when things don't work out.  Thanks Amazon.","rating":2},{"id":"RH8DDCZMTYCOE","title":"Great phone; unbelievably good price","text":"My previous two phones were an iPhone 4 and Nexus 5X and I love this phone.  After breaking the screen on my previous $450 and $350 phones, I decided to get something cheaper because (a) I don't play any games so I don't need fancy hardware and (b) I'll probably break this one too.This phone surprised me.  It doesn't feel cheap; it actually feels great in my hand and works well.  All my go-to apps work fine, which for me are maps, Audible, Yelp, and assorted other low-power apps.  I can't say how performant it would be for games.  The camera seems decent enough as well.I doesn't have a fingerprint reader, so you'll unlock it with a swipe pattern or passcode, unless you have an Android watch.  It paired with my Motorola watch without issue and a newly released feature allows you to keep the phone unlocked while in proximity to the watch, so I don't miss the sensor at all.I opted for the version with ads and they don't bother me.  There's a panel on the notification page as well as a widget you can put on your last page of apps with your infrequently used stuff.  It's really unobtrusive.  I generally dislike ads but since I felt I was taking a chance on an unknown brand phone, I decided to go real cheap in case it was a dud.  To the contrary, it's a gem -- a good phone for a rock-bottom price.  I'm amazed.The best part is the microSDX slot, so you can expand the storage.  My previous phones didn't have that capability.  Indeed, it was that feature that encouraged me to take a chance on this phone.  Now I have plenty of room for all my apps, a dozen audiobooks, and can take photos and videos with impunity on my vacation without worrying about uploading to the cloud to make room.If you're just looking for a decent functional phone, this is a great choice.  I'll never buy an overpriced phone again.","rating":5},{"id":"R3F8CO0XL7QFYH","title":"decently fast, dual sim and 128gb supporting phone","text":"Very good choice if you need a budget/backup phone. Unlike many other dual sim phones, it has 3 slots, meaning you can place two sim cards AND an expansion card. And yes, 128gb sd card does work! I did not expect high quality pictures from the camera and it's fine. However I wish speaker phone was a little bit louder. That's about the only negative. Feels solid and looks good. the ads are unobtrusive and many amazon apps can be disabled. that won't stop the ads however. for a little bit more you can get the same phone without any lock screen ad.","rating":5},{"id":"R2A6BQ4LMW94WR","title":"Love it!!!!! UPDATE love failed","text":"Love it!! I don't often write reviews but felt this warranted one. I received yesterday and opened box pleasantly surprised at quality and clarity. I was using iPhone 6 but wanted straight talk and couldn't afford the high price of the phone and stumbled upon this deal. Figured for the price worth a try. Works and looks great. The screen size is bigger than the iPhone 6. One reviewer said it was not 5\" and yes it is. IPhone 6 is 4.7 and Blu is definitely bigger. You can't go wrong for 60.00 with this one.Update: sadly I have to return. I really wanted to love it but after a few weeks I just can't deal with the unresponsive keypad. The phone looks great but is extremely painful to text or message. The keypad response is just horrible. Had this been different I would've gladly kept. The battery life btw was awesome. Best I've ever had. What a shame. Blu make a better keypad and this will be a winner. Back to iPhone I go...,","rating":3},{"id":"R2LZIKNQR0GHKF","title":"Amazing phone for the price!","text":"This phone is absolutely incredible for the price point. I consider myself a bit of a power user and have been having very few difficulties while putting this thing though it's paces.  Performance has been comparable to my Nexus 5X (for which this has been a temporary replacement),  which cost 5 times as much!Here are some pros and cons:Pros:- It runs near-stock android, and runs it well- Very smooth system performance. It's been able to run all applications I've thrown at it thus  far.- Attractive and sturdy build. I've dropped it several times and have only gotten a few minor scuffs.- Amazon ads. I thought they would be horrible and intrusive. In fact, I hardly notice them and they don't seem to be taking up much, if any, data.Cons:- I do miss the ability to use fingerprint authentication and Nfc payments, but those features are definitely not expected at this price point- As part of the discounted Amazon version, you get unremovable Amazon apps. While annoying, this is to be expected with the subsidy that Amazon gives you.- The camera is definitely subpar, but I consider that to be a relatively minor tradeoff for the excellent system performance.If you do end up purchasing this phone, I would highly recommend you opt for the 2 GB ram/16 GB rom model. At only $10 more, it's a no-brainer.","rating":5},{"id":"R2FYJHZ8CMZ648","title":"Freaking stellar bang for the buck!","text":"This is a great budget phone made even better with the Amazon Prime exclusive price point. $50 for a phone with specs along the lines of flagships from the past few years is just insane. I cherished and babied my LG G3 all that I could, but that couldn't stop it from getting its screen cracked, suffering from bad battery life and up-and-dying on me a month ago. But there is where the BLU R1 HD came in. Sure, it isn't the top of the line most HD, ram-filled, octuple-cored-badass-phone on the market, but it doesn't have to be. That QHD screen on my LG? I barely made use of it; never streamed content in anything higher than 720p just because my internet isn't fast enough and I don't have a data plan hearty enough to do such a thing. The 32GB of storage? Never filled it; I have a micro SD for that. 3GB of RAM\" Doubt my casual use every pushed that to it's limit.Point of the matter is that all these nice, fancy phones on the market are expensive and overrated. I didn't NEED a QHD screen, 3GB of RAM and 32GB of storage, but I got it because I heard nice things about the phone. Sure, I liked it, but the phone bit the bullet way to quickly. Hell, it bit the dust before it was even finished being paid off!The BLU R1 HD doesn't have all the bells and whistles we've become accustomed to, and that is exactly what I like about it. For $50, I got a phone. A GOOD phone. It has stellar battery life, expandable storage, two SIM card slots, Android 6.0, both front and rear facing cameras and is unlocked out of the box. That's enough for me, and way more than I expected for just one Ulysses S. Grant!Out of the box, the Amazon ads are on the lockscreen, sure. In a way it's a bit creepy. It's definitely a bit annoying. But the smart cookies (myself included) can figure out ways around the ads if they so desire. Most people will likely be fine with them, especially considering the trade off being that you get an entire damned phone out of the deal.The main highlight of the device though - for me at least - has got to be the battery life. Because the phone has a 720p display (which is all you honestly need, come on now), the battery isn't constantly being consumed because it has to power a big, QHD/4K AMOLED-whatever screen. The average charge lasts me well throughout the day, despite having WiFi, Bluetooth and 4G enabled, the screen set to medium brightness, and vibrations all kept at standard settings. The screen on time is surprising, for such a cheap device, and I find that it NEVER gets hot in my hand. It's fantastic, and a wonderful change compared to my old phone that damned near burnt me, killed itself and exploded it's own battery after just 30 minutes of light use.The one and only thing about the BLU R1 HD that I don't like is the really stupid, small and insignificant stuff like the notification LED only being capable of displaying 3 colors (red, green and red-green) and the back camera not being super good (coming from the LG G3, which had probably one of the nicest cameras I've ever used). But in every other field, this phone is absolutely wonderful.Whether or not you need a replacement phone, want a new device, or are just a prime subscriber with 50 bucks and some free time to blow, get this phone!","rating":5},{"id":"R3453Y0MURS3U8","title":"Best bang for your buck!","text":"I just purchased this for my child, it is his first phone.  For $59, you can't go wrong (Even at $110 with no ads.)The construction is top notch, buttons have a satisfying click, they don't rattle like some cheaply made phones.  This device definitely has a premium feel.  Screen is actually quite good at this price, can get fairly bright when needed.Some items to note:- It has a Notification LED (Also shows Red when charging, otherwise green.)- It does have a Ambient Light Sensor, it will automatically adjust screen brightness.- It does have Vibration Motor for alerts.- It doesn't have NFC so No Android Pay Support (expected for this price point.)- It doesn't have electronic Compass (again, for this price point is fine) as a result Maps will not rotate when viewed, but Navigation works fine.- MicroSD Cards can be used as Adoptable Storage (Make sure to use a fast good quality card, like a Samsung EVO+)- Battery life has been okay, but does drop fast from 100%, but stabilizes around 94%.- Camera is just okay, and the back LED is not very bright.- Ads aren't very obtrusive.- A little awkward to put in Micro Sim Card.  The metal frame slides forward and lifts up, you have to hold the card in place as you slide the metal frame back into place.I highly recommend this phone.","rating":5},{"id":"RCRI2MJS7QKB4","title":"This phone is amazing. My gripes are the speakers and power drain.","text":"This phone is amazing compared to a Windows 520 phone, but has problems that worry me. One gripe is the speakers.  The volume is lower than I would like at max volume.  The sound quality isn't the greatest. I sometimes compensate by running a cable from the headphone jack to external speakers on my clock radio and that helps.  I have had other budget phones but they were always hampered with not having enough memory.  I have learned that lesson.  I bought a micro card to add to supplement memory, although sometimes the phone seems reluctant to accept the card.  The screen is OK and the processor very fast.  I use the phone just at home on my bedside nightstand and on home WIFI.A major problem for me is the phone drains power even when off, just as if on.  I can have it fully charged and then turned off completely...eight hours later the battery is completely drained.  I have done all I can think of by turning off things except for the home WIFI access.  It still does this.  It is as if the phone can not be really turned off and somehow it is being used when I am not using it.  Every other phone I have ever had does not drain power when it is turned off.","rating":2},{"id":"RYSZBC7PK2GHJ","title":"You get what you pay for","text":"I bought 2 phones: one for me and one for my mom.The issue here is with my mom's phone. At the beginning it was an awesome phone, with awesome specs and design. It was just perfect for her, until it screwed up after 2 months of purchase. First it began to turn off the screen for no reason and had to restart it, then after 2 days it just never turned on again. The only thing that does is turning the red charging light when I plug it (see the video). She never let it fall on the floor or poured water on it. I had really high hopes for this one, but it broke my heart.I'm a afraid of my own phone, because is starting to behave a bit similar to the other one. But well, they say you get what you pay for.","rating":1},{"id":"R35TDXIMB2BDD1","title":"This is a good phone, for 60 bucks you really aren't going to find a better deal.","text":"I'll start by breaking this review down to what this phone is and what it isn't as opposed to pros and cons as those tend to vary person to person based on intended to use.First, what this phone is.Lets get this out of the way, this a phone that advertises to you. It will do it 24-7 that is part of the deal to get a 60 dollar phone. A good 60 dollar phone at that. At first I thought i couldn't handle the adverts, but, that has passed. I installed my favorite weather app that has a always on notification on the lock screen and I have yet to see a full size lock screen add since.. The adverts are small and pretty unobtrusive once you have a notification on the lock screen. Mostly the ads are for books, games, and movies. No adds are inappropriate and they keep showing the same ones repeatedly and after awhile they are very easy to ignore. Overall for me, it was good trade.Its a budget phone. One that has the look and feel of a much more expensive phone. The fit and finish is really very good for a phone of almost any level. The aluminum side accents with the beveled glass really create a nice aesthetic to it usually reserved for higher end phones.Its great for watching streaming video, listening to streaming music, or listening to music downloaded to the phone. The sound quality that comes out of the phone over bluetooth is good, however, the sound quality that comes over a wired head set is a little flat and a  tinny even with the audio enhancements enabled.The screen is quite impressive for this price point. Its sharp and the colors are nicely saturated without being overly so. One critique I can offer is that it doesn't dim enough (for my tastes) in low light situations. The touch accuracy on the screen is a little unforgiving at first and requires some getting used to in order to be able to get the icon or menu you clicked on to open properly. This seems to be especially noticeable near the edge of the screen. Overall though, the screen is quite impressive and I would put on one level below many of the flagship phones I have had the pleasure of using.Open up a web browser and the phone's performance is more than acceptable. Pages load quickly, movies play with relative ease, pics are fast to load and easy to view and the overall experience is pleasant. However, again the touch screen issues do come into play here and can lead to some mis-taps which may be a little frustrating at times.Phone calls are clear, the voices easily heard over both bluetooth and the phones speaker. I was heard easily and clearly on the other end of the line and the experience was exactly what I expected from a phone.What this phone isn'tIt is not a camera phone. It does have a camera and it captures snapshots of important moments that will look nice on a small screen and to share with friends through text and even on face book in a reduced size. Zoom in, or view them on a large screen, the lack of a high end camera becomes apparent. The photos are soft, and have low saturation with a high level of noise. For most everyday purposes, the camera will get the job done. For those who want this to be the replacement for a good point and shoot or a DSLR or MILS camera, you will be disappointed. For everyone else, this camera will most likely be just fine.This is a phone for gaming on or performing processor heavy tasks on. The processor bogs down loading content intensive pages at times (not to the point that its unbearable but it is noticeable) so trying to play a graphics laden game of performing other tasks that require alot of processing power would probably not go well with this phone.This is not a flagship phone. There is no finger print scanner to unlock it, no extra sensors for fitness tracking, and really not any other frills. Its basic and it gets the job done.Overall, this is a good phone. It works. It makes calls, it plays music and videos, and does that well all while looking and feeling much better than a 60 dollar phone has any right too.","rating":4},{"id":"RQ4FNLIEOQOLG","title":"Can't get more bang for your buck.","text":"The phone is great for the price. The ads do not get in the way. The screen is excellent.  Definitely get the 16gb version with the extra ram.  The problems I have with the phone are the Bluetooth is wonky and I find this a problem with most blu phones. The headphone volume level is inadequate and just not very good but again this is also a problem I find with blu phones so no unexpected.  But the biggest problem is the external speaker is terrible.  I cannot hear hardly anything out of it. You are better off to keep it on vibrate. You are more likely to hear the vibration than the speaker notification.  Having said all that. . . Given the choice of owning this outright or having a contract on a flagship phone I will take this any day of the week.  I can deal with these small issues. They can be overcome.  For $59 thanks to Prime this is a steal.  Buy it and get an mp3 player or a headphone amplifier.  It's still way cheaper.  Well worth the money. Great battery life and performance and the stripped down version of Android is refreshing.  All my apps work great and the cameras are adequate.  If you can deal with the little hang ups which are really problems that I find all blu phones have then you are good to go.","rating":4},{"id":"R1THCW8RBJ14WH","title":"Greatest phone (slick and thin!) for the price, camera OK.","text":"I bought this phone for my mom. I had to test it myself for few days to make sure it was OK. I was a little skeptical at first as the price looked unrealistic. 100 bucks, and on top of that a ~$45 discount for the one with adds. I got it for about $60! Folks, it is a great phone. It should be at the $200-300 range. It kind of looks like an iPhone rip-off. thin and slick. beautiful phone, and this comes from a guy who owns a galaxy note edge. The only downside is that the camera is not top-notch. OK, it is expected as the camera makes a phone way more expensive. it can't be compared with my galaxy note edge (> $700 phone) with a 16 mgpxl camera, that put's iphones to shame. Anyway, I did not take any stars off on my ratings as it is not fair. you cant expect a great camera with $60-$100 phone? I need it the phone for my mom which doesn't really use camera, but needs everything else, so it is perfect for her.As for the phone. I got the 2g Ram with the adds. highly recommended to get 2g instead of the 1g. It is just ~$10 more and it really makes a diference. Boy this phone is fast. It works great (And I have note edge, one of the fastest phones out there to compare). As for the ads - what ads? it's more like one line of notification between the other notifications (FB/Email .e.t.c) and it disappears when I slide way them all. I even thought they will bother me when the phone is off. But nothing. you can't tell this is a phone with adds. BTW, the adds are great as they advertise good stuff that are relevant to your likings.this is an unlocked GSM international phone (dual sim) and I inserted two different sim-cards. My mom has her t-mobile card (USA) and her Greek (cosmote) sim-card, on roaming of course. they work beautiful. very easily to synchronize them and set priorities which one is the main and which one is secondary, on all futures. Call, internet and sms for outgoing as well as for incoming. It has its on place on settings as SIM CARDS.  before she had to carry two phones as she gets free text messages from Greece from her friend who can't use internet but have free text sms. so as you can see you can take this phone abroad anywhere the GSM is a standard. I can't speak for cdma technology (Verizon/sprint) as I haven't tested them so you better check before buying. I wouldn't be surprised if they work, technically they should work.to summarize: great phone for the price, camera it's OK, great screen, large, good lighting and colors. Get the ADD version with 2G Ram. So far not a single issue, Oh I forgot - you get the phone with the latest Android operating system (marshmallow 6).","rating":5},{"id":"R3K4QE2H4G888A","title":"Excellent buy!","text":"I bought this phone when my $900 phone went in to warranty repair and I was totally surprised. It handled everything like a breeze, performed well for what I needed done and I had no complains. Processor is fast, although I did not play any games on it. There is enough memory for my needs. Battery lasted a whole day and some. Screen is super bright and responsive. Amazon ads were not intrusive at all. Call quality is good. I am keeping this as a extra phone in the family now for those \"emergency\" situations.At this price point, following are a few things you have to contend with, not a deal breaker by long shot1. GPS sometimes likes to bounce around when you are stationary. Accurate when moving.2. Camera quality is acceptable, but not like a $900 phone.3. Experienced a few one-way phone calls (when only one person can hear the other), but that could be a the network setting as I never registered it with my carrier. Worked fine on a call back.4. Sound modes (general, silent etc) baffled me. They can however be customized and it might be more of an android thing.","rating":5},{"id":"R3R2ZO19Q726XP","title":"Great phone but has it's quirks","text":"This phone is a great deal at $60! I was previously using the Fire phone but frustrated that apps were so limited.  I really appreciate having the best of Amazon and Google with the BLU R1 HD. The processor is slightly slower and the camera is average but I can live with that. The advertisements are not a bother either. My main complaint and reason for 4 stars is battery life. It does not hold a charge. I will charge it to 100% overnight and within10 minutes of disconnecting it the battery will drop to 90% and I'm not even using it! With average use it needs to be charged at least twice in 24 hours.All in all though this is a great phone for the price and fit my needs well.","rating":4},{"id":"R19U9MNFI89ALQ","title":"Great phone at a reasonable price for your teens","text":"This is the first dual SIM card phone I've purchased, and the ability to hold both a Project Fi and a FreedomPop is a great feature that helps me save money. I read the manufacturer details on Wikipedia before purchasing and was surprised to learn it's based in Miami and has a market presence in Central and South America. The Amazon version has ads, but as with the Kindle Fires, I can live with it.  The screen quality and chip speed are acceptable, but I caveat that statement by mentioning I am not a phone gamer.","rating":5},{"id":"R1RR2SA4V2C12W","title":"New Ad Notifications Fixed","text":"The phone itself is great. I've only just begun playing with it, but it's really responsive and seems to have a decent battery. BUT if you have Metro PCS, be aware that you have to get a special plan if you are using an unlocked phone. The rep was able to reduce the price of the plan to bring it in line with what I was paying before, but I get only 1GB 4GLTE per month now for the same price. You cannot use the automated system to set this up yet, you need to call. The rep I talked to was very helpful, but it took me about 2 hours from opening the box to getting the phone set up on their network. Do yourself a favor and just call Metro PCS when you're ready to activate instead of fumbling through it and discovering that you have to call anyway.UPDATE: If you are having trouble with apps crashing as soon as they open (like Starbucks) the system update from 7/16/16 fixes these. Everything's working perfectly now.UPDATE 2: I love the phone overall, but it's getting really irritating that I get a notification every time a new ad is available on the lock screen. It sounds the same as all the other notifications, so I have to check every single time to make sure it's not a text or other message. I NEED some way to turn notification sounds off just for new ads. Minus one star, unless someone can tell me how to turn off the sounds for just the ads.UPDATE 3: The lock screen ad notification is finally taken care of. I adore this phone (for the price) and I now feel confident going back up to five stars.","rating":5},{"id":"R1AOXESCAUML0U","title":"Great value for a dual sim android phone.","text":"For 60 dollars, this is a steal for a phone that is at least on par with a Samsung 4/5 or IPhone 5/6 with minor differences. The best part is that it runs the latest version of Android (Marshmellow) which improves the speed, functionally of phones. The ads part is not nearly as intrusive as those on the \"free\" apps.","rating":5},{"id":"R303UC19M1ONNX","title":"solid phone for cheap price","text":"i'll admit the ads (apparently only appear on lock screen) bother me more than they should, i mean its a steal for 59.99 and the phone seems pretty sturdy especially with the curved glass screen.however, overall I'm not a big fan of the phone's operation. the screen auto rotating works especially bad for me, maybe I just got unlucky with a defective model or something idk. But can't argue for the price and such, this is a great deal.","rating":3},{"id":"RDVHBJD4F3MT1","title":"A steal for the money!","text":"There isn't a lot to be said that hasn't already. This phone is a steal at $60. I loaded it up with a $10 sim card from FreedomPop and I have free service working great on a $60 phone that will play and do just about anything. BUY THE 16GB VERSION. It is absolutely worth $10 more for the 2GB ram and double the storage (it uses almost 6GB stock!).The cameras are not bad, nicer than some people let on. Build quality is stellar, the speaker is reasonable the screen is bright and easy to read, looks super nice.I have no actual complaints, the ads are no big deal at all and are a very minor trade off for such a deal. $75 got me a phone, case and free phone/data use. I couldn't be happier!!Trying to convince my friends to buy one too now. lol","rating":5},{"id":"R3EDA66QXZAR45","title":"Ok","text":"Works but has a few glitches. Doesn't always tell me when a txt comes in so I find the txt hours later, frustrating. Wish \"settings\" we're all in one place but there are several places to find the settings for different operations. I.E.: general settings are in one spot but settings for txt messages are in a different spot. My last \"BLU\" phone it was all In one spot, easier for me to understand","rating":3},{"id":"R2UPZAITFA6S4B","title":"Great phone at an amazing price!  Used on Cricket Wireless.","text":"We decided to switch from Verizon  to Cricket Wireless.  I bought two of these because the run on 4g LTE networks.  One discounted version with the Amazon software on it and one without at full price.  These phones are absolutely amazing.  The run smooth and have plenty of storage for apps.  They are light and the displays are sharp.  Can't say enough about them really.  Glad I stumbled across them.  I would buy it again.","rating":5},{"id":"R1AAWQ38XD6VD8","title":"Great price for a great phone!","text":"I was borderline about getting this phone based on reviews but I am thrilled with it now that I have used it.  It has a beautiful display, good sound and damn good performance. The cameras give you great photos. The fact it has a front facing led flash is cool. Have not seen that in a lot of phones.  I have the 2 GB RAM and 16 GB internal storage version. This is truly a great buy at an extraordinary price.","rating":5},{"id":"R21PG5VP0JDZJY","title":"Great phone for a newbie","text":"My first smart phone, and I'm loving it. I did have a glitch with it after about two weeks -- I turned off the phone and when I turned it on again, it would only start in safe mode. But I worked through the menus and was able to reset the phone. The camera is decent enough for emailing and sharing photos online. It seems to be surviving my somewhat careless handling (dropped it today at the office, and it's fine). Thank you for a reasonably priced product for this smart phone newbie!","rating":5},{"id":"R3AUMM01BCBM0F","title":"The price is right but -------(","text":"Very unhappy with it. The first one was returned because incoming calls could not be  answered. The replacement unit was returned because something would trigger some kind of mfg type check program. There was no way to stop it. You could not even pull the battery to stop it because the battery is not removable.","rating":3},{"id":"R1H78XG6CM1UOA","title":"as I'm pretty much a loner","text":"This is my first smartphone.  I had been reluctant to buy one because of the cost, and I've only used my cell phones for taking occasional calls, as I'm pretty much a loner.  When I saw the price of this and the supposed ease of transferring from my Tracfone account, I decided to give it a go.  I thought being able to use my phone for an ebook reader would be great.  I planned to use it in waiting rooms and during work breaks, but it's so light I can one hand it and scroll with just my thumb.  I like it better than my 8 inch tablet for ebooks.  I can't vouch for the camera because I never use it.  Nor can I comment on the quality of graphics on high-end games, as I don't play them.  But for what I use it for, it's pretty much perfect.","rating":5},{"id":"R215HONBP5QJW2","title":"Ridiculous price-to-performance ratio for $60!","text":"In this review, I'll be comparing this phone to the Note 4 which I have used for 2 years in the features that matter most to me. Let me start by saying that I have given my Note 4 to my father. I started using the R1 as a little experiment, thinking I'd be back to my old phone in a week. Man, was I wrong. This phone feels way faster than the Note 4 due to the stock Android 6.0 experience. When compared to bloated Touchwiz, it seems blazingly fast. Battery life is also incredibly good, I'd say twice as good as the Note 4 was. It's not too big so you can comfortably use it with one hand, but it's not too small to be hard to read or watch videos. The size is perfect because I always thought the Note 4 was a bit too big. And you can actually see the display in broad daylight unlike the Note 4! I've played many games on it and they run perfectly, and it doesn't get nearly as hot as my Note 4 did which always felt like overheating during games. I can't believe I spent $800 on the Note 4 and this $60 phone just blows it out of the water in every respect.Edit: I don't use the camera very much so I forgot to mention it. The camera is the only real downside, taking average quality pictures. If you're coming from a flagship that costs 10x this, don't expect to be blown away. And if the camera is really that important, I would recommend a more expensive phone.Edit: Lockscreen apps do not work anymore in removing ads. It is very easy however, if you can flash TWRP and then look up \"guide R1 HD bloatware XDA\" on Google.","rating":5},{"id":"R11O600JPILKK3","title":"Perfect Phone with a Curved Screen","text":"We were in need of a new phone for my son, who of course dropped his other phone. While searching for a phone up popped the BLU phone, so  I read up on the phone and decided to purchase the phone. I am so glad I did, my son loves the phone and now my daughter is asking for one.  This phone has the curved screen, which is usually only found on the higher end phones.  The phone works great with our AT&T carrier.  The battery life is good.  The phone supports a micro sd card.  It's an android phone.  I was very impressed with the style, look and feel of the phone.  The screen is vibrant and easy to see. The phone performs well for texting, surfing, music, emails, calls, pictures and lets not forget playing games.  This is a gem of a phone.  I have one of those high end phone and I must say I like this BLU phone so much better.  The camera quality is good.  It runs smooth, has plenty of room for apps and the display is sharp.  We have the 16GB with 2GB ram.Pros:* Fast Loading* Swiping is Quick* Lots of Room for Storage* Sharp Looking* Curved Screen* Battery Life is Good* Ease of Use* Fast Processor* Clarity is Spectacular* Bluetooth* Lightweight* Runs on Android MarshmallowIf you are in need of a phone, this is the one.  We are very satisfied with the phone.","rating":5},{"id":"R12UVXXZVI0PNA","title":"Rock solid basic smartphone for $60","text":"This is a great little basic smartphone. By little I mean 5\" screen, by today's standards they don't make many more that are smaller. Is it a \"powerhouse\"? No not at all. I'm not much of a gamer, so I won't comment on its gaming ability at all. I have been using this as my daily driver for over a week now.I can make calls. Currently I have a sim card for Ting (T-Mobile) and Cricket (AT&T). Both work very well, Cricket works better when moving around (driving). I doubt dropped calls is an issue with the phone... as one network works better than the other.The ads are not intrusive at all. Actually I found a couple of X-Mas gifts because of the ads. They seem to be mostly lightning deals which I don't usually go searching for, but with the ads I did find a couple of pretty good deals.BLU is not known for updating their phones, so I wouldn't expect many for this one. Running Android 6.0 and I doubt it will go further than that. It is what it is... remember $60. Yeah skip the 8gig version.Is it the latest and greatest? Nope. Is it a solid smartphone for $60? Very much so.As a backup phone or for someone not willing to spend $100's on the high end stuff, worth the price any day of the week. Buy it and keep it as a backup, or use it as a two line phone. Yup, will take two sims.","rating":5},{"id":"R20S3EHVU9KKGK","title":"R1 HD lives up to the hype","text":"Alright so you've read every review there is about the $50 wonder phone from BLU. I'm here to give you the scoop in a language that's understandable because let's me honest if you're looking at the R1 HD tech specs don't top the list of necessity on your mobile device. Read on and email BLU to let them know theh should give me a cut of every R1 HD sold on Amazon.Also I waited almost four months to write this review so I could get a real feel on how this phone handles. I have a secondary line that I use for work (tax write of purposes) I mean to play with unlocked phones.The list....Display 3/5 So can you see everything clearly that you would use a phone for??? Yup.. But don't think your gonna watch the newest flick off your KODI app with great detail. For one the color saturation is horrible and even with the 2gb ram version of this phone running KODI will ensure a restart of your phone. Don't get me wrong the display is not horrible but it's not great either. If your using it for basic phone applications or even games your fine. If you plan on downloading movies and watching them your outta luck.Battery 3/5 Like I said I use this as a secondary phone but I do use it a lot. I constantly  have to take pictures (I'll get into that later), fill out forms and make calls from this phone and the battery life is average at best. When I first bought the phone I would constantly try to see how long it would take with basic use to run dead,  now I make sure it's always on a charger and I have a power brick with me. I would say I get about 6 gourd of average use and I get about a day of stand by with minimal use.Processor 4/5 This phone is not known to be a power house but...... Even with a ton of apps running it runs as smooth as you could ask for without even a hiccup. I think BLU did a great job of b of matching a processor with this phone. It knows what it's capable of and does a great job of doing it. I'm not a gamer but I did download some games known for heavy use of the processor with the goal of trying to freeze this thing and every game ran perfectly. Surfing the web and even websites with heavy information ran fine. Switching through applications was a breeze and for what's supposed to be the low point of this phone I found it to be a high light.Camera 2/5 I use the camera to take about a hundred pictures a day and this is for sure the weakest link of this phone. Natural light, artificial light or no light the pictures come out mediocre at best.Bottom line... I love it. I have the option to use several different phones that I have purchased to play with and I have stuck with the R1 HD. The Amazon ads are not intrusive despite what others say. The size and feel of the phone are perfect for me. I actually like the look, feel and size of this phone better than my Galaxy S7. I don't think I could use this as my daily driver because I use my devices so heavily. As they say you get what you pay for and for $50 or even $100 I'll even say in the $150 price range I'll take this phone over most of the others. If your not a heavy user and just need something to check out Facebook or browse a few websites the R1 HD is a great option. If it's for a back up phone just buy it already your not getting any better in this price range. If you want the latest and greatest obviously its not for you. But at this price point I would suggest buying one as a back up","rating":4},{"id":"RZWM0RYQFHM11","title":"I really, really, really, like it....","text":"BLU R1 HD - 16 GB - Black - Prime Exclusive - with Lockscreen Offers & Ads -- I wish I could do half stars...I really, really, really like this phone - 4.5 stars....But here's why I do not completely Love this phone....1) No WiFi calling capability....I cannot use my phone in my office at work, unless I go outside. The problem is with the bldg. construction, not my phone, but my old phone had Wifi Calling capability, so I could make and get calls in my office. But this is not an absolute deal breaker.2) The power switch is in the worst possible place, right side edge, center....Everytime I pick up my phone I hit the power button it is extremely annoying. Whoever designed it that way should be fired! But this is not a deal breaker.3) Android 6.1 - some of the changes I do not like, such as the contacts interface....some features are hard to find. But not a deal breaker.4) The battery power drops pretty fast from 100% to 85%, but stays in that range for quite a while. I try to keep most of the apps turned off in the background and only use Wifi when absolutely necessary. But this is not a deal breaker.Here's what I really, really, really like about the phone....1) It is light weight, very slim, and seems well constructed. I have dropped it several time and it seems perfectly fine.2) The screen is large, and bright, and very responsive.3) It has tons of storage (16 gb) and it can accommodate up to a 64 gb micro flash card.4) It has a very fast processor with 2 gb ram and quad core processor.But here's why I switched to this phone....cost me $55.00!! with ads on the lock screen. I ask you, why pay $600 for a phone that can burn up in your pocket? Why buy a phone you have to finance with a credit card or on your calling plan?I may not love it, but I really, really, really like it!!","rating":4},{"id":"R1V4I1DP1TVV4X","title":"Great Phone, Ads can be unsubscribed.  Camera is its only sore point.","text":"This phone really changed my perception of what a cheap phone can be.  The screen although only 720p is very bright, clear and has good color reproduction.  Feels like a high quality screen.  The processor is fast and the device doesn't feel slow or hesitant at all.Calls through the ear piece are low in volume and tinny.  However this can be worked around on longer calls by using a headset.  the microphone port supports 4pin headphone/mic sets.I do wish the camera quality was better.  The device takes decent stills in bright light, but low light performance is rather poor.  Also taking pictures of my son and pets while active produces blurry photos.I bought this product because I needed a temporary device while my iphone was being serviced.  However I may just sell my iphone keep the cash for something else.  For the price this is a terrific device.I am glad that Amazon allows you to unsubscribe from the advertisements.  I did find them a little too intrusive and annoying.  Since, I liked the device I went ahead and unsubscribed.  Took a few moments while connected to wifi for the ads to be completely unsubscribed.  The notification ads disappeared first and then the lock screen ad was removed a few minutes later.  Process worked well.  I am glad Amazon had this option.","rating":4},{"id":"R2861E9Z65XZQS","title":"It has to be the best budget Android phone EVER. It does everything a Smartphone should for less.","text":"I wanted to try an inexpensive but pretty stock Android phone to see if I could make the transition from Apple to Android when my very expensive IPhone 6 dies in a couple years. If it is terrible I can return it if I can live with it I haven't spent that much. I have literally read hundreds of reviews before I bought the BLU.First I have to says I think this phone has been judged harshly given its price point. It's $59! For that price I think it is a fantastic phone. It has (thankfully) a plain jane Android 6 OS. The processor is plenty fast and the 6.0 use of memory makes it a 60 GB usable phone with a card. Yes the speaker is weak but it is fine in all but noisy environments and if you talk on a speaker phone in a noisy busy place your a jerk anyway. I always use my wired Beats and the sound is excellent. Very good bass and clear sound.PROS:-Stock Android makes it so easy to install apps from the play store on your computer to your phone. It literally took me 15 minutes to install 50 apps.-All the Google subsystem and the Amazon subsystem in one device. So I have access to my entire music library from both plus all the prime videos. Videos play and look awesome.-KODI! (Mic drop!)-OK Google frankly kicks Siri's arse when it comes to accuracy. Still figuring out all it can do.-Screen quality is great. Bigger yet lighter than IPhone.-I have a Kindle Fire and Fire TV stick and this is the best that Amazon has ever worked with Google Play!- Pairs absolutely fine with my 2011 Hyundai Sonata, downloads phone book, and with every other Bluetooth device I have.-Works with my Fitbit and Pebble watch just fine.-The Amazon ads don't bother me in the least. Occasionally see one at lock screen and already dumped widget in the trash.-Plays every game I played with IOS great. No stutter, fast load times. Smooth gameplay.CONS:-The camera is acceptable. The flash is fine but low light isn't great.-The phone isn't recognized by Windows as an MTP device and so I can't side load videos or documents. No big since I really don't watch movies on a 5\" screen. It could have to do with my card being dedicated as memory instead of storage but seems to be a known issue.-It's a $59 phone so don't expect NFC or a fingerprint reader or an AMOLED screen. It also doesn't appear to support Bluetooth low energy.-It isn't rooted but appears rootable if you have the tech savvy.-Not the best GPS but it works within a few houses.- Full day battery life with BT and wifi on. Not great not horrible.","rating":5},{"id":"R1GLIIWTUF5J5C","title":"It's a great phone for the price but not so great on delivering. Literally.","text":"I only bought this phone for one reason, to deliver for my job. My job requires an android and I have an iPhone so I needed something cheap, hopefully reliable and asap.This phone is great with one exception, it keeps freezing up on me when I deliver to certain areas, Bluetooth always seems to disconnect and the speaker on the phone is not loud at all.My roommate and I share the same plan which is T-MOBILE and his phone only has a problem in the area over by what is known as the \"dead zone\" which is by Red Rock Canyon and that's because T-Mobile doesn't have service up there. Other than that he never has problems with his android phone.The Blu phone always seems to freeze up and I have to start all over again with the program. At first I thought it was their app that kept freezing up but my roommate, who works the same job, worked that same area as well and his phone was fine. Never froze up on him.Also this phone also has a problem with scanning barcodes and it barely will scan a square barcode.The phone is not loud at all when you put it on speaker so I bought a Bluetooth speaker for it and sometimes it has connection problems with the speaker. For some reason it will stop connecting to the Bluetooth speaker and you have to either turn off your Bluetooth on the phone and then turn it back on to reconnect or do the same for the speaker as well.I gave this phone 3 stars because it isn't a bad phone overall, it does it's job like all other phones do, and you can't beat the price but it's not a good phone for what I do which is making deliveries and scanning any barcodes.I would recommend this phone for people that are looking for a decent priced phone, that looks great and does it's duty as any android phone can do. It's just not for people who travel around a lot  because it will freeze on you or likes to scan items whether it be for your job, at stores or at your home. It just takes forever for it to scan a barcode, especially the square ones. And if you want to use the speaker on this phone in your car, you definitely can't have your air on, windows down, or your music playing, the speaker is just not loud enough unless you use a Bluetoothand even then it will continue to disconnect then reconnect on you.Maybe it's just my phone that's having all these problems because I do recommend this phone to people who want a phone that does work for regular website browsing, phone calls, emails, and other simple things you need for a phone to do. I haven't tried games on it yet but like I mentioned above the speaker is not loud enough.I only use it for work, typing this review and the battery seems to run down quick as it's doing right now.I really do like this phone but it has problems that I can't have. I think it'd be a great phone even for someone's first Android. It's just not for me and the things I need it to do.","rating":3},{"id":"R3AV6U77AFSHTX","title":"Amazing Budget Phone","text":"I give budget ratings compared to other budget items. I will not be comparing this to a high end phone.This has run pretty much everything I have thrown at it. Unlike, other budget phones, this will apps save to SD with no problems. The ads are not a big deal. It can make for a pretty lock screen. You can install a different launcher, even a different lock screen. I have not encountered an app that won't work or that the phone will not let you install. I had one app that was running on SD that wouldn't open but it did once I moved it to the phone.I am using it on T-Mobile with no problems, waiting for news on Band 12.Performance wise, it's very smooth. I have experienced no lag on its third day of use. I will update the batter performance as I use it more. I have been on it constantly so it wouldn't be fair to see what it's like on normal use.","rating":5},{"id":"R2KP1AHLOZKQNN","title":"My first Android; I like it","text":"This is my first Android. I gave it 4 stars because I do not have other experiences. I had some problems in getting it working with T-mobile, but later I found that there are no limitations at all. T-mobile has not been supportive; I have been  told that my old sim would not work and that I needed a new one. In my area there are not T-mobile stores, so i called again to get one by mail; this time I was told that it would have been useless - \"your phone is not compatible with out carrier\". Nothing of the above; I borrowed a T-mobile sim from a friend used it in my phone, it immediately found the carrier; I get back in it my old sim (one I had to cut) and everything is fine; it even works with my European SIM.Very good Wi-Fi: I get connected to my home wi-fi at about a mile distance. So I'm very pleased with this phone; maybe people much more expert than me would see things I don't see.","rating":4},{"id":"R2GNQFMONR00B6","title":"Amazing phone for the price","text":"I wasn't expecting much, but I wanted a basic smartphone for my business number. After having this phone for a few days, I am beyond impressed. For the price, this phone is phenomenal! I have a personal iPhone 6s, but I've been enjoying my experience with the R1 HD so much, I put my iPhone sim in the BLU phone and took advantage of the dual sim capability. Love it. It's fantastic not to have to carry around 2 phones, and it's been easy to switch back and forth between my 2 numbers (with 2 different carriers).As for the phone itself, the display is crisp and bright; the performance is snappy (I have the 16GB, 2GB version) and phone calls have been really clear and smooth. The ads haven't bothered me at all, something I was worried about.I'll update this review if something changes, but for now I'm very happy with this phone.","rating":5},{"id":"R2KBV1UUIP56H1","title":"What a bargain!","text":"I've had it now for about a week. I had a real problem with the Blue Tooth to my car.  It was sporadic. Sometimes it would work and sometimes not.  I called the phone number in the user manual and talked with BLU support.  They figured that maybe the phone needed to be reset.  They sent me email on how to do that.  BINGO.  The Blue Tooth works flawlessly.  Clarity on the phone is spectacular.  I, being an Android user had no problems navigating around the phone and I've already put some apps on it.  Specifically an app for a software package called Mobiledit which allows a PC to interface to the phone via WIFI,  Bluetooth or USB.  It allows for backing up the phone contents, like the phone book in case anything happens. It also allows for modifying the phone book from the PC,  which is sometimes easier than doing it on the phone.  The adds are non-intrusive and don't get in the way.  I've had numerous phones from numerous cellular providers.  For the price, this one is unbeatable.  If anything changes I will update this review, as like I said, I've only had it for a week.  Whoops, I forgot mention that it appears not to be a battery drainer either.","rating":5},{"id":"R3VYGGKT1XPENF","title":"Bad speakers...everyhting else Great","text":"I love this phone, the ads are not annoying at all, and somewhat pleasant as it connects to the things I like on Amazon. even the front facing camera is great for selfies and this is normally not the case with blu phones. Front facing and back camera take great photos and the phone comes with some great customization features. The only problem with this phone is the sound  is very very low without a headphone. You can barely hear the video or anyone talking or music. very disappointing  but easily remedied with a set of headphones. I hope the next phone they release will have this fixed. as it is annoying seeing that all other features on the phone are solid.","rating":4},{"id":"R1FJIWIIRQY0M","title":"Month of use and still no issues.","text":"I've owned the BLU R1 HD for about a month now and I'm pleased to say that I am very satisfied with the phone.  This was a replacement for my BLU Advanced 5 which is a JOKE and started to fail after a month of use.  I almost didn't want another blu phone, but the price was right on the R1 HD and I took the chance.  The Amazon ads really don't affect the performance of the phone and I actually like seeing the ads.  This is my work phone so its exposed to more abusive environments than most phones and it has held up well so far.  The apps I've downloaded haven't bogged the performance down or at least I haven't noticed.  The camera works fine for what I use it for and the display is just as clear as my Samsung GS6.  The speakers work fine and I can hear the person talking when on the phone.  I do enjoy this phone and hope it holds up.  If you don't mind the Amazon ads then the price is ridiculously cheap for a smart phone like this.","rating":5},{"id":"R2I6RATKYFNVKW","title":"Value for money","text":"Buying a 'locked' phone I was a little concerned about how it would be, but the phone is a gem for the price. The only thing I miss is having my own background photo on the locked mode. I like the Ads that come on-screen :)The phone is slim and light, feels a bit slippery in hands without a cover.What I likeThe price, value for money, slimness, light weight yet sturdy, good screen, Speed of the phone, Dual Sim, storage options, 2 GB RAM/16 GB Storage + SD CardDon't likeCamera is a bit washed out images, speaker not loud, voice quality could have been better, battery is non-removableVerdictFor the price of 59.99 locked screen version, this phone is total value for money. A very decent smart phone, with 16 GB memory, 2 GB RAM, SD Card option, Dual Sim, very good operating speed, cellular and WiFi connectivity, to name a few, this phone is one of the best smartphone you can find for that price. BLU is a US company though phone is made in China.","rating":4},{"id":"R1YOHIBD5QSQDM","title":"Great Specs For The Price (UPDATED 7/16/2016)","text":"Only having it for a day and still reloading apps and getting familiar with it I must say I am really liking this phone. I will update my review down the road as I have time to live with it as this will be my primary phone. I am upgrading from a BLU 5+5 C so I am already use to BLU phones. This is easily twice the phone for literally half what I paid for the 5+5!The 2 gig memory (not storage) is what sold this model for me. NO phone offers 2 gig of RAM anywhere near this price. I do not run a lot on my phone but what I do needs RAM and many phones only have 1 gig and by the time all the junk of the OS loads you have maybe a little over half usable for your apps. I took my SIM out of my 5+5 and dropped it in this one (I use Strait Talk and have been told that does not work but it did for me). Perhaps is because I am going from a BLU phone to another BLU phone but it works. I have noticed the R1 does not get as good of a signal according to the indicator yet I have not noticed any drops in calls or anything but I have noticed issues with data because of the lower signal but I am on wifi all the time except when it goes out so long as the texting and calls get through I am fine with it.This does not come with the extras you normally get with BLU phones but not missed at all (earbuds, screen protector and gel case).The lock screen ads do not bother me in the slightest and I HATE ads on my phone. You swipe to unlock and ad is gone till the phone goes dark. The ad is VERY unobtrusive to me.Snappy and quick this phone is. Sound quality is good and the gorilla glass hides most prints and smudges well. Camera is adequate and very good for this price range with focus and a nice feature set of ways to edit and enhance your photos. Images on the screen look really good to me, especially for a 60 dollar phone.Other than signal strength if I had a strong critique it would be non-removable battery but moreso the way SIM cards are installed. It is a slide back then lift then close and slide forward. I was not getting that from the instructions and thought I had broke it as it would not latch closed. Was by accident I discovered it was a sliding lock down.As I have said after I spend more time will update my review but glad I bought one so far.UPDATE: If you have not already go under settings then about phone and tap on wireless update. There is, what I am assuming, the promised update available. Took me about 10 minutes for it to complete.","rating":4},{"id":"R9CR6ID7KRB8G","title":"Pretty respectable phone and works well with Project Fi","text":"At $50, this phone is prettier than many pricier phone, such the Nexus 5x. With 5\" screen, this R1 body is slighter smaller than the 5x with a 5.2\" screen. The respectable and thinner look is due to the curved glass edge and the curved, graphite colored metal frame. The 5x and many other phones are boxy in comparison. Because of the more exposed glass edge, I recommend a case that protects against a high corner drop; don't ask me how I know.I would have written a review much earlier if the R1 wasn't off the market for months, driven me to buy another prime exclusive costing twice as much and not as pretty. As long as you don't want this phone to compete with mid-range phones or high-end phones, everything is better than expected. It has 4G LTE and supports TMO band 12 that penetrates walls better. Quality glass with pretty rounded edge. 5MP selfie. 2GB RAM minimum for Pokemon Go. 720P HD display. My kids have been using it for months and they aren't bothered by the ads.The phone works well for Project Fi, which is not the cheapest. But once you have a Fi account, you become a nano 4G carrier with up to 9 subscribers, at $10 per GB or 1c per MB actually used without fixed charge.To activate a Project Fi account you need the normal SIM and a supported phone. Once you have an account, the normal Fi SIM works on this R1 without changing any settings. Though, it makes more sense if you use the Fi SIM on an iPhone 6S. Yes, it works with minor APN settings. In any case, you lost some advanced Fi features and some carrier-specific features. For a non-Fi phone, you are basically using the TMO network without carrier switching. And VoLTE on TMO may or may not work.The best thing about Fi is the data only SIM, at only 1c per MB. You pay only for the data used and nothing else. You don't lose any features because these SIM are using the plain TMO 4G LTE network including band 12 for better indoors penetration. The data only SIM works on many phones including this R1.You can still have normal voice and txt even though the SIM is data only. In short, you just need to replace the stock dialer and messenger with google hangout. You need to join google voice asking for a new free phone number, or porting your old mobile number for $20. It appears as a normal phone with a normal phone number; you just use a different app for the dailer and the messenger. You have your own voice over Wifi or over LTE.Voice over data only SIM is in the order of 1c per minute and negligible for txt. This is highly competitive compared to the TMO to go plan at 10c per minute or 10c per text. In addiction, data is charged per MB or for each cent without rounding up to a minute. This is a great family plan at $20 minimum per month and 1c per MB used. The account holder can monitor the data usage on each SIM easily.Wifi hotspot doesn't work for the Fi data sim on this phone, but on many other phones. Project Fi doesn't support hotspot on the data only SIM because they cannot guarantee tethering to work on all possible devices. The problem on the R1 is that you will get a gateway IP of 192.168.xxxx.1, which is a local non-functional address. The R1 is a popular target for rooting with plenty of instructions. One might be able to reroute after that, and to make it less prime exclusive.The price is so good that I would use this phone to replace a landline via hangout, and mount this phone more permanently with power supply on the car dashboard for navigation and for a dedicated car phone, saving a lot of inconvenience and battery on my phone. Hangout and most VoIP apps do not support E911. Though any mobile phone can do emergency calls, the call center do not get your phone number automatically to call you back. You can add VoIP plans for a few dollars that support E911, or add a voice & text only 2nd SIM like the TMO to go plan for $3 minumum that supports E911.","rating":5},{"id":"RUHZJEX0ZK9RF","title":"Best phone ever!","text":"I've had this phone for months now and it's been through everything, But to my surprise. The phone still works!!  My screen is smashed and I'm still using the phone right now to write this review! And the price is crazy cheap too! I'm definitely buying another one!","rating":5},{"id":"R1THCW8RBJ14WH","title":"Greatest phone (slick and thin!) for the price, camera OK.","text":"I bought this phone for my mom. I had to test it myself for few days to make sure it was OK. I was a little skeptical at first as the price looked unrealistic. 100 bucks, and on top of that a ~$45 discount for the one with adds. I got it for about $60! Folks, it is a great phone. It should be at the $200-300 range. It kind of looks like an iPhone rip-off. thin and slick. beautiful phone, and this comes from a guy who owns a galaxy note edge. The only downside is that the camera is not top-notch. OK, it is expected as the camera makes a phone way more expensive. it can't be compared with my galaxy note edge (> $700 phone) with a 16 mgpxl camera, that put's iphones to shame. Anyway, I did not take any stars off on my ratings as it is not fair. you cant expect a great camera with $60-$100 phone? I need it the phone for my mom which doesn't really use camera, but needs everything else, so it is perfect for her.As for the phone. I got the 2g Ram with the adds. highly recommended to get 2g instead of the 1g. It is just ~$10 more and it really makes a diference. Boy this phone is fast. It works great (And I have note edge, one of the fastest phones out there to compare). As for the ads - what ads? it's more like one line of notification between the other notifications (FB/Email .e.t.c) and it disappears when I slide way them all. I even thought they will bother me when the phone is off. But nothing. you can't tell this is a phone with adds. BTW, the adds are great as they advertise good stuff that are relevant to your likings.this is an unlocked GSM international phone (dual sim) and I inserted two different sim-cards. My mom has her t-mobile card (USA) and her Greek (cosmote) sim-card, on roaming of course. they work beautiful. very easily to synchronize them and set priorities which one is the main and which one is secondary, on all futures. Call, internet and sms for outgoing as well as for incoming. It has its on place on settings as SIM CARDS.  before she had to carry two phones as she gets free text messages from Greece from her friend who can't use internet but have free text sms. so as you can see you can take this phone abroad anywhere the GSM is a standard. I can't speak for cdma technology (Verizon/sprint) as I haven't tested them so you better check before buying. I wouldn't be surprised if they work, technically they should work.to summarize: great phone for the price, camera it's OK, great screen, large, good lighting and colors. Get the ADD version with 2G Ram. So far not a single issue, Oh I forgot - you get the phone with the latest Android operating system (marshmallow 6).","rating":5},{"id":"RIQMGPY5ND3MK","title":"Not for T-Mobile","text":"I really wanted to like this phone. For the price (currently $60 with Amazon Prime Ads), it's very snappy, functional, and has some unique features like dual SIMs and a microSD card slot.  I purchased this for use as a home mini-tablet/Google Cast head/back up phone for T-Mobile. Performance was outstanding. Even while downloading and installing apps, the menus never slowed down. I was amazed. It never seemed to stutter either.But, there are some flaws, the last one was the one that forced me to exchange this for a Moto G4 Play (at almost twice the price):- The WiFi is 2.4GHz only. This is problematic in an apartment building where the three 2.4GHz bands are flooded. I didn't see any performance problems, right away, but it's something to be aware of.- The speakerphone is on the back. This can cause it to be easily muffled if you place it down on a table/sofa, etc.- **** The phone DOES NOT support Band 12, nor VoLTE for T-Mobile ****.What this last point means: If you live in a Band 12 (Extended LTE coverage area), you will not be able to use it. It'll be the same old \"kinda crappy\" coverage TMobile is known for. Additionally, while you can force enable it through some unauthorized software, it will only support data, not voice. This is the VoLTE (Voice over LTE) feature.  The major sticking point is that promotional material from BLU's website, press releases, and at one time Amazon stated that these features would be added shortly after release as an OTA update. It's been 4 months and the current response from BLU customer support is that the phone does not currently support these features, nor are there plans to patch them in.The phone was ultimately exchanged for a Moto G4 Play with Amazon Prime ads (currently $99).","rating":1},{"id":"R1XQ4MHY08H73L","title":"Love the phone","text":"Love the phone, the ads are not at all intrusive and it runs EVERYTHING I need it to without a hitch. I took off one star because the battery life without much use is only about 12-18 hours, and the battery can not be replaced. All in all, not a dealbreaker, as I have a car and pocket charger thanks to having 2 teenagers, so the battery won't be a problem for me-but if you are away from your charger for long periods of time and really need your phone-may want to take a pass.Also-not sure how it ran before the update-the first thing I did after I installed the sim/loaded the phone was make it check for updates and download, because it was recommended by so many people.","rating":4},{"id":"R31E7WEQS3WEM","title":"A deal too good to miss","text":"I struggle to think of when I may have gotten a better deal than this on any piece of electronics, let alone a phone. This is an excellent device at as absurdly low price for Prime members like myself.  I have owned a Nexus 4 and a Moto G 2nd gen, and Blu R1 HD is as good as the Nexus and way better than the Moto.  It's fast, nice to hold and has a display that is sharp and bright to my eyes.  People complain about the camera; I had similarly bad experiences when I started. But I have found that tapping the center of the frame to focus the subject markedly improves the quality of the picture. My calls come in and go out loud and clear, no problems whatsoever.  Now about the lockscreen ads.  Leave it to Bezos to demand that the ads be as unobtrusive as possible and then to achieve that goal in spades. There might as well not be any ads at all.  The ads come in as  notifications sized like all other notifications, namely very small, and only enlarge to fill the screen if you click on them. Only a fool would pay the premium demanded for a no ads version of this device.  So all in all, I could not be happier with my purchase.","rating":5},{"id":"R29X0MQPUJO7LZ","title":"Working w/Tracfone & wifi hotspot!!!!.  :-)  :-) :-)","text":"First off, the phone is fantastic, FAST, unbelievable gem for the pricepoint. My only complaint so far is that the media speaker isn't very loud compared to other devices.  Other reviewers have been spot on as far as pros so I will fast forward to trying to use this as a $7 Tracfone device.I bought this and a $1 tracfone byop kit as a backup Android phone to my iPhone 5s-- especially for hands-free stuff in the car, Android wins by a loooong shot.  So when I called Tracfone today they said the IMEI I provided from the phone resulted in an \"error\" and sorry but they could not help me as the phone is not compatible.  The rep said maybe I could try online and sometimes that works even though a rep can't get it activated. I then had a lightbulb moment and took the sim card out of my current activated backup tracfone  (Alcatel one touch sonic $14.99 on Amazon) and put that sim card (ATT towers) into the R1 HD.  I had to turn some sim card settings on and restart the phone and not only did it work PERFECTLY..... so did the wifi hotspot!  I have never seen a Tracfone with a functioning wifi hotspot before this.  I have not tried the rep's suggestion of setting it up online yet because I am so relieved to have a hotspot for travel again.  I just wanted to share this discovery--that you can just put an active ATT/Tracfone sim in and it will work with a bonus hotspot to boot----I have tested the hotspot and it works blazing fast too.  :-)  If I have any problems with this setup, I will post an update.  And just to clarify, I used nothing from the BYOP kit.","rating":5},{"id":"RJ4HRU7ZLBWXA","title":"Fantastic phone for the price.","text":"Fantastic phone.  This is my first smartphone so I really can't compare to any other brand.  If BLU can deliver a quality phone like this, why even bother with a more expensive model.  As a photographer, the only feature I can wish for is image stabilization on low light conditions.  Other than that, the image quality captured by this phone is amazing.  Good for social media posting and a few taken, maybe destined for the art gallery.  As a phone, it answers and makes calls.  Texting works just fine.  Emailing and web surfing works well due to the stable Wifi feature.  Bluetooth works as well.  Amazon advertising is not bother some.  In fact, I've ordered from some Ads. Sometimes, they look like cool screen savers.  Battery lasts a whole day and more depending on what I'm using.  2hrs of playing Pokemon Go takes the charge down to 50%.  Screen is plenty bright.  Speakers are not loud enough sometimes but it's a phone.  I'm plenty happy with this phone.  Amazon should allow multiple purchases per account and not limit it.  I'd buy another for backup.  So far, it's very reliable.","rating":5},{"id":"R92G106O8R72A","title":"Seriously buy this phone.","text":"This is my first android device on the road to the Oneplus3. Detract what you will as I'm a first time user, but this phone is slick. I see a lot of weird reviews with some odd complaints, but I can only think of a few cons, so let me get them out of the way.Cons:1. Simcard slots - these pins are VERY sensitive. Don' be like me and accidentally bend one because it's not bending back. I attribute this mostly to user error, but I wish they'd been tougher so I could have kept my micro sim.2. Battery charge speed - this phone charges slowly. I don't have an issue since I usually only charge my phone at night, but I know some people use apps (Pokemon Go folks) heavily and drain batteries quickly. I tested this with several racing games (Asphalt 8, Beach Buggy Blitz, NFS No Limits...I have a penchant for racing games) and I killed the battery to 0 in around 3 1/2 hours. Not bad. honestlyPros:Screen - The screen is some sort of Gorilla glass. Not sure if the gorilla's make it or it's made from gorilla's. It's tough. Stays clean and very fingerprint free. I'm an oily bastard, so I props. It also has curved edges that feel great on your thumb/finger when sliding etc. Yes please!Gaming capability - this plays all the games I enjoy (racing games) very well. Good frame rate and load times.Display - This thing is bright. I'd never think this was a 720p phone. It displays colors very vividly.Price - Can't be beatBottom line - THIS IS A GOOD PHONE. I would say this is the cheapest usable phone on the market. I'd be hard pressed to move on to a more powerful phone atm. This is exactly what I needed in my daily driver.","rating":5},{"id":"R337VLG15QIN3I","title":"Probably no better phone for the price","text":"Surprisingly good performance for the price. Screen is bright and crisp, very zippy when browsing the web or playing HD videos. The ads don't really bother me (yet), but knowing you can always upgrade I'd strongly recommend the ad version first. Even at $100, this would still be a good phone. At $50, it's a killer.To be honest, I don't like is the heavy handed 'BLU' on the front of the phone. I really wish they'd take their deign cues from Motorola. Simple face, brand the case. It seemed to me that the phone ran a tiny bit hot while playing Pokemon Go, but that's full brightness, GPS, Wifi and all 4 processor cores running, so it's understandable.","rating":4},{"id":"R1RGQ3RV54LMZ5","title":"Amazing phone with a few quirks, but still a phone to brag about.","text":"Wow, Just wow.  I have never come across a phone this cheap with the quality it has.  For 60 dollars this phone has blown phones at the 150 dollar range out of the water.  After having used the Phone for 2 days, I think I have my final thoughts on the device.Pros:Great construction - This phone has a metal shell that makes this phone feel very nice in your hands.  It makes you forget that this phone was even under 100 dollars.Perfect size - I thought that the 5\" display was going to be too small.  I was shocked when I received it as when I held it, it seemed to have been a perfect size.  It is not so small you can not tap anything accurately, but it is not so large you need to use one hand to hold it and another to tap the screen.Speedy OS - Using this phone feels immaculate.  No matter what I do or the workload given, it seems to be able to work smoothly without a hiccup.  Android OS 6 (Marshmallow) makes to phone look and feel modern and provides great speed when using the phone.Curved Screen - When I first saw this, I didn't think much of it as it just seemed unnecessary.  Boy was I wrong. The curved screen allows you to slide your finger off and on the screen smoothly.  This sounds simple but when you are sliding your finger off the sides all day and the sides are sharp edges, it is an unpleasant feeling on your fingers.  The glass is very good quality too, as it is Gorilla brand.  Having had phones in the past with Gorilla glass, these screens do not shatter or scratch without a fight.  It is a very resilient material and I am glad it is on this phone.Dual Sim Card slots - Now I do not use 2 sims cards, I only have the one personal number, however if you are a busy person who usually keeps 2 phones on you but would only like 1, this phone allows you to do that and also lets you choose what sim to use for certain things if you need to limit the capabilities of one.Camera - The camera isn't anything to be excited about but the pictures this phone takes are great for the price.  With a flash both in the front AND the back (some 600 dollar phones don't even have selfie flash) this phone shows that it cares about your picture taking experience.Cons:Slides too much - Whether you set it on the arm of the couch or on the sink you will be bound to find out that this phone loves to slide.  Any surface that is not flat will become a slip and slide.  This also is prevalent when holding the phone as it can slide out of your hand a bit too easy.  Luckily the phone has Gorilla glass.No Gyroscope - This probably sounds like an excuse to whine about the phone, but it can honestly be a hassle when wanting to use it for a few apps.  Since the apps I would use the gyroscope for really aren't all too important, I don't want to dock a star off it.Ads - Okay, so you know that if you get the phone with the offers and advertisements, you are going to have to deal with them.  This is technically a con BUT here's the thing.  These ads are not intrusive to your usage of the phone.  They only show up on the lock screen, where when you have no notifications it will appear on the whole screen, but if you have notifications, it reduces the ads to a notification size as well, which is very nice.  I feared that the lock screen wouldn't show notifications for this reason but they worked around that, so do not fear.Battery life - This phone can last a day on one charge, but you can't use it at all.  If you are an active user of your phone be prepared to charge your phone every 4 to 5 hours.  With the charge bank this can be solved, but alone this phone can not keep itself alive for very long.Overall, this phone is amazing.  There is no point in looking for another one if your budget is about 50 to 150 dollars.  This phone feels smooth and it works smooth.  It is unlocked so you can use it with any provider.  This is a phone to brag about to your friends, and in fact I have to mine since I have had it.  I am excited about this phone and I enjoy using it every day.","rating":5},{"id":"R2LKLLBPXOAJO5","title":"Build quality is very good. The screen is bright and clear","text":"This is the fourth BLU phone I have purchased, and they have improved with each phone.  Build quality is very good.  The screen is bright and clear.  The camera is good (better than what you would have expected).  The speaker is the only shortcoming I have seen (tinny and too soft) but I usually use headphones so not a deal breaker.As others have said, the ads are not distracting.  I am used to them on my Kindle.I use Metro PCS for the unlimited data and, so far,  it has been fast with no signal issues.You can't get a better phone at this price, or even at the $110 no ad price.","rating":5},{"id":"R1NSQ9BXU119BO","title":"Great Quality, Functional and Wonderful Phone for the Price!","text":"I am real surprised with the quality, display, software and most of all, price for this phone. It is unbeatable! I bought it to replace (my still working) Samsung Galaxy N-910A since I was tired of the performance and old software issues (flooded with bloatware) from Samsung and I am thinking that this was a nice temporary replacement (while the cost of the Note 7 lower on next year), besides I have 2 SIM Cards on it and everything is working perfectly, very good product!Update: The only feedback that I have at the moment is regarding the audio quality with headphones and calls. Its very average, so don't expect something great. The sound is like old Nexus 4 and 5 (No EQ, no surround, nothing!).Photo Quality: Average photos, but since the phone is already packed with a 8 MP Sensor even when the result is not great, if you use \"Pic Say Pro\", \"LR3\" or some other Photo Editing App to improve saturation, contrast and sharpness, at the end, you'll get a result such as new Samsung Devices.","rating":5}]