[{"id":"R3HWXWX3ZU1R4","title":"crazy awesome battery - phone works.  maybe the best, cheap phone!","text":"I'm 25% battery left, and I've got 4h39m screen on time!!!  on track for 5+ hours.  WTF!!!!  I switched, as a test, from my Nexus 6P.  it get's maybe 3hrs screen on time.  both phones are on Verizon.  I guess it makes sense; this phone is smaller res screen, and weaker processor, but wow.Overall this phone is great.  Yes, it does lag a bit (compared to my Nexus 6P).  When I view my open Chrome tabs it's like 2ftp lag, pretty bad. BUT IT WORKS.  $99.  The amazon stuff isn't bad at all.  basically this phone is vanilla Android 6.0.1 with some Amazon stuff installed.  Yes, there is a lock screen add, it's not bad at all.","rating":5},{"id":"R29Q05KOZZV0UY","title":"So far so good. Product seems to perform well","text":"So far so good. Product seems to perform well. The screen is very responsive and it downloads apps easily/quickly. It's very easy to transfer data from another android phone as well(ie. contacts). Connects with wifi easily and effortlessly, haven't had any issues with it dropping or disconnecting from it.However the packaging itself was a bit offsetting. The seal sticker for the phone box had dirt underneath the stick. The phone had finger print smudges on the phone screen protector sticker and there was odd bits and pieces of dirt/dust inside the phone box as well. While none of that affects the performance of the phone it was still odd to find that in a product that is supposed to be new.","rating":4},{"id":"RP7NB6R2QIN7D","title":"Let's Hope it's as good as Motorola's Past Phones.","text":"I bought this phone for a birthday gift for my daughter, to replace her Moto X (2014), which had a broken screen.Having had excellent experiences with both the original Moto G and the same Moto X mentioned above, expectations were high.So far, she loves it. It plays all her games, and she happily texts and Twitters her days away on it. The ads are, in her words \"annoying\" (but understandable, given the discount), but the phone works well, with little lag, and plenty of features for a teenager who often brutalizes her technology lol.","rating":4},{"id":"R2M8N9DXR69V4M","title":"Best for the money","text":"This has got to be the best phone on the market at this price point. I had an iPhone and this does everything it did and more. I like the Android operating system better anyway and since this phone has a slot for a micro SD card I was able to bump up the storage easily. I love how lightweight it is. Can barely notice it in my pocket at all. The back has a slightly rubbery texture that is great for getting it to stay where you put it. The high end phones today are way too expensive for what you get. This phone hits the price vs. feature mark perfectly.","rating":5},{"id":"RNOJSKT5DLLQK","title":"Rip up that contract!!!","text":"For the price you can't get a better phone! Now if you want to spend 6 or 7 hundred you'll obviously get one with the newest tech, but if you don't need all the bells and whistles then this is the phone for you! It does everything all the top end phones do (e.g. take pics, videos, texting and calling, navigation,app store) it just doesn't have a high end camera or the fastest processor! So I'm giving it 5 stars, not because its the best phone but because its the best phone at this price point!...Plus you don't have to have a contract!!! You can use this on Straight Talk, Net10, Total wireless, Verizon or AT&T etc. Just about any cellular service!","rating":5},{"id":"RV5A5RG0BIYK7","title":"A nice phone but it doesn't work right.","text":"UPDATE 03/01/17: Don't buy this phone if you plan to use the GPS capability. I've given up on getting this phone's GPS to work properly.Original review:I hope at some point I'll be able to update this review with a better rating, because there really are a lot of things I like about this phone. Unfortunately, there are some severe problems and it's not clear if I'll be able to get them resolved or not.First the pros - the price is good, and I was able to get a Verizon SIM card for free directly from Verizon to use it with my existing account. It's a nice compact size, takes pretty good pictures and has decent sound quality. The battery seems to last a long time.However, the GPS on this phone doesn't function well. I cannot use Google Maps or Waze with any reliability. The GPS signal keeps getting dropped. It's very annoying. I'm still working through possible solutions, but my gut tells me that this is a defect in this phone. (It doesn't help that the first phone I received, which I returned immediately for a replacement, had a broken cellular antenna and couldn't make or receive phone calls). Now I'm wondering if there is just really shoddy quality control on these phones. The other annoying things about this phone, that I didn't realize when I bought it, are that it doesn't have a compass (not a big deal for me since I don't do much that would need a compass), and it has no notification light. (So if you have the screen locked, and you miss an incoming text, you have no way of knowing about it unless you wake the phone up and look at the screen). I found an app on the app store that helps, but this is really a poor design.","rating":1},{"id":"R1CPYAS1K627NV","title":"Love this phone","text":"Love this phone. It's fast, it's got everything you need and most everything you might want and for this price you can't get better. The only things I have found that I don't like are the fact you can't use your own music for Ring tones just the pre loaded ones. Though that's fine I just like being able to assign ring tones to plp so I don't have to look at the caller ID to know who it is. Do really just me being lazy.Speaking of caller ID this phone gives you the name phone# and City and state they are calling from👍. This is really a great phone it changes based on your Patten of use. I recommend this phone for anyone.","rating":5},{"id":"R2MKM9JURJ2190","title":"Best bang for the buck!","text":"Can't beat the price for the device.  Just small enough to fit in your pocket.  I purchased the micro sd to expand the memory.  The ads don't bother me.  The device itself is working great.  Sound quality is excellent and I use it a lot for wireless communication.  Usual Android that you either like or don't.  Camera takes great pictures and the built in flashlight is wonderful.  I'm sure there are better, fancier phones but comparing price to features, this beats them hands down.","rating":5},{"id":"R3LF1V4Q8SZJ88","title":"Goldilocks Phone","text":"What do you need in a cell phone? And what don't you need? I needed a modern smartphone that I enjoy using and fits my personal needs. I do not need to carry around a fragile device that costs so much I worry all the time about dropping it or losing it. The positive reviews I read led me to think the 99$ Amazon Prime phone was very well worth a try. The negative reviews seemed mostly critical that you don't get everything in this phone that you will in an expensive one. So I tried it--- and it is perfect for my individual requirements- and then some.This is a dream phone for my modest needs: Unlocked, works on all carriers, uses up to a 128GB sdhc card (formatted as internal storage if you like, or the usual external card), excellent sound quality for the price, my favorite apps transferred easily, Audible books download smoothly, easy to set up, a perfect size, easy to hold and operate, great battery life, good screen quality--- everything I need and want.What makes this little miracle of modern technology possible is, of course, Amazon ads on the lock screen. Think very carefully how much you care about that. I bought this phone knowing my Prime membership was nearly up for the year-- and I wasn't going to renew it for now. I'd have the phone, but wouldn't be able to take advantage of Prime offers. It seems obvious in such a case to pay the extra 50$ and be done with it. I thought about it and decided I didn't mind that much. And I haven't, so far. One fast swipe and that's the end of it. For you, that 50$ might make all the difference between enjoying the phone, or not. For me, the ability to have everything I need in a phone for 99$ was too irresistible to pass up.I can even take it hiking in its rugged case without worrying about it. I needed that too.Update: March 14, 2017  Tracfone unable to activate BYOP on Verizon without prior account.I still very much like this phone: it works beautifully. But many hours of competent help on Tracfone's part were unable to activate cell service. And nothing is wrong. (Verizon works well in my location for everyone else, and has for many years.) And other people in other states have had the same problem: *BYOP + Moto G4 Play + Prepaid Tracfone minutes + new customer to Verizon* is a blocked combination. It is clearly a Verizon decision, made somewhere in the labyrinth of their ever-morphing rules and regulations.I bought this to use infrequently as need arose, when out and about. I have no intention of paying for a 45$ monthly service I will seldom use and can't afford. There will likely be a way at some point to finesse the ever-changing nightmare of cell phones and cell phone plans. Meanwhile, I read everything I can find, and am learning how very different people's experiences can be. What works for one person in one place doesn't work somewhere else. And things change all the time.My conclusion is: this phone is exactly what I wanted and I am keeping it. Sooner or later, I'll find a way to activate it.Meanwhile, it works fine with wi-fi, which I don't need it for.","rating":5},{"id":"R3Q61NPU5G6C2O","title":"needs 3 GB RAM for this design","text":"Most reviews here are written immediately after consumers received the phone. You really need heavy one month use or normal 3-4 month use to see a few of the possible problems. Normal apps started to crash on me, like Google Maps on heavy use. I never downloaded anything other than my Lyft program and used Maps extensively. Simple work phone.Expect blackout crashes. Phone will temporarily turn off and black out, for about three seconds when using certain apps.Near perfect phone were it not for insufficient RAM to breathe. Don't change anything. Just add +1GB RAM.","rating":4},{"id":"RZU2KXF9ND339","title":"Great value!","text":"Great phone for the money. Ads not intrusive.","rating":5},{"id":"R3PKUOYP7PK0AS","title":"Bought these for my parents and they loved them, had newer Samsung's that stopped working and ...","text":"Bought these for my parents and they loved them, had newer Samsung's that stopped working and they like these more","rating":5},{"id":"R3C4HXH4JL967G","title":"Very impressed - great value.","text":"Very impressed with quality of phone and all the prime goodies.","rating":5},{"id":"RTAA5DZDO6N0N","title":"Five Stars","text":"Great phone.  Great price.","rating":5},{"id":"R2UGVXASTX1BQZ","title":"No Compass and Generally a Poor Choice for Overseas Use","text":"This phone has a lot of positive features and is generally great value for money as other reviewers have stated. However, for overseas use (we live abroad in SE Asia) it is an absolutely terrible choice. TL:DL I recommend the BLU amazon phone over this one if you're looking for a cheap Android setup. Here is why I knocked off three stars:1) No magnetometer/compass  - this may seem like a small issue, but when you have a poor GPS fix, it renders google driving navigation completely useless. The map doesn't shoe which way the vehicle is pointing and thus you cannot see the upcoming turns on the map and voice navigation cannot keep track of your location effectively.2) Poor GPS fix outside the US (and sometimes even within the US) - I have downloaded numerous GPS apps to analyze and to speed up the acquisition of satellites and after a lot of googling and reading up on Motorola support boards, I figured out that the GPS has a hard time connecting to Russian GLONASS satellites. These are more common outside the US and it generally took me 15-20 minutes to get a gps fix, and even after a lock was acquired, I only has accuracy between 300-500 meters. Generally, this phone is unusable for navigation.3) From day 1 I had constant issues with the SIM card and SD card slot. This is a poor setup, with a difficult to reach stacked design and eventually  both the SD and SIM card slots stopped recognizing anything I would insert, even after changing SIM cards multiple times. I had to return the phone today because of this. I'm willing to write off this issue as a manufacturing defect, but the other two issues above are extremely well documented online and plague this model in the US as well.Even though the phone is snappy and well generally well-designed, its inability to effectively run navigation software earns it a measly two stars.2)","rating":2},{"id":"R1I1KXII2Z9VGI","title":"Great Phone","text":"This phone is the best. It lasts three days without a charge.  Easy to use...","rating":5},{"id":"R3FVT22ORQW0B3","title":"Five Stars","text":"fun and functional","rating":5},{"id":"R3KKYBHKL0HUQJ","title":"Best phone","text":"Best value phone, excellent camera, speed for normal apps very good, very bright good screen, sharp images, I am very happy. Saved lot of money.","rating":5},{"id":"R2MN1WK2OS701C","title":"Five Stars","text":"100% recommended","rating":5},{"id":"R1IO658HE4UDIU","title":"Five Stars","text":"AMAZING budget phone","rating":5},{"id":"RIXLQJT0E2DO8","title":"Very nice easy to use unlocked phone at a great price","text":"Very nice easy to use unlocked phone at a great price. The ads do not interfere at all. The phone is well built and every bit as good as a more expensive Samsung or iPhone.","rating":5},{"id":"R2R8OL63N0Q3G2","title":"Five Stars","text":"So far it seems to be pretty good.","rating":5},{"id":"RTVGBI0YCRMZR","title":"A good phone for a young person or an elder person ...","text":"A good phone for a young person or an elder person who doesn't want or need all the bells and whistles.  Definitely limited as to functions, but works well enough for the casual user.","rating":3},{"id":"R1L42UY6JNUYBL","title":"very good basic smartphone","text":"unlockable bootloader (if you get the ad-free version) .. has support for Cyanogenmod (although the stock rom is very vanilla and free of carrier crapware) .. very good basic smartphone. Also has a removable and replaceable battery (which is rare to find these days).","rating":5},{"id":"R150QCW1K5ZRM0","title":"Moto G Play is a real gem!!!!","text":"Best budget phone available, yet it does everything I need it to do.  Display is great, plenty of ROM and I've had zero problems with it.  The Amazon ads are unobtrusive and I hardly even notice them.  This is a GREAT phone.","rating":5},{"id":"R1WYDKCU440U3H","title":"Great for the money.","text":"You really get a lot for your money with this phone! It's fast, good resolution, sufficient storage and just the right size. My only complaint about it is that any audio files (e.g. mp3) you load or download to it pause randomly during playback. Mp4 files (video & audio) play fine, but for some reason it has a very hard time playing mp3's.  I got the version with the Amazon ads, and I don't think they're bad at all; a quick swipe when you unlock your phone is all you have to do to get rid of it.","rating":5},{"id":"RJJFETKPAYBOI","title":"The best phone I've ever owned","text":"A shockingly excellent phone for the price.","rating":5},{"id":"R2YFD92SFIERDP","title":"I don't know if its my carrier, but the ...","text":"I don't know if its my carrier, but the phone calls were dropping constantly after 1-2 minutes of talk. I did some tests and adjustments, but decided to just buy another cellphone altogether.","rating":1},{"id":"RHDEQHKQLJCGY","title":"Moto G4 Play","text":"Always loved Moto products. These are great phones with almost stock Android experience. Overall great budget phone, but do not wait big productivity from it. It is ok for daily tasks.","rating":5},{"id":"R31AKMQSSA3KUQ","title":"Superb Phone","text":"Bought it for Father-in-law. He isnt a geek but this serves a purpose and amazes the quality of product we get for the price","rating":5},{"id":"R16SSSEMA2DMUE","title":"BEST SMARTPHONE EVER!","text":"Probably one of the BEST Smartphones I have ever owned!  Very easy to use, Excellent EVERYTHING especially the battery!  It lasts forever!  Love Motorola brand and this one does NOT disappoint!  Excellent price too!","rating":5},{"id":"R2JABGAPFVTCWI","title":"Works great with my FreedomPop LTE and Global SIMs.","text":"Works great with my FreedomPop LTE and Global SIMs. I really like the phone. Sharp screen, fast processor, Droid 6.1. I went with the no ads version. Battery life is great, especially after tweaking. Highly recommended.","rating":5},{"id":"R3JIG3WWY2IH7J","title":"which was nice but much slower response on apps","text":"This is for my wife. She loves the phone. Replaced a Tracfone LG Ultimate, which was nice but much slower response on apps. Worked perfectly with Tracfone's BYOP program. It would be perfect if it were a 5.2 inch screen. But for $100, no complaints. We got a microSD card for extra storage.","rating":5},{"id":"RCKK6OEG17WED","title":"Better than Expected - Great Phone!","text":"Wow, even better then I expected.  I received mine a few days ago.  Popped in the battery and it came right on.  First screen displayed is a language screen.  It was a bit disconcerting, cause when I tapped on English, it didn't respond.  So I slid it sideways then realized that it was already set to English.I spent some time setting it up the way I wanted. I started the WiFi link first.  It was the right move because there were updates, a bunch of them.  I compared it to my old phone, an LG Destiny, and I can say, this one is so much better.  First off, it's integrated with Amazon Prime, so you automatically get all your favorite Amazon Apps.  Kindle Reader, Video, Music, photos, they are all on your phone.  As for them taking up much room, well the Operating system took up 6.1gb leaving over 9+gb free.  Not bad, especially when that 6.1 includes all the other apps I installed, like my Norton products.After that I input my old SIM card and the phone worked immediately.  I was surprised at that, I thought my carrier would sense a new phone.  But just putting in the SIM gave me the ability to call and receive texts right away.  I thought for sure they'd shut me down, so I went online and purchased a new SIM for my carrier.  Two days later. I insert it and while on my account on my laptop, tried to switch my service.  It didn't work - I had to call them and together, we did the switch.  They said it might take a few hours, but it was more or less immediate.I'm still fooling with the settings.  It has Smart Lock, and it's supposed to enable you to have the phone always unlocked when I'm home, and can even unlock using Facial Recognition.  Cool, huh?  If I can get it to work..As for Amazon Ads, well sometimes one will show on the Lock Screen.  Then on the second page there's a box with Today's Deals.  That's it!  I can certainly live with that.Oh, I do suggest visiting their website for full instructions.  There are Help Screens on the phone, but they're a bit lacking.Right now, I'm loving this new phone and it's clear, crisp screen.","rating":5},{"id":"RDUTB08QL5MK8","title":"great phone","text":"I purchased for my wife and it is the perfect phone for her.  It's not too big, it's responsive, takes good pictures, and because I bought it from amazon it has all of the apps on it so she can enjoy the benefits we get from being prime members.","rating":5},{"id":"R2PFYPVYRS8AG1","title":"Very good deal for the price","text":"I can use it read ebooks and the phone is clear.  Took a little while to get used to the Android operation system, but then again I haven't been using mobile phones at all for very long.  Very good deal for the price.","rating":4},{"id":"R1LGDK4A1EHPMV","title":"Was a perfect price and works great","text":"Replacement for a Samsung Galaxy 3. Was a perfect price and works great. Didn't want/need a flagship type phone like Samsung Galaxy 7 or iPhone 7 and not interested in paying top dollar to chase latest tech. Smooth operation, migration to new phone was simple. Very pleased with this purchase. May even purchase another one.","rating":5},{"id":"R1MXTCQF1IZJS8","title":"Excellent phone! No matter I bought it for my ...","text":"Excellent phone! No matter I bought it for my 69 year old father, who is not skilled in new technologies, he has adapted very fast and the phone and the applications are working very well.","rating":5},{"id":"RMXNJKYOPA3SC","title":"Awesome budget phone","text":"Got this to use as a WiFi phone, so I haven't used it on our Verizon network yet, but will make a great backup if needed. A whole lot of phone for the price. Amazon ad on the lock screen is barely noticeable and does not affect usage at all. Recommend","rating":5},{"id":"RSEHS8T7E2KHL","title":"Great so far.","text":"My first smartphone - late bloomer.  Only had it a month so far and I love it.  Not too big or too small.  I don't watch tv or game on my phone so I have no problems with the op system.  Has more than enough bells and whistles for me.  Hope it lasts as long as my old Razr V3.","rating":5},{"id":"R19NX729QWN1ZO","title":"So far it is working good. The Ads on lock screen is not something ...","text":"Moved from samsung S5 to moto g some things I miss that were already present in Galaxy phone but in Moto g4 had to download the app for it. So far it is working good. The Ads on lock screen is not something I like. I ignore it but it being there bothers me.","rating":4},{"id":"R2D9TLR8VLJ6PC","title":"Does the basics well, low frustration.","text":"The wife's new phone. Has a lot of memory, works fast, and the display is great. She gets aggravated when things don't work, and this phone keeps her blood pressure down. She doesn't use it to do crazy stuff. Pictures - the camera works fine (a little delay in the shutter), texts, and calls is about all she asks for. This unit does a whole lot more, but makes sure to do the basics well. And the price was right. Would buy another.","rating":5},{"id":"R2MVXB79IFU2C2","title":"Very happy with this phone bought for my 12-year old grandson","text":"Very happy with this phone bought for my 12-year old grandson.  Battery life between charges is superior to that of my more expensive Samsung smartphone.  It was a great buy for the intended purpose....which was to get my grandson to actually carry his phone with him all the time and use it for its intended purpose (way to communicate with him when away from home), not just for watching YouTube or playing  games on the road.","rating":5},{"id":"R370R4X19BGUN2","title":"Good, basic phone.","text":"I love not stressing out over losing an $800+ smart phone! This does what I need, and seems like a really fast processor. Two things to know that are not included (but aren't deal-breakers for me) are no internal compass, so the star-tracker app won't work except in manual mode. The second is no NFC transmitter, so Android Pay won't work. This will actually save me a lot of money over the new few years! Waving your phone at a vending machine or checkout register is an easy way to go broke.","rating":4},{"id":"R7G6JQ7LGOS8X","title":"Great Basic Phone","text":"Excellent basic phone. Does everything that I need it to do. It's not as customizable as my old galaxy but it is also about $500 cheaper. And the expensive phones break just as easily. I will never spend big money on another phone. Thank you Amazon for offering this phone at such a great price","rating":5},{"id":"R2438VF972QCIU","title":"Great phone for the price","text":"Great phone for the price. The screen is kind of dim compare to the Blu R1 HD. However, this being Motorole, you do get better support on the firmware and software side. In addition, this phone is both GSM and CDMA compatible, unlike the R1, which is only usable on GSM networks (AT&T and T-Mobile).  I purchased this phone to use on RingPlus (Sprint MVNO) and it worked as promised. Overall, you get a decent phone for the price.","rating":4},{"id":"R3T5UO58Z73QB5","title":"I doubt there is a better value on the market","text":"Only a snob would give this less than 5 stars.  I doubt there is a better value on the market.","rating":5},{"id":"R3QTHGZG3HW6YJ","title":"Awesome, I am so happy to find this new phone at a great price!!!!","text":"This is a great price for an Android phone. I bought this for my 12 year old son to replace his Samsung S5 when he cracked the screen.This is a nice phone and ideal price for a new phone that does what we need it to do. The ads are on the front screen and are not obtrusive and he still can use with no problems. I bought this to use for an existing Sprint line and purchased with the SIM activation kit.","rating":5},{"id":"R36BXGEV6F80HA","title":"Perfectly Good Phone...Ads and All","text":"Thus far, all is well with this phone....or as I call them - little computers with a phone inside. I'm just retiring from the computer tech business, so I'll leave all the tech talk to others...I'm tired of it. As a user, this Moto does all I want. Sound, signal, video, all good. I installed a Mr. Shield Glass Screen Protector and get perfectly good response from the screen. (PS - the glass installed perfectly!)The Bluetooth connected easily with my ear-piece, my Anker speaker and with my car.Of course, being an Android phone, it is also geared toward Google. If you don't like the Google connection, then just sign out of your account on your phone, which is what I did.I bought the phone version with the Amazon ads. As I have a Kindle with the same ad deal, I am used to it and it doesn't bother me at all. If you think you won't want to see an ad as you sign into your phone...then pay the additional $50 and get the ad-free version. Don't moan and groan about the ads and try figure out how to get rid of them after the fact.","rating":5},{"id":"R1G5PK1HF1C56L","title":"which is great. It backs up everything","text":"I was very skeptical of a new phone for only $99. However the Moto G Play has absolutely delivered.I was a Samsung/Android guy for years. When my last Galaxy 4 broke, I was none to impressed with the Galaxy 5. Since all the battery issues and all with the Galaxy Note 7 (and they won't even allow that on a plane.) I took a shot on this one. I must say it stacks up to the Galaxy 4/5 very well. The only drawback for me was that the Samsung Photos app is not there, but it comes with Google Photo, which is great. It backs up everything. The pictures appear to be better quality. The display is brilliant. The performance is excellent. I have definitely had more issues with the Samsung, with apps crashing, and the phone restarting. This never does that, and only the big fish casino app occasionally sputters on open.I would absolutely buy this phone again, and have enthusiastically recommended it for some of my friends who bristle at the price of a new Samsung or Apple which can go for 5, 6, 7 TIMES as much.Say goodbey to them, and say hello to Moto.","rating":5},{"id":"R20XZXND08LRLZ","title":"You can't beat this one!","text":"Great phone! Simple straight foreward non redundant settings menu. No bloatware or adds. Perfect size & thank you removable battery!!!  I kina like to see a battery that swells up due to either over charging or bad knock offs before it explodes or catches fire!!  A few of my Nokia & Samsung S5 batteries did this over the years warning me of needed replacements, so no fires. No processor lag for me and camera is fine enough for most of us. You have about 11GB free internal memory.  I ditched my Samsung S5 because of AT&T OTA branded updates back in Aug locking my phone up & wiping the data. I only miss the outstanding 16 MB photos & on the fly editing of the S5. The Moto G4 play with removable battery, GSM + CDMA carrier capabilities for the money is hands down the best one out there. Most newer phones have screens too large. This one is perfect!  I am not a super gamer & I have not tried a CDMA carrier yet. With Consumer Cellular, just install your old sim, works great! Thanks Amazon!","rating":5},{"id":"RKTSETMT8QKXZ","title":"Dont buy unless you want to buy a new phone in 6 months!","text":"Had to buy this after my fire phone decided it was going to do and never return.. have straight talk.bought the galaxy s4 but didn't like it at all way slower than my fire... hard to get used to. This was cheaper and newer so I figured it would be faster which it really is.. like that I can expand the memory. Has everything I need except my pics that are stuck on my fire... great deal for straight talk better than any you'll find at the mart..Update: I have on this phone for less than 6 months and the speaker died. I can barely hear anyone have to press hard against my here and have the speakerphone on period and the ringer does not work anymore. Piece of junk and no warranty","rating":1},{"id":"R2UJEPE3WQBEMF","title":"Great phone for the price!","text":"Bought this for my 12 year old son who's gone through three phones already. We needed a cheaper alternative, and I was happy to find this on Amazon. We purchased the version with ads, and they're not intrusive at all. I slapped in a 32GB MicroSD along with the 3 in 1 SIM card from Sprint, and we're good to go.Just some pointers on activation for Sprint users... Call Sprint, give them the SIM card ID, along with the MEID from the phone listed on the box. When you turn the phone on to activate it, skip the \"self activation\" mode during setup. The phone will present you a warning saying you have to set it up via settings, accept it and move on. Input your gmail and get the phone up and running. The self activation will sit for 10-15 minutes trying to find the network... it takes forever. To activate the phone once it's setup, go to settings, click \"more\" and then \"carrier networks\" and select \"update PRL\". You should receive a \"PRL Updated\" message, and then you should be up and running. Send a test text, and try a phone call. Test out your data, etc...I did this all while on the phone with Sprint, and it took about 15 minutes total. Pretty painless process, and it works flawlessly. Hope this helps some of you.","rating":4},{"id":"RAEDJSHC2A4IE","title":"Excellent phone for casual user!","text":"Writing review after 2 days of ownership, switched from Galaxy S6.This phone is awesome for me! I don't use a lot of the bells and whistles on flagship phones...don't use gyroscope (phone locked in portrait), don't use NFC/Android Pay, don't use compass, etc, etc. I mostly want the phone for email/text/calling, Maps/GPS, Lyft/Uber, and camera. For all of these uses cases except camera, this phone is so far comparable to or better than the S6. In particular, when using the S6 with headphones the volume was always too loud for me, even on the lowest setting, so I never used them. With this phone, the volume is slightly lower and I can use the headphones as well, which is great for me. Camera is noticeable less good though. For the price, I'll take it.Update after a few more days: one problem with the phone is mediocre sound quality (e.g. when talking on the phone). This is unfortunate, and means I _need_ to use the headphones all the time. A core function of a phone is conversation, so I'm knocking a star off my review.","rating":4},{"id":"R12O8S355JSU1B","title":"Great international travel phone","text":"I've had the G4 Play for a few months. I just got back from two weeks on assignment in Ghana. I used the Moto G4 Play exclusively there for phone,text, and data. I purchased a Vodaphone (GSM) SIM and 800Mb of data for less than $8. Ghana only has HSPA+ (4G). But phone,Web, and email worked fine. I use Tello (Sprint-4GLTE) in this phone at home. This phone has all of the  frequencies. So you can use it with any carrier. It's perfect for international travel if you are purchasing a local SIM card. For photos I use the 16mp camera in my top of the line Samsung Note 4. Then I just transfer the best shots to the Moto G4 Play and post to Facebook, send home, whatever. The G4 Play camera is OK  for outdoor shots. But the Note 4 is much better. Google Maps worked well monitoring our travel to Volta Region near the Togo border. The map detail is not great in Ghana. But all of the roads, towns, and major features are there. With all of this use and the phone on 24/7 I only had to charge the battery twice in two weeks.  I use Nova Launcher on my G4 Play rather than the stock Android/Amazon launcher. This allows me to limit the Amazon ads to a single notification line on wakeup. The full ad screen is still there on phone startup. But I leave the phone on all of the time anyway. I have disabled all of the Amazon apps I didn't want. So I have a clean unlocked phone that works on all world frequencies for only $100. That was a deal.","rating":4},{"id":"R12EZPVMBU14II","title":"This phone definitely deserves five stars!","text":"I ordered this phone for my husband after his Samsung Galaxy was acting up and wow, what a great deal it is.  I will just cover in this review the reasons why he likes it so much --1)  It works great with Strava - the GPS on it in our area is very accurate, as accurate as his Garmin watch2)  The bluetooth connection for phone talk and music playing to a speaker is awesome3)  Battery life is absolutely wonderful.  He's been doing 32+ mile bike rides, listening to music and running Strava and comes back with a 89 to 92% battery4)  This phone did not come loaded with a ton of apps that you can't get ride of (probably why the battery life is so good)5)  My husband actually voice texted me!!!!So there you have it - this phone does everything that our much more expensive Samsung phones do, at a fraction of the price.  We are very happy with this purchase and I heartily recommend this phone for anybody that is on a budget, or just wants to spend less money for the same features everybody else is paying a lot more for.","rating":5},{"id":"R11NFAL2ZOU62Z","title":"One of the best unlocked phones you can buy on the market","text":"This is the best unlocked phone you can buy at the price hands down. It works on ALL carriers, I honestly can't think of a carrier it does not work on unless you get the Verizon exclusive version or something strange happens (that version does not work on all carriers), but if you buy the unlocked version you are good to go. This phone is one of the few phones out there that will accomodate both CDMA and GSM bands in one phone, so you can use this phone with sprint or sprint MVNO's, again its very hard to find a brand new phone that will work with a Sprint MVNO but this one works with them. I do think the phone is too large, however this seems to be one of the smaller phones you can buy these days. It does have a huge black area on the bottom that takes up a large part of the phone. Another AWESOME feature of this phone is it can adopt your SD card and use it as internal memory, that is right, the SD card acts the same as internal memory so you can install a large SD card and have plenty of space. No more being limited to 16GB for apps and no more stupid apps that won't install because you are out of room and they refuse to be allowed to install on your SD card, as we all know the software takes up space on the phone so you do not get the full 16GB for storage for yourself but with this SD card solution this is no longer an issue and you do not have to pay hundreds of dollars more for a phone with more internal memory, just put in a SD card of your desired size and follow the directions to allow the phone to adopt it. I used a 64GB SD card and this worked wonderfully, I still have 59GB of space left.This phone does not come with a sim card or sim card adapters so you will have to provide those yourself. This is not a dual sim phone, there is one sim card slot (micro sim I believe not nano sim) and one SD card slot. The slots are under the battery cover, not a tray on the side off the phone. This phone also has a removable battery. There is almost no bloatware on this phone.I wouldn't even call this a budget phone, it runs everything I need it to run, so I don't really consider it budget, for your average user this phone will be more than enough phone for 90% of the smartphone using population. It does run Pokemon Go, no issues with that app.The only con I can say is the motorola migrate app no longer works with this phone, so you are going to have a hard time transferring your data from your old phone to this one, I have barely any contacts or data so this was not an issue. For some reason google didn't pick up my contacts list when transferring and I had to re-enter all my contacts by hand, but with less than 10 contacts this was no issue. My conversations also didn't come over but again its not an issue for me.","rating":5},{"id":"R2BYVSF9ZVKXH7","title":"Beware of the GPS!","text":"Update 1/27/2017. I have the new phone and it's just as bad. Phone is set to high accuracy.  If I had to rely on the GPS to find my way around I would get hopelessly lost. Two days ago I was on the local Interstate and for several miles the GPS placed me everywhere BUT the interstate. It kept placing me on roads several hundred feet away with constant directions on how to turn to get on the interstate. This was for both sides of the interstate. I have been at intersections waiting for the light to change and the GPS said I was 0.2 miles away. Over 1000 feet off.Yesterday it couldn't get a GPS signal for over 10 miles.I often have times where I'm sitting at at intersection waiting on the light to change and the phone keeps jumping my location. To several blocks away, randomly.It also often doesn't know which way I am facing. I've had the display frequently rotate clockwise and counter-clockwise while it tries to figure out where I am. I'm often not even moving when this happens.My wife has my old Moto G (1st generation) and we have observed that there is also a problem with the wi-fi. Where she has a rock steady connection mine would consistently lose it.----------------------------------------------------------------------------------------------------I purchased this phone three months ago. After the first month I am constantly having problems with the GPS. I have my phone set to \"High Accuracy\" but it is constantly losing the GPS connection. When it is connected to GPS it randomly works, but at other times it's is jumping all over the place. To several blocks away from me and constantly trying to reroute me even though I haven't left the street I am on. I have seen it be up to 1000 foot off many times, but yesterday it was several miles off. My job requires a lot of driving to different places so this is very annoying. I had a Moto G1 and it's GPS was excellent, so I expected no different from the G4.Yesterday broke the camels back though. It stopped recharging. I tried several chargers and only one worked if you held your tongue the right way while crossing your fingers. I contacted Amazon customer service and they are sending me out a replacement. I hope the new one is better.","rating":1},{"id":"R2KATCEQ25WGU1","title":"OK Galaxy Replacement","text":"Just can't justify a $700+ phone anymore .Phone, text, and web, all work and generally feel brisk.Disappointing Bluetooth performance, similar to experience with previous iPhones. Drops about 1 of 5 calls, static heard on other side on 2 of 5 calls.A fews days into use and the phone does slow/freeze up from time to time, but seems to run smooth all other times. No physical button for back (used to a Galaxy) is annoying, especially when/if freezing up.Minus 1 star for poor bluetooth, minus another for spotty performance issues, minus one more for the user accessible OEM battery not for sale separately. Ie: You cannot buy an extra battery for this phone, even though it is user accessible.","rating":2},{"id":"R16858FMM1YN0J","title":"Great price. Better phone.","text":"This is a fantastic phone for the price. It is just like older Google Nexus', being an unlocked, barebones Android phone with no stupid extra apps like T-Mobile Contacts or Samsung App Store (don't get me started). Useful size and large screen, but not an excessively large phone. I previously had a slightly more expensive Samsung Galaxy Prime Core, which was terrible, and this phone is BETTER IN EVERY WAY. More internal storage at 16g, clearer and larger screen, faster processor (i.e. apps open and run at an actually usable speed), surprisingly great cameras, and personally I like the UI of simple Android much better than Apple, Samsung, etc.I highly recommend this phone for anyone with a lower budget, as well as anyone who just wants a well-made, modern Android smartphone that is still simple and useful and fast.","rating":5},{"id":"R3QTHGZG3HW6YJ","title":"Awesome, I am so happy to find this new phone at a great price!!!!","text":"This is a great price for an Android phone. I bought this for my 12 year old son to replace his Samsung S5 when he cracked the screen.This is a nice phone and ideal price for a new phone that does what we need it to do. The ads are on the front screen and are not obtrusive and he still can use with no problems. I bought this to use for an existing Sprint line and purchased with the SIM activation kit.","rating":5},{"id":"R1RJ8FQ7L3KF8X","title":"Dont buy the one with the ads....","text":"Awesome phone, and the ads go away like everyone says... I had a $600.00 phone that quit on me after less than 2 years so this was a steal at 100.00 and doesn't tie you down to a specific provider. I'll update as things continue to go great or starts to fail (fingers crossed).Update... I lowered the stars down to two because the extra. 50 dollars would be worth noth having the ads hard coded on the phone... If you try to take them off you run the risk of corrupting the OS. The security of your personal data is also something that worries me. Bottom line if you can spend and extra 50 dollars a phone without the extra unwanted features then do it.","rating":2},{"id":"R6BVP2GECN0EO","title":"Straight talk Verizon, YES!","text":"Great phone for a great cost if you're a prime member. I have straight talk service and needed a phone that works using Verizon towers for the area that I'm in. Had had to talk to customer service and give them the serial number and have a bring your own device sim for Verizon phones and it works beautifully!","rating":5},{"id":"R2DHX0KVEBUB95","title":"Right now I would never buy any other phone","text":"Never had an iPhone or any other expensive model, but I can't imagine they would be any better than this. The only quibble is having to download a file program so I can individualize ringtones, but other than that I've found nothing to complain about here, especially the price.","rating":5},{"id":"RHXOV6TTRUYXG","title":"Great value, republic wireless compatible","text":"*update*  The phone is bent.  Carried in my pocket, not sure how it would have happened.  There is a slight bow to the phone now.  Still works great though.I would highly recommend getting the ad free version (I hear the ad version is annoying).  4 weeks of use, no problems whatsoever.  Great battery life.  Here are my experiences so far:This phone is:Compatible with Republic wirelessPowerful enough to run most appsA great (really super great) valuea solid stable piece of hardwarea good sizeThis phone is not:a flagship phonea status symbolIf you want a highly functional piece of hardware that works with sprint networks, there is no better option.  Go for it if you are looking for a republic wireless compatible phone.","rating":3},{"id":"R3I4SYXA6F1PVA","title":"This is a very solid phone. I sold my ...","text":"This is a very solid phone.  I sold my iPhone 7 Plus due to financial constraints and use this as a replacement.  It's inferior in a few ways: no 5GHZ Wifi, not Apple, processor/RAM lag when running many apps or resource hogs, camera, & screen; however, it holds up to iPhone 6 on all but the Apple component of those deficiencies.I will stress that you should buy the Amazon version, the ads are not noticeable.  However, there may be an issue when it's time to update the device because the Android software will need to be Amazonized before it's rolled out.  Also, make sure you setup the phone with your Amazon ID because adding it later will cause issues registering the Motorola ID.  That being said, for $100, there is not another phone that brings an experience close to this one.  In fact, you must spend at least twice as much to get an equivalent competitor.I'm impressed.","rating":5},{"id":"R1HJKO7FYBH7E9","title":"Happy Customer!","text":"My first \"fancy\" phone. My adult kids were after me to get rid of my old embarrassing slider phone but I refused to pay those crazy prices for the IPhones. I found this online. Great quality and for less than $100, I have a super phone. Voice is clear, design is good. It's pretty easy for even me to learn on my own. The users \"manual\" is tiny, but lots of free info online that I've taken advantage of. Now the pictures of my grandson being sent to me are clear and big! Happy about that. And now we can finally do \"facetime\". Very happy about this purchase. My husband is going to upgrade to this too from his old flip phone. So there will be two happy customers. Thanks!","rating":5},{"id":"R3S58MR5DH4MWW","title":"BEST PHONE I'VE HAD IN A LONG TIME!!!!","text":"This is the best phone I have had in a long time!!!!  I've been a Samsung user for about 3 years, and when I upgraded to the Galaxy S7, I quickly became very disappointed.  The battery life of the S7 was poor, to say the least.  I was skeptical about trying a new phone, but I'm so glad I did.  The battery life of the Moto G Play is AWESOME, and the phone is fast and efficient.  VERY SATISFIED CUSTOMER!!!!!","rating":5},{"id":"R1KJ95GBSN783S","title":"WOW!  What a great deal!","text":"I have had this phone now for two months and love it.  It does everything that I want a smart phone to do for a fraction of the price of the top dogs.  I have used Straight Talk as my provider for several years and linking this phone to their service was super easy.  It works very well as a telephone with clear voice and maintains good signal.  At times it takes a few seconds to launch an app, but for the price I can wait.  Photo quality is quite good.","rating":5},{"id":"R2Q00L25G77RSN","title":"Solid phone - compact, fast and effective","text":"Bought it so we could use it as a music player so we could play lullabys and rhymes for my 2 year old. Love it so far.In the future I would turn it into a phone if one of our phones go bad or we need a guest cell phone for family visiting from overseas. Well designed phone, compact, fast and crisp. Highly recommend.","rating":5},{"id":"R2JN7ZBA7RAK","title":"This is the only phone I ever owned that acted like this. How much can a compass and decent ...","text":"The phone itself is ok, but it has 3 MAJOR issues:1.  Cannot maintain a GPS connection - it drops every few minutes2.  No digital compass  - when trying to use navigation it has no idea what direction you are pointing3.  Too much Amazon bloatware takes up too much space leaving little room left for your own appsThese 2 issues make the phone unusable as a navigation device.  When using it on the freeway, going in the direction I wanted, it kept telling me to make u-turns, make a left, etc!  It's actually dangerous in this regard - it could get you lost.  This is the only phone I ever owned that acted like this.  How much can a compass and decent GPS sensor cost?If you want a good phone at a lower price, do yourself a favor and get the Honor 5x (or something along those lines).  It's very much worth the extra $70 or so.  This phone is now sitting in my drawer to be used only as a backup in case my other one breaks.","rating":2},{"id":"RTYQ2VG3CRE0I","title":"Four Stars","text":"OK for the price","rating":4},{"id":"R19I7YKL7HXCOP","title":"good phone","text":"Comment on some of my impressions of this phone \"moto g4 play\" at first, because it is for a gift. While at the same time I attached a video of a small untarred to enjoy, as is this version of amazon.This \"moto g4 play\" I consider it a nice Smartphone that if, is virtually the same design \"moto G4\" does not change almost nothing. It has good finish, has good grip texture that has the back gives good feeling, all very well for that part.Screen: The screen is HD I like a lot to pay the price range of $ 99 looks very good, very acceptable can be much better of course but would have to touch the price point and would enter debate.Fluidity: firsthand note that the phone moves very well, the steps between applications multitasking was good and worked well. Of course at this point plays a major overhaul to give more details.Camera: the camera did some tests only during the day. And I can say it is a great advance when compared with the \"moto e and the 2nd\". Leave a sample taken with the \"moto g4 play\".This is all that I can so far this good device.5 stars because I really liked!Photo con moto g4 Play!","rating":5},{"id":"R3ICIGC3JPFAOD","title":"Good phone, but GPS may lag","text":"Good phone. Especially for the price. I had a Moto X as my last phone and it lasted at least over 3 years; which is why I gave this one a shot. I also had no interest in buying a new one or paying monthly via Verizon. I'm not a power user. I check social apps, read articles, watch videos, stream Pandora; that's about it. The battery easily lasts two days (the battery is awesome). My only issue is that the GPS lags at times (even on high accuracy). Apparently it's a known issue with the G4 Play. I'm hoping it gets fixed when Nougat is released for the G4 Play (apparently it's already out in India). If that doesn't work I may try to replace the GPS antenna as it's easily located when you pop open the case. If you're a power user for direction apps like Waze, you may want to reconsider.","rating":3},{"id":"R3V6RUX0LBF9VA","title":"Major WIFI problems","text":"Something is seriously wrong with the wifi functionality of the G4 play. It often loses connectivity, or won't find the SSID. At least once a day it disconnects from the router, and the only way to get it working again is to hard reset the phone and power cycle the router. I have no issues with a dozen or so other devices. No response yet from Lenovo support.","rating":1},{"id":"R58UEYCFZ9MPE","title":"Five Stars","text":"My father/grandfather loves this fone! Thanks for everything!!!","rating":5},{"id":"RIY2WMYOWMEEV","title":"It's OK","text":"I have Verizon and have been using this phone for several months now.  The ads don't bother me, and I thought that they would.  The battery does last nice and long, just like they promise.  The only thing I don't like is that it doesn't seem to have much storage space.  I am not one who has very many apps, but I had to delete some because the phone would not update unless I did.  But for the money, I guess it's OK.","rating":3},{"id":"ROZL6BXAO1MGT","title":"motorola is great","text":"great phone and great price love it love it","rating":5},{"id":"R34NW7QCR4XOBK","title":"Five Stars","text":"Great phone love all the fetures","rating":5},{"id":"R256I5JJ0VSRPO","title":"Five Stars","text":"I have had mine a few months and have had no issues.","rating":5},{"id":"R13WF777SSRM82","title":"Great value from amazon","text":"Given as a gift and works great.  Processor is fast and screen resolution is good.  This is an excellent priced phone for the person who uses it to talk and text and some occasional time passing games.  The camera is more than adequate.  Really have no complaints with phone.  Will update later if changes in performance happy.BTW-the ads/offers are not a hassle(a worry from the recipient until they started using the phone).  They are only on the lock screen.","rating":5},{"id":"R7M8BUWK9U75G","title":"Great budget phone.","text":"This phone is shockingly good. When the Note 7 was recalled I decided to get this phone while I waited for the Pixel to become available.  This phone has less lag than I was seeing on my \"top tier\" note 7 due to its unmolested software and operating system.The good:- Speedy, lag is rare if it ever occurs- Decent screen size- Battery life is very good- SD card support for added storage- Near stock android experience- The amazon ads are actually not bad at all, you almost dont ever notice them. But you can pay the extra 50 bucks to get them off the phone if you wish.- Gorilla Glass 3, screen protector not needed for this phoneThe \"meh\":- Camera is just meh, but at 100 dollars what can you expect?- 720p screen is just ok. But it works and is battery friendly.- Plastic and cheap feel to the phone, make sure to slap a case on it.- Very little internal storage. Looking at about 9GB that the OS isnt using, so you'll need an SD card.To sum it up this is a very good budget phone that can be used as a backup or temporary phone for someone waiting on the perfect \"top tier\" phone to come along. However, if you are not a smart phone power user, this might be a good option for you. It can fit a lot of needs that the same expensive top tier phones are.- Plastic and cheap feel to the phone, make sure you slap a case on it","rating":5},{"id":"RJJFETKPAYBOI","title":"The best phone I've ever owned","text":"A shockingly excellent phone for the price.","rating":5},{"id":"R2MN9NLG10ZK3","title":"great phone even if the price was higher","text":"great phone even if the price was higher. The ads are present only before you log-in, which we were very happy about. The \"play\" version I believe is the smaller version, but it is not small and works wonderfully for my daughter who uses her phone for research at school.","rating":5},{"id":"R30RZ12VI4SN5Q","title":"Excellent Value","text":"Excellent buy, excellent value. For this price, you get an Android smartphone (almost pure Android, no bloat) with all of the essential features. The UI is nice and responsive, the screen looks nice for a 720p, the battery life is excellent, and the SD slot is handy for extra storage. I did have to go to Verizon to get a microSIM since my old phone had a nanoSIM. Also, I recommend getting a screen protector (I bought a nice tempered glass one for $8 on Amazon as well) to keep the screen safe -- I'm not sure what type of glass is used on this phone. Overall, I've been pleasantly surprised by how well this phone works despite the low price.","rating":5},{"id":"R12BD4NOVBPQHA","title":"Great Phone","text":"I bought it for my mother. The reason why i chose the moto g4 is because i had a Moto G 1 XT1032 and it worked pretty well for 2years.The only thing i dislike is the amount of ads that keeps popping up. I can remove it by installing the clean o.s. but well...too lazy for that lel","rating":4},{"id":"R11TVQZ25FMUR2","title":"Great phone for a great price","text":"excellent phone, everything works as it should. I bought this to replace moto g 3rd generation which is still working great, but with only 8 gb it really sucked for storage...not many apps. I am not an app hog but 8 gb was way to little. This moto g play is an excellent price. I don't need the fanciest, most awesome phone ever and pay $600. Amazingly, this new phone did not change my life in any way...maybe $600 phone would transform my life!","rating":5},{"id":"R143F90AUH7ZYL","title":"Best phone I've had so far-- not saying much, but I'm still very impressed","text":"I really like this phone. I insist on paying around $100 for my phones, so this one barely squeezed in, but it's way better than the horrible LG Leon it replaced. It is fast, it is comfortable, it is much more intuitive than the LG, and it has a much clearer image and responsive screen. Most important for me is that the autocorrect/autofill is as good as I've had. The LG's was so maddening (type in \"tomorr\" and it still won't guess where you're heading with that word) that anything would have been better, but this one learns my names and places and other nouns and fills them in well.Note: The Amazon ads thing is nothing. The ads disappear with the same swipe you'd have to do to fire up the phone anyway.","rating":5},{"id":"R2OULY9PR7QC5P","title":"Great budget phone.","text":"Love this phone-for the money it's great.  One thing that I miss is that it does not connect to wifi on the 5GHz spectrum (it works nicely with 2.4GHz). So it is not \"dual band\". The Amazon ads are not obtrusive.Battery life is outstanding. I play music, use navigational aps, text a moderate amount and use web apps all day and usually have over 65% left. The fast charge feature is helpful if you forget to charge overnight but I haven't needed to \"fuel up\" mid day at all.As for photos and video the resolution is not as high as most phones currently on the market but my photo results have exceeded my expectations.I recommend.","rating":5},{"id":"R2Y519MJ40S95O","title":"Bad buggy phone","text":"Out of the box, camera app gives an error. It keeps asking me to restart it. Other apps that use camera (Google hangout) are fine. Tried different options suggested on the internet but didn't work. Waste of money, don't buy.","rating":1},{"id":"R6WQAHYBFHFQG","title":"Seems to be a pretty solid phone","text":"I have been using this for a few months now.  Seems to be a pretty solid phone, plays Pokemon go well, if a tad laggy.  No problems with speed when on the internet or wifi.  Just a solid phone that does what it is supposed to do.  I would buy it again.","rating":4},{"id":"R1RERAZB1QBOTK","title":"nice in handling","text":"Received the g4 play, nice in handling. The version is promosion with amazon, the advertising is less invasive than I expected, like a datalle: some poor pictures in low light and the screen shot result in loss of quality with respect to the original image ... continue the tests And will make updates to my comment.","rating":4},{"id":"R18IOENNPN4M3N","title":"This is a great phone at a great price","text":"This is a great phone at a great price. I do wish it was a bit smaller. I previously had a flip phone and it fit in my pocket, which this phone does not.","rating":5},{"id":"R1O8H421LJVHRH","title":"Great for a first time smart phone.","text":"Not a bad smart phone for the money.  This was my wife's second smart phone.  She really like it.  She is not a gamer.  Useses for texting and Facebook and a few apps. Battery lasts more than a day.  Pretty good overall.","rating":4},{"id":"RVV43LDYLPQDM","title":"Great budget phone!","text":"Much better than the BLU R1HD that I had before.  It also has great battery life.","rating":5},{"id":"RKHCUFQ72RTGD","title":"Plays Annoying Random Commercials","text":"I really like the phone. The ads are driving me nuts though. I am a teacher and the phone will start playing commercials for apps randomly. I have to silence the phone all day and I don't like to do that in case of an emergency, etc. What can I do about this???","rating":3},{"id":"R2Y519MJ40S95O","title":"Bad buggy phone","text":"Out of the box, camera app gives an error. It keeps asking me to restart it. Other apps that use camera (Google hangout) are fine. Tried different options suggested on the internet but didn't work. Waste of money, don't buy.","rating":1},{"id":"R2XKYXANLXW7BJ","title":"I love this phone","text":"I thought I was going to have to send it back because my SIM card didn't fit. Thankfully I went to  T-Mobile and they set it so I could keep the phone and my number. I love this phone. i have always liked and had good luck with Motorola phones. Thank you!","rating":5},{"id":"R16FL3NJK6ZQL1","title":"Save $500. Buy the Moto.","text":"I had a $600 Samsung Galaxy S 6. Now I have  a $100 Moto G Play (4th Gen.) The Moto is =  to or better than the Samsung. Except that the Moto camera is not as good. If pictures are not critical  save $500.","rating":5},{"id":"RC0C3UNN54VZ2","title":"Cannot Go Wrong Great Deal","text":"Very nice. Works with any carrier. Storage is truly expandable. Fantastic without all the bloatware that comes with carrier related phones.","rating":5},{"id":"R3HWXWX3ZU1R4","title":"crazy awesome battery - phone works.  maybe the best, cheap phone!","text":"I'm 25% battery left, and I've got 4h39m screen on time!!!  on track for 5+ hours.  WTF!!!!  I switched, as a test, from my Nexus 6P.  it get's maybe 3hrs screen on time.  both phones are on Verizon.  I guess it makes sense; this phone is smaller res screen, and weaker processor, but wow.Overall this phone is great.  Yes, it does lag a bit (compared to my Nexus 6P).  When I view my open Chrome tabs it's like 2ftp lag, pretty bad. BUT IT WORKS.  $99.  The amazon stuff isn't bad at all.  basically this phone is vanilla Android 6.0.1 with some Amazon stuff installed.  Yes, there is a lock screen add, it's not bad at all.","rating":5},{"id":"R1DNM1W3LMQCI","title":"No bloatware and Amazing battery life.","text":"An amazing phone in so many ways. Especially the battery life.  I work from my car and have to be able to call and text throughout the day. With my previous phone, I had to carry a charger AND extra battery.  With the Moto G4 Play, I make it through an entire day, including 2 hour conference call and it's still at 68%.  There is no bloatware getting in the way and has exactly what I need.  I'm an Amazon Prime customer, so I don't mind the ads on my lock screen at all.  It deserves 5 stars. Unfortunately, it took me a while to realize the GPS/location function does not work properly.  I spent quite a bit of time trouble shooting it, but it truly doesn't work.  No matter what App I use (Google, Waze, etc), it \"searches,\" but never finds.  Location on High Accuracy, tried taking the case and screen covers off, even tried shutting it down.  One of my husband's old phonse had this issue, so I am not sure if it's common with this phone or just an unfortunate defect in this particular one.  It's an important function, but I love the rest of the phone so much I'm trying to live without it until it becomes a big problem.  Great phone in every other aspect!","rating":4},{"id":"RP7NB6R2QIN7D","title":"Let's Hope it's as good as Motorola's Past Phones.","text":"I bought this phone for a birthday gift for my daughter, to replace her Moto X (2014), which had a broken screen.Having had excellent experiences with both the original Moto G and the same Moto X mentioned above, expectations were high.So far, she loves it. It plays all her games, and she happily texts and Twitters her days away on it. The ads are, in her words \"annoying\" (but understandable, given the discount), but the phone works well, with little lag, and plenty of features for a teenager who often brutalizes her technology lol.","rating":4},{"id":"R2M8N9DXR69V4M","title":"Best for the money","text":"This has got to be the best phone on the market at this price point. I had an iPhone and this does everything it did and more. I like the Android operating system better anyway and since this phone has a slot for a micro SD card I was able to bump up the storage easily. I love how lightweight it is. Can barely notice it in my pocket at all. The back has a slightly rubbery texture that is great for getting it to stay where you put it. The high end phones today are way too expensive for what you get. This phone hits the price vs. feature mark perfectly.","rating":5},{"id":"R3IUW054DUVJOU","title":"I now have my iPhone 6s plus in a drawer and am using this little rocket as my daily driver as it is a very fun phone. Removable","text":"I have always owned premium phones. All of the Galaxy Notes and most of the iPhones as well many more flagship phones. I bought this on a whim after reading reviews, just to play around with. I now have my iPhone 6s plus in a drawer and am using this little rocket as my daily driver as it is a very fun phone. Removable battery, sd card and plain stock android. Great battery life as well. It zips along with no problem all handling all I throw at it. Very fluid uninhibited ui and not the laggy experience android users are used too. I don't play games but I do watch a lot of videos, text, instagram ,surf and heavy gps user. Not the best camera out there but a good one non the less. I love this phone and am so impressed I plan to look at other LenoMoto phones. Motorola is owned by Lenovo. I am very impressed. If you are not a heavy gamer this is your phone.","rating":5},{"id":"R28UT4HNXKU9IL","title":"Good for the price.","text":"The Amazon ads are not annoying, as they can be easily ignored (they only appear in the lockscreen). However, I have a problem with the many unwanted pre-installed apps. At least they go somewhat easy on memory. But anyway, I wanted to save money, and definitely I did.Another minor problem I have with this phone is that, even though the battery life is good, it takes too long to recharge (more than three hours).Other than that, you can't get nothing as good as this with this price.","rating":4},{"id":"R328LZ99JWP49A","title":"Nice price, nice phone","text":"I've only had this a couple of weeks, but I can honestly say I am loving it.  I previously had an iPhone5s that gave me nothing but trouble...low battery life, constant updates that would then cause me to have to update my security profile, and poor apps, I decided to get an Android based phone.  The funny thing is, I don't even want a phone, just something that would run all the Android apps, so I am using this strictly as a WiFi based Android tablet.  It is larger than I expected, but not uncomfortably so.  The screen is crisp and clear, it connects well via WiFi and bluetooth (my main reasons for purchasing), and the available apps are terrific.  For the price, this phone is a terrific bargain and I couldn't be happier with my decision to purchase it.  Heck, I may break down and even use it as a phone someday.","rating":5},{"id":"R34P88MC8DAPC7","title":"My first smart phone. The only problem is my learning curve","text":"My first smart phone.  The only problem is my learning curve.  It does everything I expected.  I think I need a \"Smart Phone for Dummies\" book to raise my expectations.  The experts like it.  I liked the price.  An occasional add on the lock screen is not a bother, and I can' t see paying extra to get rid of them.","rating":5},{"id":"R20OAN9CPHA3NZ","title":"Hands down the best cheap phone.","text":"This is for the Moto G 4th generation Play, with special offers. First, it has a removable battery second it works on all carriers. For $99 you get a pretty good phone. Add a fast 32 gig micro SD card and your good. If like me you have a kindle, Amazon prime, etc, you can't complain about the value.","rating":5},{"id":"R2MKM9JURJ2190","title":"Best bang for the buck!","text":"Can't beat the price for the device.  Just small enough to fit in your pocket.  I purchased the micro sd to expand the memory.  The ads don't bother me.  The device itself is working great.  Sound quality is excellent and I use it a lot for wireless communication.  Usual Android that you either like or don't.  Camera takes great pictures and the built in flashlight is wonderful.  I'm sure there are better, fancier phones but comparing price to features, this beats them hands down.","rating":5},{"id":"RJ9TTCCAGMN1I","title":"Five Stars","text":"Yeah!","rating":5},{"id":"R2262JA91XCB2O","title":"Five Stars","text":"I LOVE IT.","rating":5},{"id":"RCC3N0E95O2BB","title":"Five Stars","text":"good","rating":5},{"id":"RIB16E75AYIJF","title":"Five Stars","text":"My daughter loves it","rating":5},{"id":"R28C9ACZOZEK1P","title":"Five Stars","text":"Great look, fast response and excellent price for this unlocked world phone.","rating":5},{"id":"R336F1OSSVYGH5","title":"F' spending 400 to 600 bucks on cellphones that do ...","text":"F' spending 400 to 600 bucks on cellphones that do the same job as this little guy. Battery life is out of this world, does the major 3 in my book to a T!CallsTextEmail","rating":5},{"id":"R1GN8L08W0MYYZ","title":"Two Stars","text":"Worked great for 2 months. Now it won't recognize an AT&T sim card","rating":2},{"id":"R38K2LZD2LWC3A","title":"Great budget android phone","text":"Good budget android phone. Got it at lower price as it was for exclusive prime members.","rating":4},{"id":"R16I9TG3ITE7L5","title":"Five Stars","text":"Excellent phone. Works very well.","rating":5},{"id":"RHOL2X8IX52FA","title":"It's nice to work and relax together","text":"Not a servant, but a reliable partner. A solid, with a strong personality and character. It's nice to work and relax together.","rating":5},{"id":"R27G6CY33F1Z6R","title":"Moto G Play vs BLU R1 HD","text":"Great budget phone for the price. The lockscreen ads do not bother me at all. I purchased this phone after testing out the $60 BLU R1 HD with 16 GB storage and 2 GB memory. The BLU actually had a nicer build quality than the Moto G Play, especially the metal sides and curved glass on the front, but the back was very slippery and caused the R1 to slide off surfaces way too easily. The Moto feels lighter and the back battery cover has a softer, more textured feel that is easy to hold and makes the phone less slippery when holding and and when setting down on a surface. I'm not sure which phone I actually prefer since the BLU looked/felt a little nicer, but the Moto is more practical.Besides the minor differences in the look and feel between the BLU R1 HD and the Moto G Play, the real difference is in the software. Even though I wanted to like the BLU, it had too many software bugs. Both phones are snappy and responsive with their 2 GB of memory, but the BLU would randomly open apps, start playing music, or have odd syncing issues with Android Auto that I couldn't resolve. I finally returned the BLU for this Moto G Play and those issues are no longer present. Even though the specs between the two phones are nearly identical, and both have Amazon software installed, the Moto is still going to be much more refined. Also, the rumor is that all the G4 models will receive Nougat which is less likely to see its way to the BLU R1 HD.","rating":5},{"id":"R3S58MR5DH4MWW","title":"BEST PHONE I'VE HAD IN A LONG TIME!!!!","text":"This is the best phone I have had in a long time!!!!  I've been a Samsung user for about 3 years, and when I upgraded to the Galaxy S7, I quickly became very disappointed.  The battery life of the S7 was poor, to say the least.  I was skeptical about trying a new phone, but I'm so glad I did.  The battery life of the Moto G Play is AWESOME, and the phone is fast and efficient.  VERY SATISFIED CUSTOMER!!!!!","rating":5},{"id":"R16SSSEMA2DMUE","title":"BEST SMARTPHONE EVER!","text":"Probably one of the BEST Smartphones I have ever owned!  Very easy to use, Excellent EVERYTHING especially the battery!  It lasts forever!  Love Motorola brand and this one does NOT disappoint!  Excellent price too!","rating":5},{"id":"R3LF1V4Q8SZJ88","title":"Goldilocks Phone","text":"What do you need in a cell phone? And what don't you need? I needed a modern smartphone that I enjoy using and fits my personal needs. I do not need to carry around a fragile device that costs so much I worry all the time about dropping it or losing it. The positive reviews I read led me to think the 99$ Amazon Prime phone was very well worth a try. The negative reviews seemed mostly critical that you don't get everything in this phone that you will in an expensive one. So I tried it--- and it is perfect for my individual requirements- and then some.This is a dream phone for my modest needs: Unlocked, works on all carriers, uses up to a 128GB sdhc card (formatted as internal storage if you like, or the usual external card), excellent sound quality for the price, my favorite apps transferred easily, Audible books download smoothly, easy to set up, a perfect size, easy to hold and operate, great battery life, good screen quality--- everything I need and want.What makes this little miracle of modern technology possible is, of course, Amazon ads on the lock screen. Think very carefully how much you care about that. I bought this phone knowing my Prime membership was nearly up for the year-- and I wasn't going to renew it for now. I'd have the phone, but wouldn't be able to take advantage of Prime offers. It seems obvious in such a case to pay the extra 50$ and be done with it. I thought about it and decided I didn't mind that much. And I haven't, so far. One fast swipe and that's the end of it. For you, that 50$ might make all the difference between enjoying the phone, or not. For me, the ability to have everything I need in a phone for 99$ was too irresistible to pass up.I can even take it hiking in its rugged case without worrying about it. I needed that too.Update: March 14, 2017  Tracfone unable to activate BYOP on Verizon without prior account.I still very much like this phone: it works beautifully. But many hours of competent help on Tracfone's part were unable to activate cell service. And nothing is wrong. (Verizon works well in my location for everyone else, and has for many years.) And other people in other states have had the same problem: *BYOP + Moto G4 Play + Prepaid Tracfone minutes + new customer to Verizon* is a blocked combination. It is clearly a Verizon decision, made somewhere in the labyrinth of their ever-morphing rules and regulations.I bought this to use infrequently as need arose, when out and about. I have no intention of paying for a 45$ monthly service I will seldom use and can't afford. There will likely be a way at some point to finesse the ever-changing nightmare of cell phones and cell phone plans. Meanwhile, I read everything I can find, and am learning how very different people's experiences can be. What works for one person in one place doesn't work somewhere else. And things change all the time.My conclusion is: this phone is exactly what I wanted and I am keeping it. Sooner or later, I'll find a way to activate it.Meanwhile, it works fine with wi-fi, which I don't need it for.","rating":5},{"id":"R2JABGAPFVTCWI","title":"Works great with my FreedomPop LTE and Global SIMs.","text":"Works great with my FreedomPop LTE and Global SIMs. I really like the phone. Sharp screen, fast processor, Droid 6.1. I went with the no ads version. Battery life is great, especially after tweaking. Highly recommended.","rating":5},{"id":"RV80Z9LN215LW","title":"This smart phone is well worth the price and freedom it brings back to having a choice without contracts.","text":"I made the effort to say this is a decent phone unlocked which was so easy to configure, transfer my SIM card to from my other VERIZON  smart phone. I have a NANO-SIM, used an adapter kit, to match the MICRO size this has. No calls to the ripoff company, I will not go back to the locked rip off HTC I had. Fifteen years with a company that gave my family loyalty data one month, then sold me a phone replacement without even a mention of a purchase or payment plan, in a year, we will be leaving Verizon. Maybe someday, consumer value will come back in style. Thanks Amazon. great value here.","rating":5},{"id":"R29IQ3VJ7KWJ0Y","title":"Best Budget Phone.","text":"I was honestly just trying to get a simple, cheap Android phone to replace my joke of a Windows phone. I went through a ton of options but I'm glad this phone stuck its head out from the crowd. The Moto G4 series is great and I very much wanted the better screens and cameras of the more expensive versions but I couldn't let go of my favorite feature that the market is eliminating left and right: removable batteries. Unfortunately, only the G4 Play has a removable battery but I will take some slightly worse photos for that feature. It could save your phone at some point.The next best feature is the truly stock Android it runs. It makes a slow phone feel much quicker when there's no bloatware and no animations or flashy nonsense on screen. Just pure, simple functionality.This is a great budget phone no matter which way you slice it. You should get the upgraded versions if you don't care about the battery. But I loved having the option here.","rating":5},{"id":"RVV43LDYLPQDM","title":"Great budget phone!","text":"Much better than the BLU R1HD that I had before.  It also has great battery life.","rating":5},{"id":"R1OR81ZTIJ6D0B","title":"Nice Unlocked Phone w/ Caveat","text":"Nice unlocked phone.  Works with Verizon - no problems.  Actually purchased two.  Wife's phone works fine and connected to her vehicle's Bluetooth fine.  My Bluetooth phone audio will not work.  Spent an hour with Motorola tech and still no luck.  A google search shows I'm not the only one with the issue.  Deal breaker for me.  My 8 year old flip phone connects to the BT without problems.  So, as long as BT is not important to you, go ahead.  Otherwise, Do you feel lucky?","rating":3},{"id":"R798ZFCD5BVO9","title":"A very good value.","text":"So far, so good! My first Android phone since switching from Windows Nokia Lumia phones. Works pretty well on my T-Mobile service, but it can't do the T-Mobile WI-FI calling, of course.Otherwise, seems to perform well. Good GPS performance with MapmyRun, and the camera is pretty nice. The Amazon ads aren't too obtrusive, they don't bother me.All in all, a very good deal for $99!","rating":5},{"id":"R12EZPVMBU14II","title":"This phone definitely deserves five stars!","text":"I ordered this phone for my husband after his Samsung Galaxy was acting up and wow, what a great deal it is.  I will just cover in this review the reasons why he likes it so much --1)  It works great with Strava - the GPS on it in our area is very accurate, as accurate as his Garmin watch2)  The bluetooth connection for phone talk and music playing to a speaker is awesome3)  Battery life is absolutely wonderful.  He's been doing 32+ mile bike rides, listening to music and running Strava and comes back with a 89 to 92% battery4)  This phone did not come loaded with a ton of apps that you can't get ride of (probably why the battery life is so good)5)  My husband actually voice texted me!!!!So there you have it - this phone does everything that our much more expensive Samsung phones do, at a fraction of the price.  We are very happy with this purchase and I heartily recommend this phone for anybody that is on a budget, or just wants to spend less money for the same features everybody else is paying a lot more for.","rating":5},{"id":"R331S2MKFR687W","title":"Stock Android, no bloatware!","text":"I've been on windows mobile for several years now since 7. I finally made the leap to android and couldn't be happier so far. I wanted a budget phone that was as close to stock android as possible and with very little bloatware. This phone fit the bill on all accounts. The only third party app I've found is the Moto app which has a couple of cool features like swipe up from bottom to shrink screen to half size for people with small hands who want to use the phone one handed, and also a lockscreen feature that fades in and out info on a black screen like time and notifications. Example, when I press the power button the phone sleeps and I set it down, but when I just start to pick it up the clock shows then quickly fades away. On my windows phone I had to press the power button to see the time. Other than the moto app all the other apps are stock google android apps. The phone is very fast and I was able to learn most of it in about two hours, and I'm brand new to Android. I love that I can actually download apps now. Windows had a handful, it was pitiful. The detachable back is nice it's plastic but has a textured rubberized feel to it. I was shocked at how light the phone is as well. The screen, although 720p, is very sharp and the bright. I went for the unlocked $149 version. Worth every penny.","rating":5},{"id":"R23EJNCE7P2RJD","title":"Amazing phone- and not just for the $99 price!","text":"Tons of reviews on this so I'll just add the most impressive aspects of this amazing phone.  Yes, it's just $99 so I didn't expect it to do all the things my Note 3 did.  But I also didn't expect it to outperform the Note 3 in all the ways that matter..First, battery life is just ridiculous.  With the Note, I was lucky to get through a full day without topping up, and if I forgot to charge overnight I was in trouble the next day.  Using the G Play the same way in the same places, I easily get 2 full days.  And even though it doesn't claim rapid charging capability, put it on a 2.4A charger and it charges fast!Second, having a very lightly skinned version of Android makes a huge difference.  I read all the complaints about Samsung and LG 'bloat' and thought it was a bunch of techy whiners who didn't appreciate the benefits of the manufacturer's skins.  Boy was I wrong.  The G Play does everything the Note 3 did much more efficiently, and I am able to use over 10 GB of the 12 GB RAM.Third, the Amazon ads that allow the $50 discount on the phone are a non-issue.  The are small, easily dismissed from the notifications screen, and if you shop at Amazon, are often even appropriately targeted.  The Amazon apps that are preinstalled are not removable, but take up very little RAM.Fourth, the RF performance beats the Note by a mile- LTE, wifi and Bluetooth.  Better signal in more places and I live in a very spotty coverage area.Finally, the G Play display is just fine.  I don't miss the AMOLED display on the Note- I now realize it was pretty, but not remotely accurate and actually made reading on webpages more fatiguing.Obviously it would be nice to have a magnetometer, barometer, optical image stabilization etc. that the Note 3 had.  But it was not worth the tradeoff of having a huge, heavy phone that needed to be fed electrons constantly.  And the best part about the Play is if I drop it in a lake, it's no big deal.  By backing up my data on google and my apps and settings on Motorola, I just buy a replacement for $99 and I'm back in business in minutes.","rating":5},{"id":"RZYZLRDRDSS5J","title":"and it was a great little phone that just suffered from not enough storage","text":"After less than a year with a Galaxy S6, I replaced it with this phone. I had a Moto E 2nd gen before the galaxy, and it was a great little phone that just suffered from not enough storage. For some reason I never got attached to the Galaxy. It was fast, with a good screen, and good looking, but I don't like it. It was fragile, broke the back glass easily, and it made me do everything the samsung way.The G Play 4th gen is a phone I do like. Its utilitarian, open, inexpensive, and durable. Its everything I want in a phone, and on top of that its a great value. It lets me do the things I want, doesn't force me to do them its way. Haven't found anything I wasn't able to do or thought it did a bad job at. For the next generation, I'd like to see it thinner and with less bezel -- same screen size though. Really like this phone. I would say if you don't have to have the absolute best, this is the phone to have on every carrier right now.","rating":5},{"id":"R2BYVSF9ZVKXH7","title":"Beware of the GPS!","text":"Update 1/27/2017. I have the new phone and it's just as bad. Phone is set to high accuracy.  If I had to rely on the GPS to find my way around I would get hopelessly lost. Two days ago I was on the local Interstate and for several miles the GPS placed me everywhere BUT the interstate. It kept placing me on roads several hundred feet away with constant directions on how to turn to get on the interstate. This was for both sides of the interstate. I have been at intersections waiting for the light to change and the GPS said I was 0.2 miles away. Over 1000 feet off.Yesterday it couldn't get a GPS signal for over 10 miles.I often have times where I'm sitting at at intersection waiting on the light to change and the phone keeps jumping my location. To several blocks away, randomly.It also often doesn't know which way I am facing. I've had the display frequently rotate clockwise and counter-clockwise while it tries to figure out where I am. I'm often not even moving when this happens.My wife has my old Moto G (1st generation) and we have observed that there is also a problem with the wi-fi. Where she has a rock steady connection mine would consistently lose it.----------------------------------------------------------------------------------------------------I purchased this phone three months ago. After the first month I am constantly having problems with the GPS. I have my phone set to \"High Accuracy\" but it is constantly losing the GPS connection. When it is connected to GPS it randomly works, but at other times it's is jumping all over the place. To several blocks away from me and constantly trying to reroute me even though I haven't left the street I am on. I have seen it be up to 1000 foot off many times, but yesterday it was several miles off. My job requires a lot of driving to different places so this is very annoying. I had a Moto G1 and it's GPS was excellent, so I expected no different from the G4.Yesterday broke the camels back though. It stopped recharging. I tried several chargers and only one worked if you held your tongue the right way while crossing your fingers. I contacted Amazon customer service and they are sending me out a replacement. I hope the new one is better.","rating":1},{"id":"R16858FMM1YN0J","title":"Great price. Better phone.","text":"This is a fantastic phone for the price. It is just like older Google Nexus', being an unlocked, barebones Android phone with no stupid extra apps like T-Mobile Contacts or Samsung App Store (don't get me started). Useful size and large screen, but not an excessively large phone. I previously had a slightly more expensive Samsung Galaxy Prime Core, which was terrible, and this phone is BETTER IN EVERY WAY. More internal storage at 16g, clearer and larger screen, faster processor (i.e. apps open and run at an actually usable speed), surprisingly great cameras, and personally I like the UI of simple Android much better than Apple, Samsung, etc.I highly recommend this phone for anyone with a lower budget, as well as anyone who just wants a well-made, modern Android smartphone that is still simple and useful and fast.","rating":5},{"id":"RXY7YQR23G8Q8","title":"Love my Phone.","text":"I love my new phone so much. It does everything and anything I want to do and then some. It only came with 16gb of memory but I expanded it to 128. I am not using it to its fullest potential yet, but I will. I love the clarity of the picture and the price right here was $100. T-mobile sent a sims card and we've been talking ever since. Can't go wrong. Only 1 issue I've had: Cannot get it to sync to my wireless headset. The headset syncs with all of my Kindles. Called Moto-we couldn't make it work. That's my only complaint. Good phone and price.","rating":5},{"id":"R3T0BQT7FX4W3J","title":"The best sub-$150 phone out there right now!","text":"The best sub-$150 phone out there right now (of course, if you have Prime, then $99!!). What it lacks in sensors and features, it makes up for in battery life (and it's removable/replaceable). A near pure Android experience with great performance for everyday tasks. Call quality and reception are great (I have StraightTalk via AT&T towers). Camera is good enough (for me). With HDR on, I was able to get better than expected quality out of the pics; but you do need a steady-hand. The back cover is soft and feels great in the hand (decent grip). The edges are raised slightly so if you place it face down, the glass never touches the surface; it's a nice touch. I like the rounded edges on this better than the Moto G 3rd Gen. It's lighter than the 3rd Gen model; feels cheaper - but I like this model more. Unless you're prone to dropping the phone, I'd skip getting a case. I've had it just a couple of days; hopefully, it'll last.","rating":5},{"id":"RCU05RLLTGLSC","title":"would buy again.","text":"Am new to the smartphones, so I like it, cause I have nothing to compare to. Decided to get the one without adds. Called net10 and they told me I needed Verizon to unlock it. My heart sank. Called Motorola and Verizon 'cause we use CDMA in Montana. No help really. Motorola confirmed it is unlocked. But Verizon told me that they don't have CDMA networks anymore. How can this be true, I have a Verizon phone and plan for 8 years now. Maybe its the region. Either way called net10 back and they asked for a 15 digit phone id # this time. I think that's why they told me I needed Verizon to unlock it, I only gave the 14 digit meid# the first time. Seems to be sufficient for my basic needs. So what did I learn?- for Net10 bring your own phone plan use the imei# on the phone box.- I can use their CDMA sim card in this phone in this region on Verizon towers, (buy the 4GLTE activation kit for $1.00, includes GSM & CDMA sim cards of all sizes).- Already have GSM sim card for if Verizon actually does stop using CDMA.","rating":4},{"id":"RY5ZZLWO0ARA3","title":"Good, competent phone","text":"I bought the Moto G4 first, then decided I wanted something smaller since the G4 is just a little too big to carry comfortably in my pockets.  Turns out that practically speaking, there isn't that much difference in the size of the phones, so my bottom line recommendation is to spend the extra $50 and get the G4.  What you get for the extra $50 is a much better camera, a brighter, Full HD screen (better to read with the Kindle app, mainly because the font is little bit larger), the Moto actions to turn on the camera and flashlight and Turbo charging.  The G4 Play is a good phone, but it's hard to go backwards from the G4 to the G Play.  I think that if I had gone directly from the iPhone 5S to the G play, I'd have been fine and never given it another thought.  Hope that helps.","rating":4},{"id":"R3QDAHTCP1SCW8","title":"G4 Play is a very easy to use phone! Detailed review with pictures.","text":"First of all, I am picky about phones, tablets...all electronics. Being a techie type, I researched many phones before I decided to purchase this G4 Play...And after using this phone every day, all day long, I have discovered that this was the best choice of a phone for me.Well, I have written my review as if I were you reading reviews trying to decide to buy this phone or not...PROS:+ MICRO SIM CARD -- While Nano Sims are gradually being the standard SIM size and are the size for newer phones, I still like this size.Note to Nano SIM users: You can install a Nano SIM in this phone IF you carefully place it into an adapter or just go to your phone store and they can move your info from your Nano Card to a new Micro SIM card. Be sure you have a new Micro SIM with you in case they do not have one. Amazon sells Micro Sims.+ Size, Weight, and Comfort of the Phone...This 5 inch screen, weight of the phone, comfort while holding this phone are some major reasons why I bought this phone. I had a huge 5.5 Samsung J7 (2015). It was too big for my small hands and very uncomfortable to hold. And because the G4 Play is a lighter weight phone and not bulky, I am love this!This phone fits my hand perfectly and comfortable to hold.+ Memory/Storage has 16GB Internal however after OS and factory apps 10.6 GB left. External card slot can handle up to 256GB.There is no bloatware...pure Android experience...About twenty one essential factory Installed apps including Phone and Help. Most of the apps are Android / Google Apps. Only about six Motorola apps which includes the Camera, File Manager, FM Radio, Phone, Settings and Calc.  Motorola allows Android and Google to supply just the Apps you need, however, later on you can install Apps you like as there is plenty of room left.  Below is a list of Google / Android Apps pre-installed on this phone:* Calendar (Google Calendar)* Clock (Google Clock)* Contacts (Google)* Chrome Internet Browser* FM Radio App (Moto installed this on this phone, no Internet needed...real FM Radio)* Google App* Google Maps* Google Music* Hangouts (Google)* Messenger (Google Messenger for Texts and MMS (Picture or Video Messages).* Photos (It is a Photo Gallery by Google).* Play Movies/Play Music* Playstore* Settings (Android Settings)Because I just installed Apps I wanted like Facebook, Twitter, PrinterShare and other large Apps, I still have 8.25 GB Internal Storage now left if I want to add more apps later on.+ Memory & Storage Size & Speed ... The Internal Memory and RAM are adequate and I find the phone runs plenty fast and for me, no lagging, never freezes. A very peppy phone in my opinion.+ Marshmallows 6.01 installed  and promises to  later update to Nougat 7 OS when available.  This I am very happy about because my Samsung J7 M model has yet to update to Marshmallow it still has Lollipop. Other J7 models should get it but I am not sure J7 M model my old one ever will.+ Camera...It is just 8MP however, I took inside and outside pictures and they came out very clear in my opinion. This is much to my happy surprise.+ Screen Resolution/Special Screen Information - For me personally, I find the resolution (at 294 PPI - Pixels Per Inch) excellent as the colors in the screen are very bright and vivid and very clear! In fact, webpages and my Kindle Reading app are just stunning on this phone! *All of my pictures and videos are crystal clear with this phone.***OUTSIDE VIEWING in Direct Sunlight with this screen...  OK if I turn the screen slightly to the right because the Brightness NITS are about 400 Nits so this is good (adequate). Some more expensive phones have at least 500 Nits...some have close to 700 Nits of brightness. The higher the Brightness Nits the easier it is to see your screen in bright sunlight. * There is no way to increase the Nits on this phone but I could view it somewhat in direct sunlight.+ WiFi and 4G (LTE) (Internet)Info:WiFi Connects to any WiFi and the signal strength is excellent (even in the very back of my home and outside), most of the time I have 4 bars (outside is 3 bars).LTE (Data) When not near a router or WiFi hotspot, then I use LTE (Data) for Internet. The LTE on  this phone is LIGHTENING FAST when I use data.* Note: At home, I use WiFi on my secured Router with a password. However, when I travel I use LTE Data on this phone as it is much more secure tha a Open WiFi Hot spot at say a cafe etc. This way, I know I feel more secure on the Internet.+ OTG – This phone supports On the Go with the micro USB port so I can add a 256 GB flash drive with my office files, pictures etc and the phone easily reads these files.+ Temperature of the battery and coolness of this phone - This phone and battery runs very cool with the Snapdragon 410 processor (the 600 & higher Snapdragon processors on other devices can run hot). With this phone's 410 cool processor the normal temp and most of the time it is running at 78 F degrees to 87 F degrees. When I download lots of apps or play games, it may get up to 90 degrees for a couple of minutes but goes right down to normal temps. I have run many programs on this phone and it DOES NOT OVERHEAT. I have read that some newer smart phones will sometimes get up as high as 112 degrees, this one for me has not done this.It is important to keep a phone running cooler as it will prolong the life of the phone and it is easier on the battery as well.+ Phone call Clarity/Loudness etc. - Loud enough speaker and sound is very clear, best phone I used..No matter what my location using this phone for phone calls the clarity of calls is loud and clear whether on the phone's speaker, headset or speaker.The front speaker on this phone is plenty loud...better than my Samsung J7 was!+ BATTERY LIFE: This phone has given me the very good battery life. And I use 100% brightness. For me, even at 100 brightness, if I use WiFi or Data just when I need it and then turn it off, I get close to all day into the night on one single charge! (I charge nightly and the phone is at 100% ready to go the next morning). Also to save battery, I turn off WiFi or Data and tap the ON OFF button (put to sleep). This way, I use my phone into the night on a single charge.+ EXTERNAL SLOT FOR MICRO SD CARD (UP TO 256GB SD CARD) - This helped to sell me on this phone as I can add my personal music, photos, videos and more to this phone! (I placed a 64GB SD Card in this phone and I still have room left).*Keep in mind where External SD cards are concerned: Many apps can be moved to External SD card. Not all. See this article:http://www.techdroider.com/2016/02/how-to-move-apps-to-external-sd-card-on-marshmallow.html?m=1By default, the apps go to your Internal storage.Actually the External SD card is meant for your personal files: music, videos, photos, and other files. When you install apps from Playstore, they install in your phone internal storage. Personally, I do not have gaming apps or tons of apps so my apps are still in Internal Storage and I have plenty of space left for more apps later if needed.+ G4 Play Prints pictures and documents! I print pictures, PDF documents, Documents and more right from this phone! I have an HP Envy 4500 Wireless Printer...then I installed PrinterShare from the Playstore...I paid 10 dollars for the Premium version as the free one did not work as well. If you need more info regarding the Printing on Moto G4 Play, please ask me in comment section.+ Music Player..The installed player is Google Play Player, however, I did not like it as it used too much battery/memory so I went to Playstore and installed the free Rocket Player...this uses very little battery and memory and has lots of themes, easy to make Playlist, etc.+ MS Office...I installed free from Playstore WJS OFFICE as I need use this 100 percent compatible MS Office compatible on the road. Works great for me. I highly recommend this free Office app.+ Reading/Creating/Editing Word, Excel, Text Files and much more on this phone: I downloaded a FREE APP called WPS Office (free) which I use for Office files (it reads, edits and creates Office files). And it also reads PDF eBooks so there is no need to download a separate PDF Reader app. *This is a MUST have if you have to read PDF or Word Docs etc, my docs are crisp and clear using this app.+ Bluetooth Speed and Performance - The Bluetooth paired quickly with several devices and copied files at a great rate of speed.+  Watching Videos online...I use an app called Internet free from Playstore and also Chrome and I watch online videos by pressing the big white arrow in center of video. I have watched all the videos I wanted on several browsers just fine.For Amazon videos there is an Amazon Video app that I discovered that I use on my Android tablet to watch my Amazon videos.CONS:- Just a couple of minor Cons I found...The phone I received did not come with a headset...no problem  as I already have a headset that works on this phone. (I prefer a Bluetooth headset because the sound quality us so much better). Amazon offers many plug in or Bluetooth headsets ar low prices.Also, the charger that came with the phone is a slower charger, however, I have a 2 amp charger that I use and it charges this phone quickly.Bottom line: Would I buy this phone all over again? Yes in a heartbeat as the size is perfect for me.  And for the money, I believe this is the best deal out there dollar for dollar. Will this phone be a good choice for you? Yes, for two reasons.:1) Yes if you want a very easy to use phone.2) Yes if you have small hands and small fingers as the keyboard is small.If you have large hands and large fingers, this phone may be too small for you...so you should then consider a 5.5 inch or higher screen phone.***This phone I recommend to a person wants a smaller, comfortable to hold phone and also a very easy to use phone. ** Personally, I love this phone because it is fits my hands perfectly, easy to use, fun to use and it is a beautiful phone!Thank you for reading this review. I tested the phone thoroughly before I wrote this review. If you have questions about this phone please ask me in the comment section as I am a techie type and will answer right away.","rating":5},{"id":"RB5UOGXB4UCPH","title":"Photo tragedy averted!!","text":"I just got this phone.  I've been using an IPhone 5 until now, but our family is moving overseas and I needed an unlocked phone.  Did some research, and this one seemed to stand out.  Things I need my phone for: 1) talking to people on the phone; 2) checking CNN.com and NFL.com; 3) reading out of print PDF books from archive; 4) taking photos of our two little girls.I was worried about switching from an Iphone to a \"budget\" android; even the name android just sounds weird.  But I have loved it so far.  I would highly recommend Xodo Docs for PDF reading, for me it's been great.  Having tried out our SIM yet but I'm confident it will work fine.  The phone feels light, the screen is wonderfully smooth and very pleasant.  I've only had it a short time but I'm not necessarily missing the iphone5, which is a really good sign.I also want to share what made me almost give up on this phone, but figured out how to resolve it.  The camera isn't bad.  It takes pictures comparable to the former iphone 5.  BUT, what I found was something SUPER strange: when i focused on the object and took a picture, it looked VERY clear--BUT when I went to VIEW that same photo, it was fuzzy and blurry.  Really, really weird.  What made it weirder, was that when I viewed the blurry photo, if I zoomed in a bit, it would somehow magically become clear again.  Tragically, when I either zoomed all the way out or just left it that way and exited the photo app, when I went back in to view the photo, blurry again.  This was SO frustrating because i really had begun to love this phone, but this was kind of a big deal for me.  I actually returned the phone the first time because I thought/assumed it was just defective somehow (I thought I saw a small scratch on the lens and thought this was the source of the problem).  Low and behold, when my new phone came (today), exact same issue.  It's really weird that I googled all around looking for some solution to this but found NOTHING out there.  Anyways, took it into a Verizon shop, they were nice but basically didn't know what to tell me.  They said that the camera is better/more defined than the screen, that was why it was doing that, and there wasn't anything I could do.  BUT if you are dealing with the same thing, DON'T LOSE HOPE, because there definitely IS something you can do.  I discovered that if you download another photo gallery app, then the photo displays as clear as how the camera took the picture.  I don't know if any/all photo apps make that happen, but I downloaded \"Quickpic\" from the play store and it has been amazing and allowed me to keep this phone, which I really wanted to do but couldn't if I hadn't resolved this issue.  SO, if you have found the same thing to be true with your new Moto G4 Play--download Quickpic (or maybe something else), problem solved!!!","rating":5},{"id":"R36THBYKY0P4HF","title":"Moto G Play (4th Gen) vs BLU R1 HD (16GB)","text":"Instead of making this a typical review I'm instead comparing this phone to the BLU R1 HD (16 GB version) since both phones are available with Amazon offers at $50 off the list price ($99 for the Moto G, $59 for the BLU R1 HD 16 GB). Since they are otherwise similar phones (screen size same, memory size same), I'll focus only on the differences, so that you can answer the question: \"Is it worth shelling out the additional $40 for the Moto G\"?Short answer: If you need CDMA (Verizon or Sprint), the Moto G 4th Gen is one of the few low-cost phones that has it AND all the GSM LTE bands you'd want as well. Also, if you need 4G LTE access in Europe and Asia, as the Moto G has a wide range of LTE bands that include most areas in Europe and Asia as well, while the BLU has all the LTE bands needed for the USA (which happen to work in many Latin American countries as well, but generally not in Europe or Asia, where you will mostly get just 3G speeds with the BLU which in general is not too bad if you're just travelling there).On the other hand, the BLU has a dual SIM, which is also a benefit for travellers, which the Moto G doesn't (it is set up to have it as some international versions of the Moto G DO have dual SIM, but the USA model sold on Amazon USA doesn't).To summarize, and list a few other small differences:Moto G:+ Many non-USA LTE frequencies (good for travellers)+ Has CDMA as well for Verizon/Sprint users in the US+ Removable/replaceable battery+ Noticeably better quality speaker sound (BLU sounds somewhat tinnier)BLU+ Dual SIM (good for travellers)+ $40 cheaper+ A little lighter, slimmer, sleeker looking, curved glass front really has nice visual appeal+ Front camera has flash as well+ Screen noticeably brighter on maximum brightnessTIED= Same 16 GB internal memory= Same 2 GB RAM= Android 6.0= Speed seemed similar= SD card (technically the Moto G wins with 128 GB max vs. 64 GB max for the BLU but at this price point, no one's going to be buying an overkill 128 GB SD card anyway, which costs way more than the phone, so I'd call that a tie since even 64 GB is going to be plenty for this market)DON'T KNOW? Magnetometer (apparently the BLU doesn't have one and I don't know or care if the Moto G does--does anyone really use a compass??)? Camera (I use a real camera for important pictures so don't care so much). Having said that, I did take some pictures with the BLU and they were surprisingly good (much better than those my old BLU Life One took, for example). Haven't really compared the Moto G photos but I'd expect them to be at least as good.I bought both and have pretty much made the cheaper BLU my primary phone and the more expensive Moto G my backup, mostly because it is slimmer to carry around and really does look nicer, although I do notice the poorer speaker sound compared to the Moto G.","rating":5},{"id":"R5EV4NZWRTORB","title":"Impressive for $99.","text":"I like this phone! I like the size, clarity, speed, ease of use, and even the 8MP camera does a fairly good job. Hopefully I can say all the same things in a few months, time will tell. The Amazon offers/ads on the lockscreen are inconspicuous and not a problem at all, once you access the phone the ads are gone, that's $50 well saved IMO!  As soon as my Moto Play arrived I switched the SIM card from my Consumer Cellular purchased Moto G 1st Gen to the Moto Play. I also added a 16 GB SD card for a bit of a kick (I probably won't even need it). I fired it up and followed the prompts. My Google contacts loaded quickly, I also used Motorola's \"Migrate\", everything transferred smooth as silk. After making sure everything worked I contacted Consumer Cellular to let them know I had upgraded phones. The only thing the service rep needed was the phone's IMEI #. She also wanted me to check and make sure I could access the Net without using Wi-Fi, I did this without a problem and that was that, I was good to go.  I know what the Moto Play is and isn't capable of as I've researched extensively. I've compared all the specs and capabilities of other phones at various price levels and decided the price of $99 for this phone was the absolute best bang for the buck for me. I haven't deluded myself into thinking this is the best of the best, I realize the Moto Play does not have all the bells and whistles that some other phones offer but after checking prices of similar unlocked phones I'm more than satisfied with my purchase.  The important thing to me is, this phone fits my needs, it offers no more nor no less of what I need in a phone. In regards to going in-depth concerning the detailed specs of the Moto Play there's no need for me to cover ground already covered since other reviewers have already given excellent reviews on the specs, pros, and cons of the Moto Play.UPDATE; 9/24I've dropped my rating from 5 stars to 4 stars because my Moto Play gets  warm during talk use of no more than 10 minutes (CPU temps reaching 115-125). The phone also gets warm while surfing or using FM radio or YouTube after a few minutes. I never had this problem with my Moto G 1st gen while doing the same things but maybe this is normal because of a more powerful battery. I've read of this problem in several Moto G 4 reviews but no one has mentioned this in Moto Play reviews. If anyone knows if this is normal or has experienced the same problem with CPU temps reaching 115-125 on their Moto Play please reply, thanks!UPDATE; 10/10/16As stated in my original post I purchased a 16 GB SD card for my MOTO PLAY. The card I purchased was a SanDisc hi-speed class 10 Micro SD card especially designed for the MOTO PLAY. I've read complaints in other reviews that the larger MOTO 4 loses connection with SD cards occasionally and have to be re-inserted. I've experienced the same problem and after having to re-insert 4 times because of lost connection I'm lowering my original 5 star rating to a 3 star rating. In every other respect (other than the phone running warm) there's still an awful lot I like about the Moto Play but I've come to realize it has it's faults but for the cost of $99 I can live with those faults. BTW, I've removed the SD card and will make do without it.","rating":3},{"id":"R3AJNG2ADOAG3F","title":"Excellent basic phone.","text":"This review is for the Moto G Play (4th gen) without offers and advertisements.I really like this phone. I wanted something with stock Android to replace my Moto E (2nd gen), but there is nothing affordable with a <5\" screen, so this is the next best thing.Positives are:The standard conservative Motorola styling (nice soft rounded corners, Moto dimple on the back, and traditional button placement).Textured power button.Textured plastic back.Light weight.Constructed of durable plastic instead of cold metal and fragile glass.Stock Android.Snapdragon 410 is still a great basic processor.  No problems doing basic \"phone stuff\" with the 2GB RAM.MicroSD slot for unlimited storage.3.5mm headphone jack.Relatively compact these days.Great battery life.720p resolution is perfect balance of sharpness and battery life / graphics performance.Front facing speaker.Decent cameras.  Color balance is a little cold, but better than a very saturated Samsung camera.Moto camera app is simple to use.Moto display is a nice feature.Excellent price.Cons are:It is a little big.  Please Moto, make a 4.5\" phone again. ;-)Is a little flimsy, but I accept this for it's light weight.Camera focus speed is quite slow.","rating":5},{"id":"R2BRJUWPTU31Q5","title":"GPS is worthless","text":"UPDATE :The GPS on this phone is HORRIBLE!!!!!!! I bought it to play pokemon go on and sometimes it places me in a town 10 miles away that I haven't visited in over a month! I can't gym battle because my GPS drift is so terrible I go outside the circle that allows you to interact. It stick.. so for 10 minutes, it won't move or update my character even though I've moved with the phone to a different location. I don't know what they did wrong with the GPS, but they did it exceptionally well. It's terrible. I wouldn't want to use it for location services in an emergency, that's for sure.If you want a phone with a GPS that works, this is not the phone for you!---------------------------------------------------------------------------------------I wanted an extra cell phone to put apps and things on that I didn't want on the phone I actually use. This was a nice, low cost option. It does have ads on it, but I hardly notice them. I keep my installed apps to one page, so I never see the ads unless I accidentally swipe to the next screen. It does show me suggested items and stuff on the lock screen, but I barely notice that stuff. Saving the $50 and getting this phone worked out really well for me in that regard.The phone itself is everything you'd expect in a moto android. It seems very responsive. I haven't had any issues with apps not working properly or being buggy. I use amazon music, so I bought a micro sd card and put all my music on the device, so I can use it as a glorified ipod too. I just plug the phone into my car radio and play whatever I want through the car speakers. Makes living in the back woods much more enjoyable. No more static filled radio music for me.Overall, for $100 I feel like I got a great deal here. It's a current, well rounded phone. Amazon integrated into it, so I know when i have packages shipped or delivered, which is nice. I put all my music on it. Every app under the sun I wanted to use, but didn't want cluttering up the phone I actually use. It's been a great purchase for me as far as I am concerned. I haven't really found any down side, other than the choice of full protection cases is pretty limited, but hopefully that changes as more and more people purchase this phone and want options.If you're looking for a cheap phone to give your kid, or to take with you on vacation, I would definitely recommend this phone as a viable option. I haven't found any limitations to it's functionality and am very happy with it.","rating":1},{"id":"R1N2T1TH3XUXY1","title":"Great value, don't be deterred by Amazon Prime ads.","text":"I did not want to pay $400+ for a smart phone. This absolutely is a good choice if you're looking for a cheaper option. The unlocked feature is great for anyone who travels or just wants the freedom to go to any carrier. I have also inserted a 120GB microSD card into this phone, which allowed for a huge amount of storage. The phone is great, functions like my expensive Galaxy S6 did. I actually prefer this one!I opted to get the Amazon Prime exclusive phone, which included ads. The only downside to this is that you can't customize your lock screen, but like other reviewers suggested, I have a weather app that keeps a notification up so it blocks most of the ads. The ads aren't very intrusive. Definitely worth the discount to deal with them. Also, Motorola features the option to have your phone show you the time and notifications even without waking your phone up, so it shows a nice plain screen with the date, time, and notifications.The one downside to this phone is the camera. For $100, this is the only feature that I'd say is not a better value than the price. The pictures often come out grainy. They just aren't the same quality as a fancier smart phone, but if you wanted the fancier smart phone, you would buy that. It is not a poor camera by any stretch of the imagination, just not really the latest technology.","rating":4},{"id":"R2FCMI8MSPR0MB","title":"Great $99 phone. 10.55Gb of space with Amazon adds and updates installed","text":"This phone is Great! 16gb of onboard memory but you can insert a new SD card (up to 128gb)and set it as internal storage and turn it into a 144GB phone! If you don't want to make the SD card as internal memory you can still expand the storage but once your 16gb of internal memory is full you won't be able to install more apps. 16gb of space is plenty for most users IMO. I've had many phones with an 8mp camera. This 8mp camera is definitely the best. Seems more like a 13mp. The 2gb or ram is great for multi-tasking and there is no lag at all. Video playback is superb for the price range. Also the Wi-Fi range is excellent. Great phone at a great price. I just wish I would have called U.S. Cellular first before buying from here because they have this same phone without Amazon ads for $30 in store on a prepaid plan. But I had Amazon gift cards from last Christmas so I'm still extremely happy with this phone! Buy it. You won't be dissatisfied at all","rating":5},{"id":"R2LUZMHP0Z9G59","title":"Simply and amazing piece of gear!","text":"What do you want from a phone? For me, first of all it has to be a phone -- crazy as that may be;-)  I purchased this phone mostly because my Nexus 4 was becoming too difficult to maintain a reliable phone connection as T-Mobile has been making all their improvements in LTE coverage apparently at the expense of the older technologies that the Nexus supported. Coverage is now much better and I have a phone that works well as a phone!The second most important thing for me is the ability to ask my phone for information and to be able to browse content.  Was a little worried about this as the reviews / specs I read indicate that this phone is in some ways less than the Nexus 4. In practice I find the phone to be very easy to read and it is typically very responsive.  I find it to be a very useful content browsing device.  I keep things very uncluttered. I want to know the weather so I have a widget on the home screen for that.  The app drawer gives me everything I typically use access from either one touch or a touch to a small folder and a touch.  Also have a widget for my media player and one screen over for my calendar.  In practice is seems a responsive and clear reading as my grandson's iPhone 5s and frankly I usually get better and faster answers than he does with Siri.I love that the Moto software is nearly indistinguishable from the stock Android of the Nexus. (Although I was on 5.? and this is 6.01.) There is no bloatware. There is a moto app that I have not used but read that it is limited from some of the enhancements that moto has made for their higher end phones. Seems to me that if I want more enhancements I can get them from the play store. So far I can do anything I want to do with it and have installed the apps I want.The third thing I want to do with a phone is to listen to music. I use Poweramp and with a slight bit of tweaking to the equalizer I am very happy with the music playback.  VLC player also does a great job with video files and HD movies from the SD card have played flawlessly.  One FANTASTIC bonus that I haven't had since before smart phone days is an FM radio!  A little bummed that I have to use a wired headset for this to work as I typically use a Bluetooth headset. However, it was great to listen to a local broadcast while out for a walk and also to listen to my favorite NFL team.  There may be plans you can pay for to stream the NFL and enough data to stream whatever local content you want. However, I don't have those plans and it is nice to be able to continue to  enjoy what I have always been able to enjoy in the days before smart phones.For a few more $ I put in a 64GB SD card. WOW!!!  A phone with 80GB for storage for under $200!!!  I really hope people will realize the significance of this and stop paying the ridiculous prices for storage charged by other phones. This is a very big deal unless you don't care about a few hundred dollars.I don't do games on my phone.  Apparently this does not have the power to do that. Seems pretty powerful to me as I can browse and watch HD movies. However, FWIW, the experts say this phone is under powered.  It also is lacking NFC. I don't use Google Pay and while the Nexus had NFC, I never used it for anything in 3.5 years so I don't miss it.  Also doesn't have a gyroscope and I also don't miss that. The GPS can find me on a map so I am not even sure what I am missing without it.So far the only thing that I am missing, and I am just going to have to learn to live without, is the flashing notification LED. Will just have to get used to touching it to see if I have any notifications.The only other \"bad\" thing is the camera.  It is serviceable and that is it.  Actually got some nice Christmas shots with it so I am happy about that. However, the nice ones were mostly accidental. Don't think you could ever count on this camera to take truly good pictures. I have a camera for that.Of course I want a phone that works without having to be plugged in. So far the battery performance has went beyond my expectations. Reviews say that the charging is way to slow. That is probably a good thing for long term battery life. However, since it is removable I am not too concerned about that. Have not used the included slow charger yet. Probably the best long term strategy would be to plug it into that when I go to bed. So far I have just plugged it into the powered USB hub at my computer and also have tested it with my Anker PowerCore mini.  Charges fast with these methods.In summary I am an old Mac guy who happens to prefer the stock Android interface for using a smart phone. I have spent a lot of money over the years for Macintosh computers as fantastic tools to create things. (Current MBP pricing excepted.)  I don't mind paying a premium for a good tool!  I am at the core very frugal.  The ability to easily get what you want done reliably is where the value is determined.  For what I want from a phone this truly is a good tool and yet somehow I did not have to pay a premium for it. I know that for things like the camera, video recording, and game playing this is not a very good tool. However for what I use it for I am amazed at what a great tool it is.  Blows me away to have all this capability for about the cost of a pair of Air Buds!  Have only had the phone for a few days and I will update this review if things change but for now I would happily recommend this phone to anyone who is not looking to play intensive games or take great pictures with their phones.  As a phone and content consumption device it is well worth the money!","rating":5},{"id":"R2H8BQH0OLBQQR","title":"Good phone, broken GPS","text":"A really really good phone *BUT* it is completely ruined by that a small percent of units have defective GPS.I've been debugging GPS on this device for 2.5 weeks now and very honestly nothing anybody, including Moto/Lenovo, says to try, settings to adjust, resets to preform will make it actually work. Units that are having this issue may as well not even have GPS, it really is that useless.Set the device to high accuracy, stand in the middle of a big open field on a nice day with clear skys... and \"searching for location\" or if it manages to lock, it will jump all over and the accuracy will consistently be worst than +/-300-400m and will repeatedly loose lock. Yes, using GPS Status & Toolblox (a great app I have used for a long time) will usually make it get a lock, but as soon as another app is switched to (like Google Maps, or Pokemon Go, or Ingress, or Waze, or Maps.me... anything that uses location during use), the accuracy will plummet and it will eventually loose lock then the GPS will shut down and stop trying completely.I've actually had two of the G4 Plays, the first was the Prime version. I did not notice any GPS issues during the 2 days I was using it before I sold it on to a friend. I thought maybe there was some difference between the standard and Prime ROMs, but I've since seen some users of the Prime model also having GPS issues.My recommendation: if you want this phone and you need functional GPS, either get a different phone, or get this phone and test the GPS for the first week as soon as you get it. Start the returns/replacement early before you get too setup on it as you'll just have to reset it and start over.I'm currently doing a replacement through Amazon. I'm hoping that the receptacle unit's GPS will actually work.02/04/2017 Update: Been using the current replacement infrequently for the last month, it's been working fine, but in the last week the GPS has started to fail on this unit as well. Further reports I'm seeing from other G4 Play users seem to point to the connector to the GPS antenna failing.","rating":2}]