[{"id":"RNYQURDGZZPG4","title":"I have been satisfied with my purchase","text":"I wasn't real sure about this phone, but ordered it anyway since my old phone was 6 years old and because my carrier requires you to purchase new phones. Overall, I have been satisfied with my purchase. I inserted my sim (AT&T), booted up and immediately got a signal. It sensed all the data on my sim card that I also installed. While there is an easy learning curve, and it isn't as refined as some of the top end phones being sold, for under a hundred bucks it is hard to beat. I would recommend this phone, just don't expect it to be the latest Samsung or IPhone. It will provide you with talk, text, data and allow most of the functions of the other phones. It doesn't have a lot of built in memory, so plan on using a sim card. They are cheap enough. Camera and speaker are just OK. For my needs, it does the job just fine.","rating":4},{"id":"R1ZDG82BU5RD14","title":"Not a bad phone at all.","text":"I bought this phone just to see what it was about. I currently have an iPhone 7, and knew this wouldnt be close in terms of quality and specs. It arrived quickly, and I was impressed with the phone. It's a much better built device than I expected. In the end, I stayed with my iPhone, as I expected, but I may give this to my young daughter. If they made a device with more storage, there's a good chance I would use it instead. iPhones are way overpriced, and the fact that this $59 phone was embarrassingly close in build quality and speed says a lot about the true costs of cell phones.","rating":4},{"id":"R8N4QW83CXYSH","title":"Five Stars","text":"Good little phone for the money.  Has held up better then the over the counter prepaid phone it replaced.","rating":5},{"id":"RI3D7NYPZI02F","title":"Amazing phone for an amazing price.","text":"I love this phone, especially for the price. It's easy to operate and has all the functions I need with a few perks like the LED light. The flashlight on it is blindingly bright, too. This could easily be a much more expensive phone.","rating":5},{"id":"R8V60JUCR2WS6","title":"So far, I'm very pleased.","text":"This phone is really wonderful so far.  I've had it for a week and it holds a good battery charge.  My last phone's battery would say 20% and then drop to 5% within 5 minutes of using it.  This one said 3% and I turned the flashlight on and 3 minutes later, the battery was still at 3%.  I had an outdated phone that might be laughed at, so this was a huge upgrade without having to spend a fortune.  I just like to talk and text and occasionally browse the news while at work.  The internet was much faster on this phone than my last.  I find this phone to be just what I needed.","rating":5},{"id":"R43DT2QCTXTQX","title":"Blu  5.5 Advance","text":"The phone is great except for the issue with storage internally. I don't have very many apps on the unit and constantly receive notifications that email has stopped because of storage after the update was installed.","rating":4},{"id":"R2JTGOMA7VQJEN","title":"Great phone great price","text":"Love the phone! Works great and it was so much better than I expected. Was looking forward to something a little less sturdy since its cheap....but this is great! Didn't get the earbuds and screen protector, but those are cheap I can get else where. The speaker is nice and loud, camera takes some lovely pics, and the phone itself is just great :)","rating":5},{"id":"R9A90Y6PPAOD9","title":"I like the phone well enough when it's working","text":"I like the phone well enough when it's working, but sometimes it just goes black.  Battery icon shows it's 100 % charged, but the phone won't power up, except when it does.  I called the manufacturer and was instructed to reset the battery and try it again and it did power up and turn on so maybe this has to be done periodically.  I've only had the phone for about a month, so I don't know if this is a reliable fix. Removing and re-inserting the battery is kind of a pain (I need a butter knife to do it) so this is process and the fact that I can't rely on the phone to work are real negatives and should be taken into account before purchase.","rating":3},{"id":"R1COU3B202HHU6","title":"I purchased this phone over two months ago and it works just fine. The Problem is The MEMORY SUCKS","text":"This is a case of, you get what you pay for. I read the reviews and still took a chance. I purchased this phone over two months ago and it works just fine. The Problem is The MEMORY SUCKS!!! After reading the reviews I purchased an additional memory card. Even with the additional card, it wouldn't allow me to download apps. I can't have the majors like Facebook, Twitter, Instagram and YouTube all at once. I've had cheap Walmart LG $20 phones that allowed for more downloads (Without additional memory) than this. I've had another BLU phone and had no issue. I would NOT recommend this phone. I don't have a case on the phone and have dropped it a few times and it held up well.","rating":2},{"id":"R2WVLTT5M7MMB8","title":"SimCard Size is Micro","text":"It is a great phone. While many shall say that the phone speakers and screen are bad and dull. It is a great phone. I bought this for my son and he just loves it! I bought it with a Sandisk Ultra 32GB because it only comes with 8GB. Because it can be hard to find the sim card it takes is a MicroSim. It is a medium size phone and a sturdy build I do recomend it.","rating":5},{"id":"R2IXW5CL5LXYE6","title":"Nice phone for the price","text":"Nice phone for the price,  nothing special.  I used it for a couple weeks, but decided I needed a phone with Magnetic sensors and this one did not have them.  Other than that a great phone for the price.","rating":4},{"id":"R370LML5WD47CZ","title":"best phone for the price!","text":"wonderful for for the price. i broke my old phone and needed a new one but didn't have that much money so I bought this one. The phone is real nice with a somewhat leathery feel to the back of the phone. Can hold 2 sims cards and 1 SD card. The camera quality is decent but i don't recommend taking oicture in the dark cause it looks bad. The display is nice and the best part about this phone is its super durable. The amount of time i dropped this phone without it breaking is unbelievable. I do have to say i did make a couple of dents to the trim but that doesn't effect the phone its self. For the money this is a real good phone. I would buy another one if i needed to.","rating":5},{"id":"R1A7U8K0CKKKZ","title":"Great phone. I use Straight Talk and was able ...","text":"For the money.....Great phone.  I use Straight Talk and was able to use my micro SIM from a previous phone. Immediately I was up and running again. The storage space is not great. I recommend a SD card for sure. I was only able to get two apps before needing the SD card. Camera quality is decent but not as good as my galaxy that I had previously. I did have problems sending Snapchat videos to friends that had iPhones. The screen was completely green for them. I ended up dropping the phone. It fell flat face down on concrete floor. The phone looks untouched and has no obvious damage, however, the screen no longer works. I can boot up the phone but can only see the screen slightly light up. I did purchase warranty but haven't turned it in yet.  Overall, I feel the phone was worth the money.","rating":4},{"id":"R1HSTWJN9A1BXX","title":"Five Stars","text":"Phone came as advertised. No problems encountered.","rating":5},{"id":"R2ADU5GCIVOPF","title":"Great phone. -Would be better given the ability to easily root it.","text":"Great little phone for the money. I would prefer more than 4GB of internal memory -or- the ability update to Marshmallow, in an effort to place more apps/data on an SD Card.  I'm presently out of internal memory. I can't even update my current apps for lack of space.  All in all, great little device for the price. Maybe I'll look into rooting it...UPDATE:This phone is now rooted.  I now have the ability to move many applications to my SDCard thereby freeing up additional internal memory.  Yes, this phone has a slow processor, but it's still pretty solid as far as the stock platform is considered.  I've had better luck with this budget phone than I've had with newer major brand devices.","rating":4},{"id":"R1C3DVWDP8D8SV","title":"Love this phone as much as my fancy Samsung!","text":"I have the newest galaxy and my daughter loves it so we purchased this so i could get my phone away from her without crying over selfies. The camera is great, it runs almost like my Samsung, no lag, we haven't let her use it yet but bought a memory card and took some photos for contacts and seems to be running as smoothly as my much more expensive model. We are only using it on WiFi for now. Her bluetooth watch even works with it!!!!!*watched a video or ten on how to get the back off, DON'T USE THE CORNER WITH THE CUT OUT, i almost chipped my phone and a lot of youtubers did, instead pry up another corner with a fingernail or credit card, popped right off and fit snuggly back on it.","rating":5},{"id":"R2HVBZEWPMPX3U","title":"Wasn't really happy with the storage space on this phone","text":"Wasn't really happy with the storage space on this phone. Ended up being too small for my daughter (She had another 4GB phone prior to this one, and yet the BLU wouldn't hold the same amount of apps; 4 apps shy actually).  So we gave it as a gift to Grandma. Who is perfectly happy with it.  But for teenagers who have to have tumblr, Facebook Messenger, Twitter and a game or two, I definitely do NOT recommend. There's better phones out there.","rating":3},{"id":"R2ENVNWH01OHXF","title":"It is just adequate, nothing great.","text":"This phone is just adequate nothing great. For the price it is fine and I will use it until a good deal on a better phone come along.The battery life is pretty poor and it is slow to charge. In fact even with it plugged in it will still lose charge under use.The cameras are not very good and it is hard to capture good pictures.The internal memory is just not enough for more than a few apps. I have a 32gb sd card installed but a lot of apps cant be moved to the sd card and those that can still use some of the internal memory.The phone calling/text  part works fine, no issues.The gps goes wonky sometimes.The phone is 4g but it is hspa, so speeds are much slower than lte.Bluetooth works wellHotspot works well","rating":3},{"id":"RV38PE2WDKF13","title":"All you need is a BLU phone","text":"Amazing phone for the price, I purchase it used and opened it and put my sim in and a memory microsd card and it booted right up and played all my favorite games with the newest Android system and features it's a rare find.  Later I find that the camera is not zoomable...wish I would have known that. 5mp camera doesn't mean anything if there is not autofocus...digital zoom is outdated lol...but upon investigation it seems it could be a malfunction or just simply incapable of focusing physically with the lens.  I played the newest games and it will play them. Maybe not as sharp as a phone that is especially built for gaming..but I have owned a ton of high end phones and was able to change to this one with no problems at all with the speed and capabilities of the Blu advance 5. Highly recommended. you should be buying all of your family and  friends this phone so they won't wast money with big named junk thats imported and up charged  300 ~ 500%...stop this madness. I have blown literally thousands with Apple and Microsoft just to have outdated failed devices with no upgrade options. I'm totally done spending a whole paycheck on  a stupid phone. You should be to if you try out this brand. I'm looking at a newer model right now. Ohh and the brightness thing. Be careful with the manual brightness controls. If you turn it all the way down and auto bright is not enabled..it may be blacked out. Auto bright function saved my phone I simply made the \"retina\" detect different lighting after accidentally throwing the brightness all the way down. Hence keep auto bright on when using the slider, Or use the \"settings\" widget and use the \"brightness toggle button\" and never touch the slider..atleast be very careful about the darkest setting. By luck my auto bright was on. Love the phone. Very cool BLU. PS. Nice outer aesthetically pleasing sleek look. Very light and thin. Hasn't fouled out on me yet and I use it non stop.","rating":4},{"id":"R3RIC9AEFT56TZ","title":"Its a cheap phone that could work for the money...","text":"Its a cheap phone that could work for the money compared to these $600 phones.HOWEVER:-comes with NO manual, no earphones, no screen protector, no case-size is extremely small at 4GB. unable to install everything needed without a memory card. If you do install a memory card, you can't even put widgets on homescreen because apps are on card, not phone.-Also found out, with apps moved to memory card, any shortcuts you place on home screens of those apps, when you restart phone, they go away, and you have to re-place them.-Camera is the crappiest(blurry, fuzzy and unusable in any low light situation)/cheapest quality on any phone I've ever seenwhen I received phone I charged it all the way and shut it off when it said 90% battery left, next day, try to turn it on to take it to phone store to get set up. now will not turn on, USES BATTERY LIFE EVEN WHEN SHUT OFF.had to switch battery from one phone into another and in the short minutes it took, battery lost 5% chargeone phone charged fully in one hour while im still waiting on the other one to charge (currently at 24%)With that being said, if all you use it for is text and call, its fine.If you like to use apps like instagram and pinterest and games, it will fill up the memory quick and be a headache to sort out what you would like to keep and what to get rid of","rating":3},{"id":"R21EITC3O0PIGI","title":"Amazing phone! Alright","text":"Amazing phone!Alright, so I'm somewhat new to the phone scene and my previous phone was an iPhone 4s. But this phone feels amazing.First off the phone feels really sturdy and the materials are really nice to touch. Compared to an iPhone 4s the phone is HUGE, its slightly larger than my friends iPhone 6.The specs in the phone are nothing special but get the job done. For gaming you will usually see 30 ish fps on most games (that just what it looks like, could be something different). The 1GB of ram means that once you tap out of an app you will probably have to reload it.The case fits very nicely and doesn't feel too bulky either. The earbuds are usable but I would recommend getting new ones as these sound very damp and weak. The screen protector is very smooth but does have a few small air bubbles near the edge of the phone (make sure you clean the phone screen before putting on the screen protector to minimize air bubbles!)The screen itself is very nice. When looking at it VERY close you can see a few ity bity pixels but if it is a foot away you probably wont be seeing the individual pixels. I'm using AT&T and all I had to do  was put the sim card in. The phone has two sim card slots (micro sim and full sim) so if you have an phone with a nano sim card (like an iPhone 5) you will need either an adapter or a new card altogether.My biggest criticism of this phone is the storage. This phone 8GB of storage but only ~4GB of it is usable. After downloading a few games and a lot of music it got filled up. So what I recommend doing is getting a 16-64GB micro SD card https://www.amazon.com/SanDisk-microSDHC-Standard-Packaging-SDSQUNC-032G-GN6MA/dp/B010Q57T02/ref=sr_1_4?s=electronics&ie=UTF8&qid=1472489110&sr=1-4&keywords=microsd%2Bcard (this phone can take up to 64GB of micro SD storage).","rating":4},{"id":"RCYYDVE4EL746","title":"Good phone for the price paid","text":"I purchased this phone for my preteen son and he really likes it. He eve got a case for it. It has lots of cool features, it's pretty fast and the memory isn't ridiculously tiny like some of the lower priced cell phones out there. It also has a nice sized screen. The touch screen is bright and very responsive. The graphics on his games look great. The sound is pretty good, not great. The LCD screen is not very durable; it cracked a bit after being dropped not from very high up at all, but it was still fully functional anyway. The camera is okay. The photos come out pretty nice as long as the lighting is good. Low light photos are not that great, even with the flash, but that's expected. It does have the front facing camera so that you can Skype and video chat and etc...For the price paid, it's a pretty good phone, especially for someone who wants a decent phone with good speed, memory and features without breaking the bank.","rating":4},{"id":"R36W57CBMOHZFP","title":"Memory management issues.","text":"The phone has been performing well. The cameras are up to par with even higher priced phones. However the phone makes poor use of my SD card and sometimes doesn't seem to be aware that there's one installed. The settings do not allow one to transfer apps from The phone memory to the SD card and so I keep getting low memory messages. If this were fix I would give five stars.","rating":4},{"id":"R3T2O44ZXVIG4P","title":"Can't ask for anything better for the price","text":"Does what it's supposed to do. Can't ask for anything better for the price.","rating":5},{"id":"R3FZW20QR9ZCQ8","title":"Not a bad phone","text":"TL;DR: Obscenely cheap smartphones have come a long way, but this phone still shows its price in places. I'd use this as a daily driver.Clarification: This review is for the /HD/ model. Specs for the base unit will be a bit lower.The Good: Don't be afraid of this phone's modest underhood specs. It's still capable of handling most common smartphone use cases.Browsing with Mobile Firefox, some Android games, texting, calling, picture taking, are all things I have tested and found rather pleasant.The rear firing speaker is surprisingly powerful and bass-y. Dare I say, sounds better than my Samsung S5!The 720p IPS LCD is another show-stealer. My past three phones have had AMOLED screens, and this phone's panel makes the return to LCD painless.The processor, RAM, and Flash memory are all \"acceptable\" for casual day-to-day use cases, and will tame most social media programs and web browsers without complaining.If its admittedly cramped 8GB of ROM isn't enough for you, drop a high performance SD card in it and enable Android 6.0's Seamless Storage feature. Boom. Major upgrade to your internal storage. (I have tested up to 32GB.)(WARNING: This feature will format and encrypt the memory card, locking it to that specific phone. \"Strange\" things can happen if the card and phone are separated while the feature's enabled, and the card will not work in anything else until reformatted normally.)Dual SIMs make travel painless, if not enjoyable.This phone supports UMTS Band 4, and works on T-Mobile.Build quality and button tactile feel was VERY remarkable for a phone at this price point. The back \"brushed\" panel really is aluminum. You can see contact points in the battery door, where the phone uses it as a conductive plane.They include a basic silicone cover and plastic screen protector right there in the box!The Bad:It's a cheap smartphone. I know I just praised its build quality, but it's imperfect. Mine's back cover will no longer \"latch\" closed all the way around.The touch screen is one painfully obvious place where they skimped to save on the BoM. The digitizer array is horrifyingly low resolution, with obvious \"steps\" when dragging or scrolling. It's still USABLE, but the low resolution can cause a few minor response issues when web browsing or playing games that demand touch precision.Power users will feel the pain of not having premium silicon under the hood.The Meh:Battery: It'll run all day on average use. Heavy users may find themselves reaching for a battery bank before the end of the day.Cameras: The main has 8MPs. You won't feel ashamed sharing its pictures with your Facebook friends, but it won't replace your dedicated point and shoot either. The app launches reasonably quickly. Pitting it against my battle-worn S5, the Blu actually launches slightly faster, but takes longer to close a focus lock. The secondary ... I don't take \"selfies\", but it'll do the job for video calls. My standards for front facing cameras are pretty low.Cellular: This phone is not equipped with an LTE radio - only UMTS HSPA+ 21Mb \"4G\". I don't consider this a deal breaker, because I doubt its modest specs could put the higher bitrate to use...The Ugly:This phone, among other inexpensive phones manufactured in China, were involved in a malware scandal. Afflicted phones shipped with a spyware trojan directly integrated into the over-the-air firmware update program.Blu, who produces some of the stricken phones, claims that all involved phones have had the trojan patched out of them.Google has released a statement demanding that these firmware spywares must be removed from all Android phones equipped with Google Play Store.Adups, who supplies the OTA firmware utility, released a statement that this trojan was never supposed to reach American market phones, and was intended as Chinese market research. Chinese market phones do not ship with Play Store due to censorship.Take from this what you will, and may your purchasing decision be well informed.","rating":4},{"id":"R305RZ9UWEBZEX","title":"Decent phone but terrible camera and very little memory","text":"I brought this phone abroad with me for a few months because it was unlocked and I didn't want to risk having my more expensive phone stolen. Overall, this phone for a backup is a pretty good choice. It works decently and has a good battery life. The reason for the 3 stars instead of 4 or higher is because this phone has so little space for apps on it. You can add an SD card, and I added a 64 gb one thinking that would allow me to install whatever I needed. However, most apps cannot be put onto the SD card and also even apps that can be put either completely or partially install to the phone first and then have to be moved to the SD card which kind of defeats the purpose (there is a setting where you can theoretically have it install to the SD card first, but in my experience it didn't work). 4GB sounds like a good amount of memory but most of it is taken up by junk apps that you can't delete. I currently have a gmail app,google maps,  groupme, whats app, venmo and a pdf reader on my phone (some of which are partially on the sd card) and my phone is completely out of space. Also, theres a few random bugs (might just be my phone though), for example, if i turn brightness on, when my phone goes to sleep the screen will not come back on unless i hard reset it (not a problem though if the brightness is kept off). Also the camera takes really awful pictures (I generally use my phone to take pictures of notes for class, but it is impossible with this phone to do so). Overall though its cheap and works pretty well in doing the basics so if you need a backup I recommend it, but if you want a full time phone, I would not get this one purely because of the lack of space.","rating":3},{"id":"RZWTVSP9FBOX4","title":"So-so phone....!","text":"I had to return the phone in less than a week the phone looks very nice front facing speakers sound good but not stereo . The 3.5 mm headphone jack is very weak with minimal bass the phone freezes constantly even over Wi-Fi and we have very strong Wi-Fi over Spectrum all in all it's okay phone but with a lot of bugs and I would not recommend it even for simple day-to-day tasks. There are many better cheaper options out there for the money.","rating":2},{"id":"R1E6RIBUKSTYD7","title":"Five Stars","text":"great as expected and timely delivery","rating":5},{"id":"R10MDR5SEFVJFB","title":"Overall good phone for the price","text":"Overall good phone for the price.  I've had it since June, 2016.  I use it as a secondary phone and as a hotspot.  The primary shortcoming for me is the inferior focusing / inferior photo's it takes.  My comparable Nokia 635 (pricewise) takes much superior pictures.  This has kept me from switching from the Nokia to it.  Also as far as I have been able to discern, I can't choose where my BLU stores downloaded pics.  If I have the optional SD card in, they default to it.  If no optional SD card is installed it, defaults to phone memory. There are other issues with pics involving DOWNLOAD, GALLERY, AND FILE MANAGER that would take too long to describe here. Overall I find the BLU Android OS less intuitive for me than the Windows OS on Nokia 635 but Window OS (mobile) has some significant IE problems.  Bottomline:  if you are wanting a decent smartphone with Android OS and sharp pics are less important to you, this might be a good choice for you.","rating":3},{"id":"R1AXM2WWH9S3UY","title":"Great product. I have AT&T it connects great and ...","text":"Great product. I have AT&T it connects great and for the most part always has a 4G signal or at least says it does. I ordered a different \"cheaper\" phone for my kid and it came LOADED with spam of all sorts to the point the phone is literally useless. I will be ordering another one of these. Thank you for a great product","rating":5},{"id":"R1JFNSR0VKH5E5","title":"Great for the price","text":"Took the phone out of the box, charged the battery, put the sim card in and it connected to AT&T.  What more can one ask from a cheap phone.","rating":5},{"id":"R2R33N0II4OW8B","title":"A decent and inexpensive smart phone for the kids or as a backup.","text":"OK, this is not an iPhone or an S7.  However, as an extra unit or a smartphone for the kids it is a great choice.  Not the fastest model out there but fully functional, decent sound and call capability, and a price that if you break it you can just pick up another one.I have tried this with SIMS from t-mobile, AT&T, and TracFone.  All worked without a hitch.  I carry it when I go camping so that I can have a second carrier when in remote areas where my primary might not work.  It is also my take along phone for activities where I might damage a more expensive unit.","rating":5},{"id":"R39BH62QQZE1OS","title":"Don't bother! UPDATE","text":"At first everything was working fine at first. But what I don't like about this phone is that it has very little space and for some reason with my SD card I can't move my apps to my SD card. I can't download certain apps for some reason and get an error message. I can't take pictures, screenshots, or download because It will tell me that I don't have enough space and I don't have that many apps installed. I am trying to contact the seller or manufacturer about it. So I wouldn't recommend this to anyone I have been having ridiculous problems with this phone. I want to give this phone a no star!----------UPDATE--------It works alright with the new SD card I got today although it will not move some apps that are movable to the SD card. So, I would strongly recommend that anyone should get an SD card with a lot of space on it because the phone itself has very little space.","rating":4},{"id":"R1TPU0J03GL4D4","title":"A steal!!","text":"I need an inexpensive spare phone that will allow me to change mini-sim cards for talk/text when going oversea and will take micro-sim card for data usage. After a long research, this Blu Dual sim Smartphone not only meets all the features I need, even support Android 5.1 Lollipop, but also the price is too good to be true. The phone comes in at the same day I placed the order. As a heavy apple product users, this phone is surprisingly rather easy to handle. It takes my mini-sim and micro-sim cards, as well as my old 16gb SD card. Since this phone has very limited capacity, my intention is to keep this phone as \"clean\" as possible. As I mentioned earlier, this is going to be a spare phone so I will not put a lot of app on it. So far everything works very well and I'm happy with it. **Update: The phone runs pokemon go quite ok as long as you turn to AR mode when throwing pokeballs. LOL. The battery runs out of power easily, but it is not a big deal to me.**","rating":5},{"id":"R2ZGCIL6QV4LLL","title":"Nice phone but check with your carrier first.","text":"This was an excellent phone and unfortunately I had to return it. I called the local AT&T store to see if they could activate the phone. One rep from the store said YES on the phone but when I got there the answer became NO. It wasn't compatible with their network. The same could be said for Tracfone in my area. What a disappointment!  There really isn't a way to check before placing the order with Amazon because it depends on the IMEI number on each phone and many Amazon customer reviews were hit and miss with that info. The phone was fast, great resolution and looked similar to an iPhone 6. I do want to mention how great the customer service was at Amazon when I needed to return the phone. I was considering just keeping the phone and using it on my WiFi but I have so many devices as it is. If it works with your carrier than you will have a nice phone.","rating":5},{"id":"RYITKZEMR89J7","title":"Good basic phone","text":"This is a good basic phone for the price. Despite having dual SIMs, only one will connect with a 4G system such as AT&T. In all fairness, with theadvent of 4G I have not been able to find a dual SIM phone in which both will connect to the system. It does not allow you to rearrange your app icons, keeping them in alphabetical order. That capacity comes with a more expensive phone.","rating":4},{"id":"R2K3U6KZGUCTLL","title":"Great Budget Android Phone","text":"This is a great value for an unlocked Android phone. It comes with Android 6.0, and has a nice quality screen. I inserted my T-Mobile sim card and it was immediately recognized with no problems. It lacks some of the bells and whistles of an Android flagship phone, but at roughly 10% of the cost, it is pretty high on value.The first one arrived with a defective touchscreen, but BLU customer support was quick and courteous and set-up the Amazon return. The replacement has been excellent. My teenage daughter uses this one after she dropped her last phone. To me, this is the perfect, inexpensive solution when you need a decent, reliable phone but don't want to grieve for weeks if it gets dropped or you leave it somewhere. It's amazing you can get a quality smartphone for under $100.","rating":4},{"id":"R1NIH5W3U9CY0Z","title":"Absolutely love it!","text":"Absolutely love it!!!!!!! I had a Samsung Galaxy prior to this one and I adored that phone. However I bought while I lived abroad and when I moved back to the US I was looking for something that gave the same flawless service but on a budget. I've did my research on my Amazon for over a month and this one was the first to caught my eye because of price and color !!!! Rosegold is a personal favorite. I finally committed to buy it and I dont regret it. The only 'flaw' per say is how to open it. Ive read just about every review on here on this phone and someone mentioned the dent at the top with mild force... Maybe Im weak but it actually required strong force to open it up but i managed to do it without affecting the phone. Other than that it's perfect. Would buy it again and again.","rating":5},{"id":"R2NK91JGKCJF0C","title":"The phone is amazing!  Buy it now!  Click!","text":"I had an IPhone 4s and wanted a new phone bad, but I wanted the ability to expand my storage and the new Samsungs and of course I phones had a set storage and be locked into a contract.This phone has more than passes my expectations for a cheap smart phone.  Its pretty badass for a phone and I haven't had any lag at all and I opened a ton of tabs to see how much it could take.  All the apps are fast and the screen is pretty nice.  I also notice there isnt a lot of bloatware on the devicr.  It only had amazon apps on It and thats it!You can also go into the settings and really do a number on the phones graphics.  Meaning you can shapen the images such a saturation or sharpen.  Its like adjusting your TV, but on a phone.So should you buy this phone?  If you're an Apple or Samsung fan boy you may be pleasantly surprised there are other companies making good phones that don't cost 4 months of pay to buy.","rating":5},{"id":"R1DFSZWOZIHZ2I","title":"Happy with this phone.","text":"This is my first time ordering a phone off the internet, and honestly i'm not disappointed. I was scared it wasn't going to be a good phone considering I saw a lot of bad reviews after I had already ordered it. and like most things people can buy online, its a 50/50 chance you're getting a good quality, or a bad quality item. But I would count myself lucky since this phone seems to be a good quality so far. I have not found any problems with it. It responds fast, and the whole GB is not much, but I did make a purchase on a more spacious SD card. which makes it even better.I so far have only found one thing that slightly bothered me,when I went onto YouTube sometimes the videos go green, and I had to re-enter the video to get it to be normal. Other than that though. this phone is a good phone for this price.","rating":4},{"id":"RIO0RRQ0HJZVW","title":"You can't beat it for the price. You just can't. Acts like a 300 to 400 dollar phone!!","text":"You can't beat it for the price!  It is responsive, and I would consider it perfect if it had an eCompass (if you want to run Astronomy Software to locate Stars and things in the sky in real time, get a different phone since that needs an eCompass for direction). The battery lasts a full day with normal use, but 2 days would be better (or 3 or 4 or 5....<grin>).Here is an update after using the phone for many months.  I still love the phone. I bought a protective case for it since I drop it a lot, and it has hit the ground (asphalt roads) several times and has NOT failed me yet.  BUT, my biggest complaint is LACK OF MEMORY for APPS. 4 GB is just not enough. I have to pick and choose, and even when moving everything out to the SD card that can be moved, I am still short tow apps that really want to load but simply can't do it.","rating":5},{"id":"RY712W2KR7B","title":"Great phone for a low price.","text":"Bought it for my mom due to my dad needing a new phone, he got the blu Advance 5.0 she got the Advance 5.5. One thing I don't get is why blu doesn't advertise it as the Grand 5.5 which it is? Screen looks crisp, colors are bright, haven't really tried it for gaming. Would buy it again.","rating":5},{"id":"R3QN8IJ7MU6WXQ","title":"Great phone","text":"I love this phone loll . I even woke up one morning and it was laying in a bucket of water that was beside my bed . Couple days later the battery dried and it started back working. All phone wouldn't do that but it lasted me for about a yr and a half until I wanted a new one.","rating":5},{"id":"RP99Q96PAGE71","title":"Great Phone especially if you are on a budget","text":"Great Phone especially if you are on a budget. Some might argue its worth paying more for flagship phones or more durable phones, but honestly this one works fine and lasts pretty long. Unless you drop it constantly or don't take care of it properly. Phone isn't top notch, but texting and calling wise it does it's job. Only things i do not like is, it may lag a few times, me personally 1 GB Ram isn't enough, but hey its all good.","rating":4},{"id":"R37G3J1Q4PPYZJ","title":"Good phone for the right price","text":"Good phone for the right price. But battery life drains so fast. Even when not in use it'll drain unless you put on air plane mode or shut it off. Kinda disappointed about that but I needed a new phone and don't have a lot of money to spend $100+ or more on another phone.","rating":3},{"id":"R2Q3U9CIMT046I","title":"This is a great phone for the money","text":"This is a great phone for the money, it didn't come with a screen protector and a case because i purchased the used one.however, It works flawlessly, and the battery last a lot longer than many other smartphones. The screen resolution is ok.It came unlocked for AT & T however you will need to contact your service provider to register it before you can use theMedia Messages (MMS), and your existing data plan, do not waste your time trying to go around it (such as changing your settings in the access point name (APN)). The phone is already set up, but you need to register it with the service provider such as AT & T for it to work properly.overall, I like it better than my firend's Samsung at a fraction of the cost.","rating":5},{"id":"R34G1PVQAXBWK2","title":"Good only for calls or texts","text":"I have had the phone for four months now. Battery doesn't last. Maybe half a day. A lot of the apps crash. Snapchat doesn't work half the time. Camera is not good. Sometimes when turned off it won't load the Facebook or Messenger app. It's like they are no installed, however, Google Play shows them as installed. Phone re-boots often. Too many times. This is the third time I had to to restart it to factory settings and it didn't not back up my pictures in the sd card even though I asked for. The phone is ok if you are looking to just text and make phone calls. Good price. But if you want to do more than that I would recommend something else","rating":2},{"id":"R243I2BXI5SCGH","title":"This phone is very good quality, very fast open applications","text":"This phone is very good quality, very fast open applications. It has a very good relationship between quality and price. The screen looks great and has dual sim. Its software is Android 5.1 Lolipop. I recommend this smart phone if you want something economical and functional.","rating":4},{"id":"R3BMDD534I23C8","title":"So glad I bought it!","text":"I purchased this for my husband, I like the HD camera better then the none HD version that I got. However everything else about the none HD version I love better then this one. Still I'm so glad we bought these phones, everyone keeps asking us - what kinda phone is that?? Works fantastic. I will say... I had to actually look up on youtube how to open the back part to insert the battery and sim card - really hard to open.","rating":5},{"id":"RYB70TIEZXLO4","title":"Good basic phone, don't over estimate what it will do...","text":"First off, don't forget what this phone cost. As a backup or temp phone it's great. Typical fashion with blue it comes with extras, screen protector installed, plus another in the box, case, earphones, power brick and cable.In unlocked phone/Blu fashion, it has a dual sim setup. Work number / personal number setup, instead of carrying two phones around.I like the FM radio it comes with... Such a simple addition why don't $700 phones include it?I like the lack of bloatware preinstalled, I will put the software I want on it thank you very much.Even though it is a cheap $$ phone, it doesn't seem cheap. I've held more expensive phones that felt cheaper.This a transitional phone for me, I don't feel like I wasted money on it...If you are looking to buy a cheap phone to play games you know won't work on a phone at this level, why try? I've dealt with people who need a $2000 computer and try to buy the $100 one to do what they need. They are upset when it doesn't and then badmouth the computer for not working. This is a very basic phone. I talk text and get directions with it. It works fine.","rating":5},{"id":"R16UDQGVP25RDW","title":"excellent product","text":"excellent product","rating":5},{"id":"R1YXQLWLS13D6","title":"Five Stars","text":"Great product","rating":5},{"id":"RLATI5HAW4SNR","title":"Five Stars","text":"Good Price Good product. I really love this product's simple design and relatively good features for cheap price.","rating":5},{"id":"R1WC5ED9H9P4ZZ","title":"Good","text":"Works great","rating":5},{"id":"R2BN8O2WMJ5Q3V","title":"Five Stars","text":"thanks","rating":5},{"id":"R33O2ZC6S0YYJD","title":"Nice phone for the price but it only get 3 ...","text":"Nice phone for the price but it only get 3 stars from me cause of limited memory space, u can only download 3 or 4 Apps","rating":3},{"id":"R3ST0XAGZHZEH","title":"Five Stars","text":"Beautiful phone, feels very sleek love the feel.","rating":5},{"id":"R31IXRJMRKYTR4","title":"Five Stars","text":"Good reliable cheap phone.","rating":5},{"id":"R1T7JQSATIDF2V","title":"Five Stars","text":"Ok","rating":5},{"id":"R3IR0R6P6OQIKU","title":"Four Stars","text":"good","rating":4},{"id":"R1M3V8CYSS6HI9","title":"Love it!","text":"I have bought FOUR of these phones (2 for me and two for my parents) from BLU and they have always worked AMAZING for us. I and my parents love the phones so much. They do everything we need and are 1/4 the cost of any other smart phone currently on the market. (It helps that I have not has one blow up like some other phones out there.)Don't get me wrong, if you are looking for the newest high-tech thing-a-ma-bob this is not it. This is a basic smart phone. Battery life is decent if your not running apps constantly and the phone is more then average.  For people on a budget (Aren't we all?) this really is the best you can get for your buck.I've never had an issue with it technical wise. It's user friendly and has a decent screen for easy viewing.NOTE: If you try to play lots of games or apps the phone will overheat. This is it's major flaw: Games will have this phone cooking in no time. However, apps like Pandora or FB seem fine. f this is a major thing for you then look elsewhere for your phone needs. Still, for this price is that is the biggest issue with the item then it's still in pretty good shape.BTW: I only got two phones for myself is because I am brutal with my phones. They fall out of pockets, out of my hands, etc.","rating":5},{"id":"R23VREEOAZSD64","title":"Stupid amount of phone for that money","text":"First things first, I bought this phone for a very specific reason. I needed something temporary in between my old one breaking and a new one shipping out. This was never intended to be a forever phone.That being said, the phone performed fairly admirably.Pros:- decent battery life for all day use- Dual SIM- Expandable memory- Fairly stock Android, not a lot of bloatware- large screen- decent form factor- Price! Stupid amount of phone for that money.Cons:- dim screen- internal storage is abysmal for what apps want in this day and age. Even with just Google apps, I ran out of room right quick- ran into a boot loop problem twice in the month I used it. Had to factory reset to get it to work again.- Browsing the internet, switching between apps was slow and sometimes choppy.If I was in the same situation I was, I'd probably buy this phone again. Despite its failings, it served its purpose with just a couple hiccups.","rating":4},{"id":"R2F1UPQMXVSGWV","title":"EXCELLENT BUY FOR THE COST.","text":"I'ts speakers need to be louder,  Dual sims so you can have two phone lines.  I have TRACFONE on mine.  Prepay in minutes and save money. You could use any prepay for the it so long as it's not CDMA .  I lost my last phone worth 500.00 and so I am not investing into any phone tath cost that much so this is a great buy and a great add as it does everything that a 500.00 phone does.  It's a prime phone so I get offers and ads but I actually like to see what's out there in products, so it's no hassle.  It's of course loaded with AMAZON apps, but I'ma a amazoner so that's not problemo for me.  Good so far.","rating":5},{"id":"R1MA0J8AYYLVGO","title":"Go for the higher end BLU unless you need a basic device.","text":"The phone works fine mostly. I can't complain for the price. The processor is fast enough, the features are OK. My major issues are the touch screen seems too sensitive when scrolling in some apps, and the memory management. I that it didn't have any usable internal memory, so I set the SD card to be the destination for downloads. It still goes internal and I have to move everything myself.","rating":3},{"id":"R19NOZJN86RS5R","title":"Even if you store all the apps to your external SD card like I do","text":"I'm not one to have a million apps stored  on my phone or have open simultaneously, but the dozen I do have which are work related,  I use frequently.  I thought this would suit the bill with the dual sim slot which would come in handy for work, but knew that 4GB or Ram wasn't going to be enough, so I installed an 8 GB SD to  help it out.  What this phone lacks is RAM.  Even if you store all the apps to your external SD card like I do,  You will run out of RAM and will get the notification that you must delete something in order to load the program.  Don't expect to load more than a dozen apps on this phone.  With that said, everything is fine. I have another three weeks before the option to return it ends and I have another one coming from Amazon this week.  For a few more dollars, get something with a little more RAM - at least 1.5 GB or more.  This will make a  good back up phone when the need arise.","rating":3},{"id":"R2Z2G83NN1S8S2","title":"If you use lots of apps, don't buy this phone.","text":"It's a nice phone but after using it for the past 7 months, the lack of internal memory and low battery life (even with wi-fi turned off it must be charged daily) is driving me nuts, especially the memory. I've moved every app I could to the SD card but still run of memory. I've installed a dictionary (200MB), Dropbox (140MB), Messenger (106MB), Whatapp (50MB) and a few small apps which total less than 100MB and that's it. Full. The Google apps use over 500MB and can't be moved to the sd card.","rating":3},{"id":"R2TNRNYEP6SRAL","title":"BLU is the best value smart phone company in the world.","text":"Probably the best value I have ever gotten from a smart phone purchase. I love this little work horse. Get a 64 GB micro SD card and this phone will service all your basic needs and then some. I have convinced 6 people to buy BLU phones since I got mine and they are all thanking me. This is truly a great company and we should all pay attention to their entire line. My next phone is going to be one of the $200 phones. I can't go on enough about the value of this phone. Just get one for a laugh like I did, thinking I'd have it a month or two till the next line of Samsung comes out...and I just decided to ride it out cause I really don't need the Galaxy for anything besides the camera.The camera on this phone isn't crap but it sure ain't like the $600 phones. It's 5 megapixels, not bad, like the cams that were in the best phones 4-5 years ago. i never expected anymore for the price and this phone always surprises with what it offers...for $60!!!!!!!!!!!!!! Crazy. I love BLU","rating":5},{"id":"R1SX4FUCDRR0IC","title":"This is a really sturdy phone. I bought it specifically to be used ...","text":"This is a really sturdy phone. I bought it specifically to be used by my 3, now 4, year old. It fits in her hands better than a tablet. I also purchased a good screen protector for it. This thing was dropped, kicked, licked, slobbered on, and generally mistreated by her and it kept on ticking. The final disgrace was when she stuffed playdoh in the charging port. There was no coming back from that. It lasted quite a lot longer than I expected. I am planning to purchase this model or something similar by the company in the near future.","rating":5},{"id":"R3LM5KECWEK8Q9","title":"It is not 4G LTE but it has EXCELLENT signal on AT&T and its running on android 6","text":"I got this for my girl friend. SHE LOVES IT. It is not 4G LTE but it has EXCELLENT signal on AT&T and its running on android 6.0 marshmallow.2 sim slots , Sim 1 is a micro Sim 2 is standard size. Uses WIFI well and it's just a nice little phone with a crisp clear screen. 2 Drawbacks, the back of the phone is difficult to remove and she dropped the first one getting out of her car and the screen cracked despite being in a case because it landed on the corner. I recommend you use a 9H hardness glass screen protector to avoid this issue.","rating":4},{"id":"R3C77IRWXT064I","title":"My husbands new unlocked phone, its a winner. ( 1month so far)","text":"So far this phone has been a life saver for my husband. He's on net10 and they really don't sell phones where we live anymore. So instead of pay a ton of money on their website we got this on. I must say I was shocked this phone is nice, I've never heard of this brand. I did purchase the 1$ sim card, it was on in like 30 mins. It comes in a nice little box with..... A charger.. ear phones... and a case...now the case isn't fancy but does the job and the ear phones probably do too idk I haven't used them. The picture is clear and get this the speakers are in front its plenty loud. (Something I look for) I don't know much of the operations on this phone since its not mine, but I asked him how is it and was everything OK he said its great. Its 1 great thing I noticed, and I've not had a phone with this feature...they have a flash for both cameras, and they take a great picture. I was in aww.","rating":5},{"id":"R333SZPLGZ3FMD","title":"it's one of the best available and I've recommended it to friends","text":"I've always been an android phone fan.......I'd previously had 2 different LG phones before purchasing this BLUE Advance 5.0 and I'd never talked to anyone who'd ever had a BLU device,.so I wasn't sure what to expect.  Well I'm hooked! For the price, it's one of the best available and I've recommended it to friends! It's ease of use, it's quality it's great!  No doubt this will not be my last BLU product purchase!","rating":5},{"id":"R2Y1LUI4REIJ9B","title":"Judging by the price this phone is awesome. The only issue is the capacity for the ...","text":"Judging by the price this phone is awesome. The only issue is the capacity for the really heavy apps like games but i buy it just for work and i have no problems, is very fast and the dual sim is a very useful advantage when you need to get with you the company number and your personal number. Now i don't need to have two phones with me anymore","rating":4},{"id":"R3R74JL3ONTDGT","title":"This phone does do good as far as reception and has a really nice ...","text":"The BLU Advance 5.0 has 4 gigs of memory, however 2 gigs are unusable because they are dedicated to the OS. After adding Facebook which is aprox. 400mb, this leaves just over 1.5 gigs. I have added about 8 other apps including Pandora, yahoo mail, facebook messenger, and chrome. I am out of storage. I have set apps to store to SD card however they will not. Once I download an app IF it will be allowed to store to SD card I have to manually do so. At least 3 times a week I have to clear cache and delete messages due to the fact that I am out of internal storage space. This phone does do good as far as reception and has a really nice screen.","rating":3},{"id":"R1YBEIS12M8LY1","title":"Not happy","text":"Not a phone I would buy again. The speakers are very weak and if you're a devoted app person this phone has very limited storage. I'll have to research my next phone instead of buying one in a hurried pace. As smart phones go this is a did.","rating":3},{"id":"R15FMMH2SHV2VI","title":"Not signal horribly made","text":"Took the phone to MetroPCS as described in the ad they turned it on and I was unable to get any type of signal at my house where I previously was able to get a signal from Samsung phones and any other phone to use on Metro PCS. Not a good choice it will never purchase another one of these phones again","rating":1},{"id":"R1CSJQBAN9FFM0","title":"Incredible Value","text":"I really can't believe how much value I got for this phone. If someone had given me one of these, I would never have guessed it was a 60 dollar phone. I bought it just to use for a few weeks when I switched plans but I may stick with it for a while.","rating":5},{"id":"RDRUM06O63WZM","title":"Great phone","text":"I had tons of blu phones but I like this 1 at the moment. Nice size screen, slight bigger than a galaxy s6, but still fits nicley in your hands ( I had a blu studio xl, huge screen I loved but it was prone to more accidents and I definitely had to use 2hands lol.) Speed still fast, and it looks just like the pic (its not as slim as my other blu phones) I would give it a 5 star but I got the gold and it kinda looks pinkish rose gold. But I still get a lot of complements, people always think its a new HTC or galaxy till I say blu","rating":4},{"id":"R39TKZ9SMQGJT0","title":"Maybe yes, maybe no","text":"This is a very nice smart phone. The onboard memory is only 4 Gb. You need to keep about 1 Gb free for operation, so you must use the auxiliary micro card. It's laborious to manage the memory and hard to get stuff stored on the card thereby free the onboard memory. This is an ongoing problem. The phone is clean, easy to read and operate. It takes two SIM cards and a technical degree to figure how to implement the second line. Even my carrier was stymied. Therefore, I may yet return the phone. Try everything and make sure. It may not be the panacea.","rating":4},{"id":"R2DUTM5O6L1CWQ","title":"was not the one i thought it was. i ...","text":"was not the one i thought it was.  i thougt it was the 7\" its not at all.  didnt even come on when i got it cord didnt work.  had to go buy a cord. to make it work.  it also charges slow","rating":3},{"id":"RA547V7C3ULWB","title":"It's ok for the price if you don't need a sim card","text":"I am not happy that it did not come with the sim card. I had to order that separate. Also, the screen protector did not go on right. Most have this tool that gets out the bubbles. This did not.","rating":3},{"id":"R2CY2PQYTOHT2E","title":"Five Stars","text":"Still working perfectly.","rating":5},{"id":"R2QB6412OYP0HI","title":"Four Stars","text":"Ok","rating":4},{"id":"R1M4Y7HYGGW8I7","title":"Got it as a gift to someone in India and the phone became useless. Since it was sent to India","text":"This phone stopped working in 2 days. Got it as a gift to someone in India and the phone became useless. Since it was sent to India, I am unable to return this as well.","rating":1},{"id":"R2VVGGCP4SH69M","title":"Good deal","text":"Arrived in perfect conditions and with 50% battery. Could easily start using it. The image quality is good. Does run Pokemon Go, Whatsapp and other applications. Good deal.","rating":5},{"id":"R3UJJ3FCVQLLAW","title":"Five Stars","text":"It's cheap, it lags, but I knew that when I was buying a $50 phone.","rating":5},{"id":"R2USNPFJZVMKM2","title":"No memory bad customer service","text":"The phone has very little usable Internal memory and will not use my SD card for storage for anything. Called customer support and they told me that the phone will only use the SD card for pictures and such and not apps. Meaning the phone is practically not usable for apps . Even after deleting apps to clear up space for memory it doesn't update the memory and shows just like the app is still there. Customer support was horrible and made it sound like they didnt care. This is my second Blu device that I have personally owned and it will be my last.","rating":1},{"id":"RF8A7PY3X424Y","title":"This phone is exactly what it seems like - a cheap phone","text":"This phone is exactly what it seems like - a cheap phone. It was buggy from the moment I opened it, slow and glitchy. There is not room for many apps on this device either. I was only able to install a banking app, WhatsApp and a GPS app. (I purchased the phone to travel overseas with). If you lower the brightness below halfway, the screen will fail to turn back on, requiring you to pull the battery out. I dropped this phone once, from seat height, and now the screen no longer works at all. It is essentially bricked.","rating":1},{"id":"R2I8ECAZXD6401","title":"Phone looks amazing. But looks are deceiving","text":"Phone looks amazing. Feels good in my hand, and is easy to setup. But I'm very disappointed because it only has 4GB of memory on it. At first I thought buying a SD fard from Walmart would fix that. But apparently this phone is incapable of reading a SD card so i literary cannot download more than two apps and I'm very mad about this. I will be returning it!!","rating":1},{"id":"R2Q84KP7ETFUC7","title":"Excellent phone for cheaper price than Apple 700","text":"Excellent phone  for cheaper price than Apple 700.00 phone","rating":4},{"id":"R1AEF40S1CCXDS","title":"Five Stars","text":"This is the whole package! Very well built and it comes with a case and a protective screen.","rating":5},{"id":"R2DUTM5O6L1CWQ","title":"was not the one i thought it was. i ...","text":"was not the one i thought it was.  i thougt it was the 7\" its not at all.  didnt even come on when i got it cord didnt work.  had to go buy a cord. to make it work.  it also charges slow","rating":3},{"id":"R1XI4P9QX77N1V","title":"DON'T UPDATE","text":"More and more things to hate everyday. This is a good phone at less than $100 but there are soo many problems.The lack of storage space. I have only a handful of apps and when one needs to update I have to delete it along with another so that there will be enough room for the install. Then I have to find my login info as well as change the settings to my preference.The MediaTek processor is slow which causes some functions to hang. When I play Pokemon GO, my avatar will freeze in one spot. If I want him to follow my GPS then I'll need to restart the app. Sometimes during a 2 hour tour of downtown, I'll have to reload 12-15 times.The latest thing is the wonderful fact that BLU pushed an update. I figured this update would actually fix some issues instead of creating more. \"Blu help - Warranteer notification\"? I don't want to activate my warranty and I don't want to see this notice anymore. Some of my apps use the overlay feature, but with the new update I can't get any pop up notices from Facebook messenger when I have Pokemon GO running (and that's all the time) Also along with Pokemon GO, the battery life _was_ amazing. The update must have added a number of background processes because I'm no longer getting the amount of playtime I once was. Pokemon GO also, now, shuts down unexpectedly...This was a good phone at this price point if AT&T 3G coverage is fast enough. Or if you want a free hotspot. Or if you need less than 15 apps. Or if you aren't easily frustrated. I've since purchased a Huawei Honor 5x that I love, even at double the BLU Advance 5.0 HD price, it's been a great investment. I still use this phone as a backup but with the update I'm about to learn how to root a phone.","rating":2},{"id":"REM2ELHGOCMOU","title":"No logistics","text":"Impossible to get needed OEM parts and no one makes after-market.  Forced to pay high return shipping and labor costs to get something cosmetic fixed and that means being without the phone too long. The low cost means a lack of logistics.","rating":1},{"id":"R2JT14GFJJXDPB","title":"I don't like this phone","text":"I don't like this phone. No matter what size memory card I put in it it always says memory full and cannot download anything. Yes I switched the settings from phone storage to the card.","rating":1},{"id":"R3R2SVDRB4QH1Z","title":"I feel like this wasn't as great of a buy as I ...","text":"I have had this phone for 7 day to the day and I am already having screen problems. The screen is just black and you have to reset the phone just to get the phone screen to work and that is even hit or miss. I feel like this wasn't as great of a buy as I thought it was going to be, It turned out to be a disappointment.","rating":3},{"id":"R2PPWYAY4COZIU","title":"Brilliant phone for the price","text":"Brilliant phone for the price. Touch screen is a little weird - not as responsive as what I'm used to. Battery life is something to be desired but does the job in being a standalone tool 2 run 2 apps. Haven't found a better product for the price yet.","rating":4},{"id":"R19V3OU09SXK0M","title":"Good smart phone!","text":"Phone worked well in  Mexico with a Telcel sim. I used it for phone calls and camera, not data. Has a very small internal memory but compares well to my Samsung S4.  Does the job.","rating":4},{"id":"RYA4MA9HTRCCP","title":"Nothing but problems","text":"I bought this as a gift for my husband and I am so embarrassed by how terrible this phone is. It has been nothing but problems since day 1. First, he set it up to have a pin lock, and after turning the phone off and turning the phone on, the pin no longer worked. No, he didn't forget it or enter it wrong, the phone just didn't recognize it. Next, minor problems like poor UI on mms texting (issues saving pictures sent through text) and dark screen lighting, and now the kicker - after 2 days of use, the touch screen has become unresponsive. We can't even get it to factory reset to see if that will help. So now my husband is without a phone until we can send it in and claim insurance on it. Buyer beware! You get what you pay for, and this phone is a piece of garbage.","rating":1},{"id":"R1X6IF1Z73NHRF","title":"Works Great","text":"Got it for my wife who is going back to school.  Replaced a flip phone with this smart phone.  works great with Consumer Cellular sim card.  Got it in white so she wouldn't pick mine up.","rating":5},{"id":"R8N4QW83CXYSH","title":"Five Stars","text":"Good little phone for the money.  Has held up better then the over the counter prepaid phone it replaced.","rating":5},{"id":"R5FB6T5AA7A92","title":"Crippling lack of memory ruins what could be a decent phone.","text":"Interesting for the price point, but you'll be running a very old version of android, so a few popular apps (especially Snapchat) may not function well.  Overall the phone runs well but is absolutely, devastatingly crippled by its abysmal memory combined with a ton of google bloatware installed at the start. My device was incapable of recognizing SD cards, and could only install one or two apps. Spend the extra thirty and buy a refurb moto G, it'll save your hair from an absurdly slow phone with few apps that run badly on it. Would be good for children though, but still glitchy overall","rating":2},{"id":"R2YT2498X612TS","title":"Super","text":"This product it is excellent.","rating":5},{"id":"R8JMOJVA4AQKU","title":"Works","text":"It is what it is a cheap telephone but it does work","rating":3},{"id":"R1LOW6LGUHO2BR","title":"Basic but very useful to travel.","text":"It is basic but useful. The most important thing is that because I travel out of the country often it is very convenient to have an unblocked phone that takes two SIM cards.","rating":4},{"id":"R1CRWN2SZGD30M","title":"... a gift for my teenager he seem to be happy with it","text":"this was a gift for my teenager he seem to be happy with it","rating":4},{"id":"RCD2N1KK29USR","title":"Five Stars","text":"good value of money and working very good","rating":5},{"id":"R4XVWOMRJZM20","title":"Five Stars","text":"It was exactly what I was looking for.","rating":5},{"id":"R2ISX2LPRSPZKR","title":"the best. Dureble","text":"For the price, the best. Dureble. Love it","rating":5},{"id":"R1I5HF4T7VJKB1","title":"Fooled me, but never again!","text":"I found the reception to be very poor. The phone was overheating and actually scorched the protector that was provided. I tried to register the phone but couldn't post. The connection was always not supported so it was hard to download files. In about 2 months the charging plug became hard to use and consequently fried the phone. I don't think I'll honor buy another especially if its only good for two months and Amazon won't allow a return and I can't ask the supplier due to the failure to register for the warranty. I should have known better. This was not a 4g cell!","rating":1},{"id":"R2LGK48PEQXFFB","title":"Five Stars","text":"excelente","rating":5},{"id":"R3QWNX01MQF7WP","title":"A nice and big keyboard for my father","text":"This phone is a gift for my father. It has everything that he needs and more. I wanted a cell phone with a big keyboard and screen. Works fine and is very easy to my father to use it.","rating":5},{"id":"R1QD661WOUO50V","title":"Touch screen is not as good. But","text":"Pros -1. Price2. Android3. Size and looksCons -1. Touch screen is not as good. But, still good for the price","rating":4},{"id":"R22KHN22OMIKWK","title":"BLU Advance 5.0 - Unlocked Dual Sim Smartphone.","text":"Purchased for a gift to use with pre-pay T-mobile service and working out of the box , and she loved it , for the price really not complaints , it charge fast , the speaker was loud enough and better than Win8 phone she had , nice clear screen , so far nothing bad I can say about and the fact that is cost so little it is hard to even complains , the main reason of the phone is calling and checking e-mails or surf the web or youtube or talk on skype , and this is perfect phone for it . The back camera has also LED flash and do decent pictures , 2 sim cards and SD storage , battery can be replaced as well what is a plus .","rating":5},{"id":"R1D4KWYEEGLJO0","title":"Four Stars","text":"Good price., no to good the product quality","rating":4},{"id":"RK4DGAL5H98V2","title":"Not highly priced but the performance of the phone is awesome!","text":"This phone is ideal for a starter to smartphone life or as I would say, for a rugged teenager. Not highly priced but the performance of the phone is awesome!","rating":5},{"id":"R1PZBPJWFN332P","title":"Five Stars","text":"Great price - works great - perfect size.  Love this phone, not fancy but it's all I need.","rating":5},{"id":"R3M5A01NN37WZR","title":"not recommend","text":"Hello, I'm from Venezuela, when I got the phone everything worked fine, then at 15 days and the phone did not appear on the screen, that is, if the phone was in silence I did not know if they called or not because they did not The notification of the incoming call appeared on the screen, and if I was not quiet I only found out that m was calling for the sound since the call does not appear on the screen. As I am from Venezuela I could not return the phone as it would be very expensive, but I really do not recommend them.","rating":1},{"id":"RWBJVIL6LG6Y6","title":"Does The Job","text":"My aunt loves this. Bought this for me aunt in the Caribbean. It works with no problems.","rating":5},{"id":"R9J30XR2Y5GXW","title":"Love this phone","text":"Love this phone, never had any problem with it, simple sleak.  It was only 2G so we had to get 4g phones.","rating":5},{"id":"RQDV7LWJKMN3E","title":"Good find","text":"Can't say much but it works...and does the job and happens to be a smart phone.","rating":5},{"id":"R3D43XDYK1162M","title":"I think is a excellent phone for low/medium uses","text":"I think is a excellent phone for low/medium uses. Bought two, for my mother and mother in law. Phones comes with silicone cover and screen protector, in addition an earphone an the charger. Be careful when open the phone to insert the battery and the SIM cards, this is not intuitive and you may damage your phone. There is one review here explaining how to proceed with this issue.","rating":5},{"id":"R1KVAQWQET8ZZQ","title":"Five Stars","text":"i love it, works great","rating":5},{"id":"RD11YO4LWH4A8","title":"Happy with this phone.","text":"I am very happy with this phone. I replaced a Samsung Galaxy s3, which ran Android 4.4. The BLU 5.0 has given me no problems (I can even set up a Wi-Fi hot spot, which never worked on the Galaxy), and It has a very nice look and feel, particularly for the low price. I purchased a 16 GB microSD for picture, music and app storage. The only drawback so far is that there are many apps that cannot be moved to the SD card, so if you are app crazy, you may not be happy with the limited system memory space.  There is only about 500 Mbytes not being used by the system.","rating":5},{"id":"RB6U3PRVVA9S3","title":"The phone is great for the price and I love how well it ...","text":"The phone is great for the price and I love how well it works with my t-mobile sim. I used to be on sprint and could never get reception, then I switched to t-mobile and couldn't get reception with the phone they sent me but the BLU Advance 5.0 works great with my t-mobile number and my google voice number.The only problems I have found is when it updates the phone it removes some of the apps from my home screen and it is really starting to piss me off. Also, after moving apps to the SD card it moves them back the the phone memory after an update, really annoying when it doesn't have much phone memory to start with.All in all, it's a great unlocked phone for the price and if they don't fix the issues above, I guess it is still a great deal","rating":4},{"id":"RAUYII2J8MN11","title":"His is still working fine but I turned mine on today and it went ...","text":"Hubby bought us both one of these on July1st of 2016, I think was the date. His is still working fine but I turned mine on today and it went directly into \"factory mode\" it said at the top. Had a list of \"GPS, color test\" and several other things. Screen also said  at the bottom \"Home, turn off\" and I forget what else, but the phone would not obey any of its commands to do anything. It was just on and stuck though I tried to click many things.Left it sitting, went shopping, came back and still that way except it finally said a color test was completed and told me GPS is on, LOL. Still it will not turn off or reboot.Now am trying to find out how to get this phone replaced but I don't yet see here at Amazon where to click to start such a thing. I'll figure it out.","rating":3},{"id":"RWYQ71FZVG61R","title":"Excellent Phone on a Budget, with a few minor flaws.","text":"I've owned this phone now for two months and this is what I think: For it's price, you cant beat it. Even now I am surprised with it's clear pictures and decent speeds. I've never had the device crash and even fall below 50% battery after a 7 am - 7 pm work shift. I am a college student and the interface is easy to understand for all ages. The only down sides I've ran into is the device memory and microphone for voice communications. Device Memory is easily filled with apps and cached data, and this is easily fixed via a $10 32 gb mini-sd card. So in this regard, this phone is for the business aspect, not a gaming one. As for voice communications, I get a lot of \"I can barely hear you\" even with my mouth close to the mic. This is mostly due to a case I purchased for the phone, so be mindful when purchasing one. I've used iPhones and high end Samsung devices in the past; and this is easily one of the better phones I've had, even on a budget.","rating":5},{"id":"R32TGJGMXEJ0UQ","title":"Love it arrived in 2 days","text":"Awesome phone didn't realize it only had 4g internal memory but it's awesome,Child I change my mind on this review the black 5.0 worked fine the white one started glitching in 2 days, blank screen, won't charge, keeps shutting down apps, I loved the phone because if size and how it looked but now I regret buying it. I both 2 one works and one doesn't '''","rating":5},{"id":"R3TUM5JI97131J","title":"900 MB Storage Space","text":"900MB storage space available to user. The cache on the Youtube app alone can fill up your storage space in a matter of days. Use AppMgr3 (App2SD) to move apps to the sd card and clear cache. For browsers, clear the cache from within the browser, do not use a cache clearing app for browsers. AppMgr3 sends a notification when apps have 1MB+ cache.The camera crashes because it's coded poorly. How do I know? Look at the camera settings. See how half the buttons have visual glitches such as black boxes? Poorly coded.","rating":3},{"id":"RYT1MOPQJDGHT","title":"I have had this phone a little over a month ...","text":"I have had this phone  a little over a month, I have not dropped it or done anything to damage it. All of the sudden, yesterday, it stopped charging. I have tried several charge cords. The phone just won't charge. Unlike many other products I have bought on here, this Amazon sold product does not have an option to message the seller. I need to know who to contact to fix or replace the phone, and I can not figure it out. I have paid 70$ for a phone that I got to use for a month.","rating":3},{"id":"R2DSTL57GRPDGP","title":"easy to handle and quick to use","text":"Phone is okay, easy to handle and quick to use. The screen sensitivity is good, but it can be a bit of a pain due to Google Now. I also downloaded a couple of rhythm games and it's simply impossible to play. I recall picking this device because it offered 4GB of internal memory, but I only got 2GB. Lollipop isn't exactly the best, so I've encountered a few annoying bugs like app shortcuts deleted from the homescreen and logging out of twitter and instagram when I turn it off, among others, but other than, it's nice. As a simple smartphone it's good; I haven't found many things I dislike about it. Also, if you use your phone to listen to music from time to time, the speaker is really nice and the sound enhancement works perfectly, but it might be tricky finding headphones that actually work.","rating":3},{"id":"R33UJE2JS180ZU","title":"It came packaged great, with a case","text":"I am extremely impressed with this phone! It came packaged great, with a case, screen protector, earphones and charging cable with a plug. It really a beautifully designed phone, its pleasing to the eye. It took a bit to get use to the power button on the side but now i actually prefer it there. It runs just as well as an expensive phone, no lag no issues. It does only have 8gb of memory and the system takes up 4gb, so keep that in mind but with my sd card i haven't had any memory issues. If you are looking for an affordable phone that works like an expensive phone, this is it. This phone runs just as well as my lg g4 did and for a hell of a lot less money! If you find my review helpful, Please click on yes, \"was this review helpful to you?\"","rating":5},{"id":"R9IQ5YV8WXW7K","title":"Very smart and economical IMO to include the case and screen ...","text":"For $70 I think you are getting your money's worth.  The phone comes with a case, plastic screen protector, earphones, microUSB cable, and an outlet adapter.  Very smart and economical IMO to include the case and screen protector as even people who are in the market for budget phones will typically have to buy those as well. For the price, or even for double the price, I don't think there are many phones that have much better specs.  The newest version android, quad core 1.3ghz processor, 1gb ram, ~294 pixels per inch, and weighing in at only 142g.I've noticed some reviews saying they had trouble opening the back of the phone to insert the battery. They are right that there are no direct instructions provided for that which certainly should have been included in a start-up manual.  If you look at the phone with the screen towards you, in the top right corner of the phone has a small indent that should allow you to open the back with a low to medium amount of force.The phone itself looks nice and runs pretty smoothly.  I've maybe noticed a slight lag when opening some programs for the first time in a while.  I've also noticed some widgets are not properly responsive if you don't open the program for that widget before hand.  Not sure if that's an issue with the phone itself, the OS, or the apps, though it's likely not the apps.If you have very basic phone needs, this phone is a prime choice especially since you don't have to buy a screen or case.  As for the earphones, I would have gladly paid something like $3 less and not have received those.Also, since there's a Pokemon GO craze going on right now, this phone can play the game but not on the augmented reality mode since I do not believe it contains a gyroscope.I've only had the phone for about five days so I will update the review if my opinions change on it.Edit 1:Have had the phone for almost three weeks now and am still very satisfied with my purchase.  I forgot to mention what carrier I am using.  I am on T-mobile and everything seems to work just fine, even though on the compatibility rating it says \"partial\" coverage for 3G and no coverage for 4G.  I'm sure there is a very technical explanation for all this, but my phone usually tells me I'm on 3G or 4G when I'm not connected to wifi.  Battery life seems to be pretty good.Edit 2:Have had the phone for a month now and still like it a lot.  I am having some issues with the headphone jack, however.  When I plug in my headphones, sometimes it doesn't register to the phone for some reason and while sound comes out of the headphones, it doesn't cancel the sound coming out of the speaker.  I've tested this with multiple pairs of headphones so it seems to be a problem with the outlet.  If I plug the headphones in slowly then it works fine.","rating":4},{"id":"RUJ7X0UIFB9FK","title":"Does what a typical Android phone does but for half the price!","text":"After reading all the reviews about this phone over & over again and weighing my options, I finally purchased the phone and was able to receive it that same day. I had low expectations, assuming that it would have very low quality screen & horrible resolution, horrible camera quality & little to next to none storage --- BUT... when I did a thorough look at the phone it was a very nice decent Android. I assume that the screen would feel like plastic but it's GLASS, nice smooth touch to it. (Since it was hard glass, I quickly ordered a tempered glass screen for protection.) The back cover had a great texture almost imitating leather with a rubber feel to it. I purchased the phone in the color white (It was a nice pure white/clean) so I also bought a case to protect not just the phone itself but the color so that it wouldn't dull over time. I don't take pictures much & Im not too big on downloading apps so the storage issue wasn't bothering me much but I did stick a 16gig SD card in just in case. (I was able to download basic apps like FB, Insta, Snapchat without any issues) Camera quality isn't all that great but it's decent in great lighting or with flash on. (I will insert a picture of my dog taken by the BLU phone) This phone has a not so great battery life, it drains as soon as I unplugged it and started using it. It'll probably only give you a few hours of life if you use it constantly on&off at full brightness. Out in the sun the phone screen can be hard to see too so be aware of that. I was able to compare the phone to my sisters Samsung Prime Core phone and it looked GREAT next to it. It felt lighter than the Samsung & looked as if I paid $100 + for it. It's not the greatest phone if you compare it to the top notch $500 & Plus phones like iPhones, Samsung's Galaxy's & etc but it's great phone to start off your teen kids with. Overall I have to say that I do love this phone for the price range and its 5\" screen size.","rating":5},{"id":"R1OYL0T186QM3S","title":"Good viewing angles","text":"This phone is a unbelievable value.  I've had all Iphone products, Samsung, Nexus 6 etc and this phone is not them.  However, this phone resets the bar on what the others should be.  Will this phone do 99% of what just about every user demands?  Dual sims work flawlessly, runs all the apps in the PlayStore.  You won't be able to just install everything your hearts desire, you'll have to manage storage memory.  There is a slot for a up to a 64 gb card for media and apps that allow you to move them to the SD card, but you'll see that few apps can be moved to SD card anymore (not the phone's fault).  The screen is not HD or Retna but it's 100% acceptable.  Good viewing angles, clear, bright, etc.  I've had phones that had poor displays and you couldn't see the screen if you tilted the phone, this is not the case with this phone.  Battery life is really really good.  I run dual sims (work/personal) and I'm 60% when I go to bed.  Build quality is much better than I expected, very solid.  Call volume is a bit low, but this seems to be a common issue with Android, not the hardware.For $60 you will not be disappointed.  You'll probably wonder what an extra $600 for a high end phone really gives you.My family member also has a Blu phone, different model, and it's been 100% for 1.5 years.  She loves it and laughs when she tells people she paid less than $100 for it.","rating":5},{"id":"RB3JXO1B59XXW","title":"Hit the ground running with this phone!","text":"This device does not have very many reviews like other Blu devices. I have ordered many Blu devices in the past, and most have at least a few hundred reviews. These have been very helpful in allowing me to decide on whether I am interested in the device. So, I will post my review here and offer some insight for those interested.In the box, you receive the typical Blu package: the phone, a power adapter, earbuds, a TPU case and a screen protector. All of these items arrived intact and met all expectations. The screen protector that came with this device had some quirks that some may want to be aware of. Unlike most screen protectors, this one was NOT completely transparent. The screen protector had a special color print for the bezel of the device, covering the white face and replacing it with a rose gold finish. This was fine, except that the size of the print on the screen protector was slightly off, making it very difficult to place the protector without covering the screen or the ports. I was able to get down pretty close, but the added printing made it much more difficult to apply.When installing the battery and SIM, I ran into the same difficulty removing the backplate of the device. Once removed, however, things were easy. Do not let this deter you from purchasing this phone. The phone booted up nicely with a vivid and colorful display and otherwise had 0 issues. A great phone for the price thus far.","rating":4},{"id":"R25ZUN9JYRHRPV","title":"Works great,  Would buy again","text":"Purchased this phone to replace a Samsung Note 1,  yes the original note.  The old phone works fine, but to slow.For the new phone, I wanted something that was unlocked and could handle 2 phone numbers.  Probably the best purchase I've made in a long time.  Phone works great and have used now for several months without issue.  With the new OS, the phone is fast and feature packed.  Don't see a reason to pay 600-700 for a phone when this has the same whistles and bells, which I'll probably never use.The new phone uses a smaller sim, so I stopped at the AT&T store and they gave me a replacement sim (free), I popped it in phone and ready to go.Haven't dropped from 6 feet or dropped it in the sink, or thrown it at one of my kids (yet), but there is always tomorrow.  Would recommend this phone to folks that want a nice phone and is affordable.UPDATE: (Mar 16, 2016) Purchased a second phone for one of the kids and I had concerns about the phone because it was shipped (Amazon shipping) in a box 4x the size of the factory phone box without packing.  So the phone was rattling in the box during shipping.So far the phone is working as designed, but disappointed with the packing by Amazon","rating":5},{"id":"R9L07MEZILKD4","title":"Filled with features, just not filled with storage","text":"For the price, it's amazing. I found very few important flaws in it. I love how it's unlocked, despite it's low price. It comes with Android 5.1 Lollipop, which means I can get most apps. It comes with dual sims and is really quite fast. If it didn't list the brand name on the front of the phone, I'd assume it would be a flagship phone. The quality of the back case is durable and feels really good to touch. I've dropped it plenty of times and it still holds up.However, there's a minor flaw that is very important. The storage is very limited. I have to regularly delete apps and clear the cache because of how I like downloading new apps often. Even with an SD card, it's still very limited due to the fact many apps are not compatible with the SD card.Overall, I believe this is a great phone. While it's limited in storage, you have all the features of a flagship phone and a little more.","rating":5},{"id":"RCYYDVE4EL746","title":"Good phone for the price paid","text":"I purchased this phone for my preteen son and he really likes it. He eve got a case for it. It has lots of cool features, it's pretty fast and the memory isn't ridiculously tiny like some of the lower priced cell phones out there. It also has a nice sized screen. The touch screen is bright and very responsive. The graphics on his games look great. The sound is pretty good, not great. The LCD screen is not very durable; it cracked a bit after being dropped not from very high up at all, but it was still fully functional anyway. The camera is okay. The photos come out pretty nice as long as the lighting is good. Low light photos are not that great, even with the flash, but that's expected. It does have the front facing camera so that you can Skype and video chat and etc...For the price paid, it's a pretty good phone, especially for someone who wants a decent phone with good speed, memory and features without breaking the bank.","rating":4},{"id":"R21EITC3O0PIGI","title":"Amazing phone! Alright","text":"Amazing phone!Alright, so I'm somewhat new to the phone scene and my previous phone was an iPhone 4s. But this phone feels amazing.First off the phone feels really sturdy and the materials are really nice to touch. Compared to an iPhone 4s the phone is HUGE, its slightly larger than my friends iPhone 6.The specs in the phone are nothing special but get the job done. For gaming you will usually see 30 ish fps on most games (that just what it looks like, could be something different). The 1GB of ram means that once you tap out of an app you will probably have to reload it.The case fits very nicely and doesn't feel too bulky either. The earbuds are usable but I would recommend getting new ones as these sound very damp and weak. The screen protector is very smooth but does have a few small air bubbles near the edge of the phone (make sure you clean the phone screen before putting on the screen protector to minimize air bubbles!)The screen itself is very nice. When looking at it VERY close you can see a few ity bity pixels but if it is a foot away you probably wont be seeing the individual pixels. I'm using AT&T and all I had to do  was put the sim card in. The phone has two sim card slots (micro sim and full sim) so if you have an phone with a nano sim card (like an iPhone 5) you will need either an adapter or a new card altogether.My biggest criticism of this phone is the storage. This phone 8GB of storage but only ~4GB of it is usable. After downloading a few games and a lot of music it got filled up. So what I recommend doing is getting a 16-64GB micro SD card https://www.amazon.com/SanDisk-microSDHC-Standard-Packaging-SDSQUNC-032G-GN6MA/dp/B010Q57T02/ref=sr_1_4?s=electronics&ie=UTF8&qid=1472489110&sr=1-4&keywords=microsd%2Bcard (this phone can take up to 64GB of micro SD storage).","rating":4},{"id":"R2LEMRN3FPOBA5","title":"Great phone for great price","text":"Great phone for great price!! So far I had no problems with it!! I'm with straight talk & it was easy transfer from my old phone! Phone works great!! If you're looking for a phone to purchase I strongly suggest BLU, you can't go wrong with this & price is great!!","rating":5},{"id":"R2RI1HENBD1J2S","title":"Five Stars","text":"Good low end smartphone.  Especially like the dual sim for international use","rating":5},{"id":"R3AJP3IKVY1EA0","title":"It's a Blu cellphone and sometimes we do not like but I recommend you this device is awesome and ...","text":"It's a Blu cellphone and sometimes we do not like but I recommend you this device is awesome and cheap","rating":5},{"id":"R31AEB1UH8PRH6","title":"Awesome phone","text":"I love it..  I have no problem with Blu","rating":5},{"id":"R34LS043VB7YJY","title":"Five Stars","text":"Great","rating":5},{"id":"R2H716IRZYN9P1","title":"Five Stars","text":"Good phone","rating":5},{"id":"RR4BBAJVFB6ER","title":"Five Stars","text":"Excellent for its price! Durable and easy to use.Works as it's described. May buy another for a friend.","rating":5},{"id":"R3BMB1JHDJ0B95","title":"Five Stars","text":"sper cell Phone","rating":5},{"id":"R25C2FG4BMJTIU","title":"Three Stars","text":"sent to Haiti after 3 months unable to hold charges  and communications very poor","rating":3},{"id":"R2N5UMGZNHDYGO","title":"Not happy with phone that won't work and cannot be returned!","text":"This phone would not pair up with any blue tooth device. I called BLU tech support. They suggested a hard reset. Did this. Now the phone will not sync with google. Called google tech support, they suggested a couple things and if it didn't fix the problem to go back to BLU. All it will do is answer calls. Now, I find out today that yesterday was the last day to return the item. I am stuck with a phone that doesn't work! not very happy!","rating":1},{"id":"R1T7PQP5OKGCDI","title":"handled very good and then just stopped working out of no where","text":"Worked for a couple months, handled very good and then just stopped working out of no where.","rating":1}]