[{"id":"R3511EDEKXO84M","title":"Good quality headphones","text":"Good quality headphones, work as described and haven't fallen out of my ears when exercising since purchase. The sound is absolutely unbelievable and incomparable to any other headphones i have bought in recent years.Shipped and arrived before expected.","rating":5},{"id":"R36DOTTPQ2MMCQ","title":"Better than apple","text":"Their louder than the apple earbuds. They have more base than the apple earbuds. There isn't a volume up or down button on the mic but there is a skip and next and previous button, they block out the sound coming from outside. Their pretty comfortable. These are way more durable than the apple earbuds because the wiring is thinker, they can handle more sweat. I've gone through several apple earbuds because of them ripping or water damage from me sweating, but with these, I've only had one pair and they have lasted me many months, I believe 2 years and no problems at all. The apple earbuds fit well inside the ear but these earbuds have a intresting shape, the little black piece that goes inside your ear, as seen in the pictures above where it's almost as good as the apple earbuds fitting. But after a while with the apple earbuds they kinda begin to hurt since their hard plastic but these have a soft cushion.","rating":4},{"id":"R1BQOM50KGT2HR","title":"Pretty good earphones","text":"Pretty good earphones. Don't think they sounded quite as good as the ones I got with my iphone but it could just be the adjustment after listening on those so long. They are loud! way louder than what I could get with my old ones. Its almost too much though I feel it kind of distorts the sound a bit. Overall not a bad purchase though. As far as the sweat resistance I can't really tell if they fall out any less than regular ear buds but hey whatever they work good anyways","rating":4},{"id":"RJ6K3FL22L42A","title":"Sound is great. Ear feel is comfortable and came with replacements ...","text":"Exactly as described. Came with a small, same color scheme clip to help cord from getting caught on things, which I appreciated. Sound is great. Ear feel is comfortable and came with replacements in case a pair doesn't fit or gets lost. I really love Skullcandy headphones. This is my third pair. First pair I jus broke. Second pair bit the dust after 3yrs of wear and tear. This is my 3rd pair and I'm sure I'll have them for a while.","rating":5},{"id":"R3JG0D2P8GCHC3","title":"Great earbuds.... mostly!","text":"These headphones are great.... for music. I tried watching YouTube videos and I just couldn't do it. But somehow, they're amazing for music! I listen to a little Pentatonix and you can hear every little vocal and you can feel the bass. And the cord for them isnt great. They get tangled  easily and it just feels cheap. But For earbuds these are great! They come with earbuds, different earbud inserts, a clip for the wire and a skull candy wristband. I recommend these to certain people who aren't picky","rating":4},{"id":"R1M7AZI8Q0K0N7","title":"Great audio quality (for me at least","text":"Great audio quality (for me at least, not the biggest audiophile), comfortable, stays in ears reasonably well. Not the biggest fan of the appearance; I thought they looked better in the picture than reality, especially with the grey color.Also, didn't think to check for this, but the L shaped connector is kind of awakward to use with a phone in your pocket. Kind of minor, but at first it would come out a lot when putting the phone into my pocket.All in all, definitely no complaints given the price.","rating":4},{"id":"RVFN6GOJG4LAH","title":"4.5 stars tbh","text":"I've owned these for about 3 months now. They sound amazing, more round and less bassy than most ear plugs. However, fitting hasnt been consistent. It is true that the new oblong earplugs do fit much comfortably. But after awhile, they find themselves getting a weaker grip within the ear. Great sounding headphones with a *good fit. Honestly, the best features are the ear rubbers and the clip it comes with. Tangled wires are now a thing of the past!","rating":4},{"id":"R27QK67D9A2L3S","title":"Good sound....mic stopped working today","text":"Good quality, I do an hour of cardiovascular everyday and lift with these...I bought them in January, the microphone just went out today. Sound still works but I like the ability to use these weather I'm working out or going about my day talking to someone. Not sure if the swear had anything to do with it...happy otherwise. Get the 4 year protection plan if you can take care of your ear buds...also save packaging if needed for returning your items for replacement.","rating":3},{"id":"R2ZV08VZ9ID3BI","title":"These are my favorite gym/workout headphones","text":"These are my favorite gym/workout headphones. I've accidentally left these in my gym shorts pockets and have washed and dried them mistakingly and they still worked perfectly.Great sound all around and I find them very comfortable. I got the pink ones because they were the cheapest, but it doesn't bother me.","rating":5},{"id":"R3I60WNJ32FRA","title":"quality is just fine. My only thing is the wire is very ...","text":"You get what you pay for, quality is just fine.My only thing is the wire is very thin and I can see it breaking on me in a couple months, also the mic sucks on this.Seems like everyone says I sound like I'm far away from the phone when talking through these headphone's mic. The button on the mic itself is annoyingly hard to press","rating":3},{"id":"R25ADHNMYUMFO0","title":"Great Buy for Price","text":"I have had numerous problems with headphones dying due to sweat and / or more intense workout environments. These fit perfectly in my ears without popping out and also help block external noise. I highly recommend this to anyone interested in some inexpensive, yet high quality ear buds.","rating":5},{"id":"RTC4SM1I1SMMN","title":"Other than that they are fine.","text":"When they get pushed deep in ur ear it feels uncomfortable. Other than that they are fine.","rating":4},{"id":"R773H5XKHGTK5","title":"Great!","text":"My granddaughter has always liked skullcandy ear phones. I gave them to her for Christmas as she needed something new. She was very pleased with the color also.","rating":5},{"id":"RHGFOJ0I1WRPD","title":"Awesome headphones for the price","text":"These head phones are perfect for me when I am mountain biking. I have never had these headphones fall out of my ear and the sound quality is solid for the price. For doing any type of physical activity, these are my go to set of head phones.","rating":5},{"id":"R7Q899KBR3S5U","title":"Five Stars","text":"Loved the stress free packaging. Produces amazing quality sound and fit snugly in my ear. Definitely a great buy!","rating":5},{"id":"R3OVZ3IWXTQNGB","title":"Great design and good sound but life span is limited","text":"Delivered 12/29ish. First pair died 3/10/17.  Great design and good sound but life span is limited.","rating":3},{"id":"R199XH8IAJUDEP","title":"Five Stars","text":"In ear stability is great. Sound quality is ok not great.","rating":5},{"id":"R84F95TIJPAI6","title":"Works like a charm","text":"I'm a true fan of skull candy , i must say this lovely earphones are the best i ever tried yet , totally love it","rating":5},{"id":"R1UFBCBJES7I3D","title":"Great quality for the price.","text":"I found these on a popular tech site's article about 'Best Headphones For Running', they had a bunch listed and this one was listed as the best under $25.  They sound fantastic for the price and they don't start sliding out of your ear halfway through being active.","rating":5},{"id":"R19WEL78UZIKVT","title":"I am happy that you can play","text":"Only wish the headphones had volume controls. I am happy that you can play, pause, and skip the song playing with the mic controls.","rating":4},{"id":"R2NFL0VU6PNEFK","title":"Five Stars","text":"These are the best ear buds out there.  I have two pairs myself... these were a gift.","rating":5},{"id":"R1HM9XDWCWGHLZ","title":"Five Stars","text":"Thank you!","rating":5},{"id":"R1PRJ04NTI5XXN","title":"Great Headphones","text":"They have bettered my workout experience, the headphones sound great and they stay in my ear a lot better!","rating":5},{"id":"R11WQQVLFBPZE","title":"I like the sound quality of Skullcandy headphones but the quality ...","text":"I like the sound quality of Skullcandy headphones but the quality has definitely dropped. These headphone only lasted me 3 months. Granted I put the headphones through a lot as I use them constantly at work, at home, and in the yard. If you are careful with them they will last much longer than 3 months but for someone like me, be ready to buy a new pair every so often.","rating":3},{"id":"R1EYG9IGL8YY06","title":"Five Stars","text":"Nice thank you!!","rating":5},{"id":"R1AWGN2UC4YS3G","title":"Five Stars","text":"Skullcandy never let me down they are perfect","rating":5},{"id":"R1KYU5VIDYCP4O","title":"I've never heard bass like this in earbuds","text":"Apart from the unique style and very grip earbuds the bass in these earbuds really stands it apart. You can really feel the bass in your ears, it plays all genres very well and adapts to equalizers very well. Don't ask me about durability because I've only had them for about a week lol, but I really love these headphones. They are way better than my old Apple earbuds.","rating":5},{"id":"R25H0I0V2CHSXO","title":"Great For Working Out","text":"Love the way these headphones fit my ear.  The one negative is the length of the cord.","rating":4},{"id":"R1WJPVOJPGJWZ8","title":"Previous Pair Got Me Through 3 Years!","text":"I had the yellow and gray pair previous to these. They lasted me 3 years, and they still work, even though the plastic is falling apart. They got me through a marathon and half marathons, training, rainy days, and lots of sweat. The sound is perfect and fairly noise-canceling. Great buy!","rating":5},{"id":"R2N65DN55MIEQU","title":"Definitely recommend these headphones!!","text":"I love these headphones!!! Was a little pricey but definitely worth it! Free 2 day shipping with my prime but got it in 1 day!!!! Came with extra ear sleeves, a Skullcandy Bracelet and a clip to clip your headphones onto your shirt and a case to put them in!!!! Definitely Satisfied!!!","rating":5},{"id":"RJCIYSRZZP72W","title":"Low quality","text":"These things keep breaking, they soind good but only until one of the buds dies","rating":2},{"id":"R1EYG9IGL8YY06","title":"Five Stars","text":"Nice thank you!!","rating":5},{"id":"R2ZYXC2G4KAIL4","title":"Great purchase","text":"Fits in my ears great! Love them","rating":5},{"id":"R1HM9XDWCWGHLZ","title":"Five Stars","text":"Thank you!","rating":5},{"id":"RS1ZX3EKQHW09","title":"pretty good for how cheap they are","text":"they're fine. normal skull candy headphones.","rating":4},{"id":"R19WEL78UZIKVT","title":"I am happy that you can play","text":"Only wish the headphones had volume controls. I am happy that you can play, pause, and skip the song playing with the mic controls.","rating":4},{"id":"R1H1QYYMRCXAN1","title":"Five Stars","text":"Great product for a great price.","rating":5},{"id":"R7Q899KBR3S5U","title":"Five Stars","text":"Loved the stress free packaging. Produces amazing quality sound and fit snugly in my ear. Definitely a great buy!","rating":5},{"id":"R2FU4I4J8LYDIX","title":"Otherwise they are PERFECT!","text":"Wish the microphone was on the right and you could adjust the volume.  Otherwise they are PERFECT!","rating":4},{"id":"R84F95TIJPAI6","title":"Works like a charm","text":"I'm a true fan of skull candy , i must say this lovely earphones are the best i ever tried yet , totally love it","rating":5},{"id":"R3OVZ3IWXTQNGB","title":"Great design and good sound but life span is limited","text":"Delivered 12/29ish. First pair died 3/10/17.  Great design and good sound but life span is limited.","rating":3},{"id":"R3GBZEV1ET4PPX","title":"Great for daily use!","text":"After a year and a half of use, I still really love these ear buds. I originally only bought them for exercising, but I ended up using them for my daily commute. I used to buy Sony earbuds, but they would never last longer than a year at best. Good sound quality for the price, reliable even in the rain, and I'm glad I purchased them!","rating":5},{"id":"R8PNNYMLICL38","title":"Five Stars","text":"Hella cool.","rating":5},{"id":"R2IP5V14GYFFE1","title":"Coast $30 plus supposed to be a good brand and didn't even last me a year","text":"Coast $30 plus supposed to be a good brand and didn't even last me a year! I don't even use them much.","rating":3},{"id":"R1LL28XMURTHY7","title":"Four Stars","text":"Son is happy so far!  Hope they last","rating":4},{"id":"R30F08UNP8LZD7","title":"good grip and durable","text":"Gread sound, good grip and durable. No complains till now.","rating":5},{"id":"R3P03SVR85WFIE","title":"Five Stars","text":"great for smaller ears","rating":5},{"id":"R2ZOO4EL2Q4Q2M","title":"Worth the price","text":"Very loud, and amazing quality. If you earphones with bass, these are the ones to purchase.","rating":5},{"id":"REW4J6KM3V38Y","title":"Five Stars","text":"Great product! Used them for everyday listening, not just excerise!","rating":5},{"id":"RZOBILM5JOEM0","title":"Five Stars","text":"Came in fast good quality light worthy comfortable and rich bass","rating":5}]