[{"id":"R1N4HHH0GVVWPW","title":"Five Stars","text":"Great product. The phone arrived as new and has been working perfectly. I'm 100% satisfied with my purchase.","rating":5},{"id":"R1GS7OK14JPXCD","title":"Nice phone. Make sheer you know how to buy","text":"When I got the phone it was nicely packed. The phone is. Brand new. Just make sheer that when you go to Buy one don't click add too bag.scroll down a little even if it's and click. new from whatever number of phones they have left in stock. And it will show you all of the seller ratings out of five. And there positivity rating pick the one that says 99% or 100% feed back. Even if it's a little more","rating":5},{"id":"R2PHZA4DL66JCU","title":"It works great. It hasn't overheated or the battery isn't damaged ...","text":"It works great. It hasn't overheated or the battery isn't damaged like the other reviews said. I was scared to buy it at first because of the reviews but it hasn't had any problems.","rating":5},{"id":"R3VAJS9UTFOM4X","title":"Five Stars","text":"Works well great for the price","rating":5},{"id":"RK8R1TUJMTVJC","title":"One Star","text":"Horrible!!! The item arrived defective. It was giving a blue screen every two minutes restarting itself on his own. It keeps acting like this in a loop for more than 5 minutes and keeps doing. Starts showing the apple sign then goes to the blue screen over and over.","rating":1},{"id":"R34QMRYYZHTR3G","title":"it works fine.","text":"They don't tell you that this phone is from abroad and the camera shutter sound cannot be turned off. Otherwise, it works fine.","rating":3},{"id":"R1T6QOCTKUR5H9","title":"Love the phone and it came on time","text":"Love the phone and it came on time. But it came with a non apple charger and no headphones. I'm afraid to use the charger. Luckily I had an apple charger that I can use and will buy another apple charger soon as a back up.","rating":4},{"id":"RGC17QRNMB7LF","title":"I bought this for my husband who is really hard ...","text":"I bought this for my husband who is really hard on phones, even with an otterbox.  lol.  It works really well.","rating":5},{"id":"R2THF6X0MSF1WE","title":"I expected better.","text":"it's ok, I expected better.","rating":3},{"id":"R1RMHQHKIMGFL3","title":"Arrived with screen loose","text":"The phone arrived with the screen loose on the upper left corner.  I had to return it and get a refund.","rating":1},{"id":"R36UAEGZEPHCQT","title":"seller representations","text":"like the phone....would not charge beyond 75 percent...contacted seller and never heard back.  also, had a large scratch on the rear of the phone...would not consider refurbished again.  phone was unlocked and easy to get tmobile prepaid at walmart.","rating":2},{"id":"R37FPYUWUSEZ42","title":"Perfect. Only one very bad point","text":"Perfect. Only one very bad point : impossible to switch off the camera shutter noise. If anybody has a solution,  please tell me.","rating":4},{"id":"RCSHRSC3PZB03","title":"Awesome--totally like a new, non-refurb, & we've used ours for months now.","text":"My son *had* to have one of these as his first mobile--& the price was great--so I purchased a refurb for him & the same for myself--I keep up with what my young son is doing with the mobile, so I, myself, changed from Android to Apple, so I'd know how to use these things. We've had our for months now. They both arrived in *perfect* condition and have been working wonderfully. I didn't give 5 stars only because I didn't realize what a pain it would be to go from a big Android screen to this little one. When the larger-screen one doesn't cost a small fortune, I'll buy a couple of those.","rating":4},{"id":"RHE24JQH8M41T","title":"This is the second form this vendor. No problems ...","text":"This is the second form this vendor. No problems on either one so far. Used a $9.00 sim kit and both came up no sweat.","rating":5},{"id":"R358ENCAGA595H","title":"One Star","text":"Even didn't open, I have returned immediately when I received.","rating":1},{"id":"R1Y33UQSHRJSJ","title":"Didn't love it but, I still like it.","text":"it came with barely noticeable scratches but, works just fine.","rating":5},{"id":"R10ZCRDHDS5PI2","title":"Awesome deal for the price","text":"It looked brand new, no signs of wear... Great purchase.The most I liked about this phone is the touch id and access control on apps","rating":5},{"id":"R1YGI4AZ9JLO1Y","title":"Sound great","text":"Works perfect on Samsung phone,  sounds great  but I have an LG g stylo doesn't work the volume up button","rating":5},{"id":"R1WCDFRYA5VACD","title":"Great buy. Request new case though!","text":"Great product. But we bought it as a gift and the case was scuffed up so that was not cool.  Otherwise your good to go on this purchase.","rating":4},{"id":"R2WXDWS51WUEVI","title":"Not Unlocked (Locked to Verizon)","text":"This certified refurbished phone is supposed to come unlocked and ready to go, instead mine came locked to Verizon's network creating all sorts of head each for me.","rating":2},{"id":"R23AHLE02NLZDZ","title":"although in great condition, was flagged as a stolen phone when ...","text":"This phone, although in great condition, was flagged as a stolen phone when I tried to activate it with my provider.  Returned it.","rating":1},{"id":"R1VVEHAIPVP0F3","title":"Wowzers","text":"Perfectly fine condition, literally one little scratch, battery works fine, software works fine everything is good. I even got with metro pcs and it so far so good!!!!! I love it!!!","rating":5},{"id":"RRDLED6NBMSH2","title":"Completely disappointed with the service provided  by the seller","text":"I got a phone with the following problems:At the top of the phone dent 1/8 inch, on the side of the phone a lot of scratches. During charging, the phone is overheating. When using headphones, you hear noise and crackling. Twice, during a call, the phone was switched off.","rating":1},{"id":"R37M6F4FO7WEM8","title":"The phone went bad a month after I bought it","text":"The phone went bad a month after I bought it. I took it to the Apple store and they told me they couldn't fix it. The phone just shut down and never turned back on. and the seller didn't refund my money.","rating":1},{"id":"R1XPDZCS1LHR5C","title":"Perfect. Looks brand new","text":"Perfect. Looks brand new, and works like a brand new phone. I would highly suggest getting a used cell phone Certified Refurbished before considering buying a cell phone from any other seller. I trust Apple to give me the best product, and they do test used cell phones before putting them back out on the market. I have purchased other Certified Refurbished products from Apple, and have never had a problem.","rating":5},{"id":"RZ0H9LSDWI38C","title":"Don not buy a refurbished phone from Amazon the only work for 10 days.","text":"Do not purchase a refurbished phone from Amazon. I received my phone 11/12/2016 and it is dead, zero, not working. I put my phone on chargelast night 11/22/2016 and this morning at 5:30p zero, dead, not charged!! It has worked all of 10 days. I will ask for a full refund. I even put it onthe car charger because I thought well maybe Amazon sent me on of those chargers that were reported defected, but it did not charge on thecar charger either.  Now over the holiday when family members are texting and calling I am totally out of the loop!!!!  This is unbelievable!","rating":1},{"id":"R3CBRVBMRUE8CZ","title":"Buying from Luuki_Luuki you get a great phone, but nothing else.","text":"Very good overall. Worth the price, however there are some things that could be better. So this is an in depth review of this refurbished iPhone 5S sold by Luuki_Luuki1. Overall Phone Condition:Like Brand New. Any other comments wont be necessary. This phone looks and feels like brand new. Cosmetically its 10/10.2. Packaging:Cheap. As you'd expect, this phone comes in a cheap aftermarket Chinese box, it looks OK, but far from high quality.3. Accessories:1 out of 5. Very very cheap charger, I wouldn't use that charger with my enemy's iPhone. Cable? Its OK but extremely short, probably 2 ft long.At this point I believe I purchased just a phone, accessories need to be purchased separately, since the ones that came with it are useless. However, phone looks great and works perfect. Phone costs 185$ which is not bad for a like new phone but make sure you spend another 30$ on a nice charger and cable for it.","rating":3},{"id":"R2AW04MIHOIVC0","title":"A great safe to purchase on Amazon phone.","text":"After reading reviews on other websites about refurbished phones I knew the best place to go was Amazon.  And Amazon came through for me offering this great refurbished phone along that this seller was certified to do quality work in refurbishing phones.  I have wanted an I phone for a long time aqnd the price of this phone can not be beat.  I had no problems with the phone, and It was unlocked just as they said.  It does not come with an instruction book so I watched how to set it up on UTube.and it made my eyes cross.  At this point I have to admit I am a sweet little old lady (at least I think I am) and going from android phones and tablets was a little unnerving.  I was so afraid I would set something up wrong.  and I did.  but eventually I realized my mistake.  I have 3 rotten middle age kids who just howled with laughter when I tried to get help from them.  But I showed them .... I am now using it with confidence (well almost).  I would recommend these refurbished phones to everyone.  This is a safe place to purchase them and that is important to know.. Apple iPhone 5S 16GB Factory Unlocked Smartphone, Gold (Certified Refurbished)","rating":5},{"id":"R23ON8BJK35RN1","title":"GET IT GET IT GET IT!!!! ITS WORTH IT!!","text":"THIS IS THE PHONE YOULL WANT TO BUY!!!!! I absolutely love this phone it was basically like a brand new phone when I got it, there were no scratches or scrapes, the screen was perfect and absolutely no damages upon its arrival. It came three days earlier than the arrival date that was set, I love the phone it's been working just fine I've had zero problems since the day I got it. If you're looking for a good phone and person to buy it from you are definitely in the right place.","rating":5},{"id":"R2P0OL1P17W8AZ","title":"So happy!","text":"This product was 10/10 because it was exactly as described. A lot of people complained because it didn't come with earphones but still. This is a great deal for so cheap! People should be more grateful. My phone is honestly brand new, works perfectly, I fell in love at first sight. I will always recommend this seller and I will buy from them in the future! It arrived on time, and I live in the Caribbean so shipping usually takes two weeks but it took 5 days for it to arrive! I was surprised. Fastest shipping. Great service. However; please know that there's minor scratches. But who cares? It's minor because you can hardly see. I didn't notice until I stared really really well, so no worries. Put a case on and you'd be fine! Thank you to my seller for such great service and phone! ❤️🌹 Currently typing on my phone hehe","rating":5},{"id":"R1Y33UQSHRJSJ","title":"Didn't love it but, I still like it.","text":"it came with barely noticeable scratches but, works just fine.","rating":5},{"id":"R1YWWQTKY8N6WK","title":"Phone was in very good condition, a few scratches but nothing serious","text":"Phone was in very good condition, a few scratches but nothing serious. Works as expected and very happy with my purchase.","rating":5},{"id":"R2LN4V93ID5JW3","title":"This was crap","text":"This phone is in perfect condition but the phone givin to me was with a broken camera and flash that doesnt work . The products that also come in with this are peices of junk because the charger and head phones immediately broke.","rating":1},{"id":"R12MO81ASY2S9S","title":"Looks new, works like new.","text":"So far no problems.  I was worried about buying a refurbished phone, but I saved a lot of money and its as good as new.","rating":4},{"id":"RGC17QRNMB7LF","title":"I bought this for my husband who is really hard ...","text":"I bought this for my husband who is really hard on phones, even with an otterbox.  lol.  It works really well.","rating":5},{"id":"R1RMHQHKIMGFL3","title":"Arrived with screen loose","text":"The phone arrived with the screen loose on the upper left corner.  I had to return it and get a refund.","rating":1},{"id":"R3ACBMEKGV79GJ","title":"She loves it 😆","text":"I got this for my daughter birthday she absolute loves it I brought it to metro pcs they put a Sims card in for $15  it works like a charm no scratches practically brand new😉","rating":5},{"id":"R3JF9DR54SWCQI","title":"No earphones; Scratch marks; Disappointing purchase","text":"The phone has multiple scratch marks and I noticed that the paint was peeling off near the scratches. Guess someone did a paint job to hide the damages. There were no earphones.","rating":1},{"id":"R9FRDVWJ89O9A","title":"I've had it for a few weeks now and so far so good, no problems at all","text":"I was a little hesitant because of the other reviews but I literally got a new phone. I've had it for a few weeks now and so far so good, no problems at all. Overall in perfect condition !","rating":5},{"id":"R2NXE6K4VA112R","title":"Excellent phone!!!","text":"This phone surpassed all of my expectations. I previously ordered a iPhone from another seller... The phone wasn't unlocked and the shipping was slow. I was skeptical with this purchase...but everything was smooth and I love my gold iPhone!!!!!! I'm all smiles.","rating":5},{"id":"R2HS1TD693G8CW","title":"So far so good everything is great and my phone has 0 scratches","text":"So far so good everything is great and my phone has 0 scratches. I was pretty skeptical before because there are such bad reviews and maybe I got lucky but I'm really happy with my phone. Just one bad thing is that pictures make that clicking noise when you take them even when your phone is on vibrate. Looking to get it fixed if the company would be nice enough to take money off so I could get it done. I've had this phone for about a week and my phone froze for a few hours until I pressed the home key and the lock screen button at the same time. Works perfectly again love it","rating":4},{"id":"R2QAXKM8LN5W03","title":"Couldn't Be Happier!!","text":"I want to start off by saying that I was VERY hesitant to buy a refurbished phone as I had never done so before. With that being said I am extremely happy with the phone I received. It looks like a 100% brand new phone and operates as one as well. I really could not be happier that I decided to go this route rather than buying a brand new phone for much more than double the price. This was a great deal and I am very happy with the product I received - would highly recommend if you're looking to save money on a new phone.","rating":5},{"id":"R37ZX3888TJFZ8","title":"Five Stars","text":"Very Good item.","rating":5},{"id":"R23J6SG3I6FSM4","title":"Nice","text":"In full working condition, did not come in with headphones which I was hoping it would have, but never the less, a great product for the value!","rating":5},{"id":"R1GJOIQ9X8JS1X","title":"Phone doesn't work properly","text":"Phone does not work properly , constantly reboots itself and now it will not turn on.","rating":1},{"id":"R15EY7TRTQ9YQZ","title":"Great Buy","text":"At first I was hesitant that this phone would come in bad conduction but to my surprise it came in PERFECT condition and working excellent. I would very much recommend purchasing this if you are looking for an iPhone at a low cost.","rating":5},{"id":"R1Z9D2ZIONQ8J8","title":"This Generation Cell Phone","text":"My daughter is having a time of her life with this phone.  It fell in the toilet and she managed to get it up and running again.  She loves this phone.","rating":5},{"id":"R3PB6BPA2AFYDI","title":"Absolutely a waste of money and time; seller's description is totally off","text":"Seller's description is totally off since the phone is not refurbished at all; really  rough edges, glass screen is off the casing, phone excessively  warms up while charging which is clear indication that battery was not replaced.Amazon shouldn't be endorsing this seller if they don't make a better effort to sell a product that is accurate to the description been advertised. I'm expecting my money back right away!","rating":1},{"id":"R1PO8AB62HZG1D","title":"worked out for me.","text":"I'm currently going on a product review rampage. Yea so it's been about a year since I bought this. The battery is still pretty good and I didn't have a problem with it in the northeast winter. It's been a reliable phone and is compatible with my crappy Straight Talk plan.","rating":5},{"id":"R3EJ8EFCMSY8X9","title":"nicely packed, and the phone looked as it was ...","text":"Received the phone on time, nicely packed, and the phone looked as it was new! Yea had to charge the phone because it had no battery but it works well. I was able to place my T-mobile SIM card and so far it works well, no issues with battery or anything else. Like the 90 day warranty lets see after 90 days :)","rating":5},{"id":"RJ0P91VW0G3N2","title":"Good phone, came just like new.","text":"I needed an unlocked phone for when I was moving to Australia from America and so I bought this one. It came just like new (like they said). I was a little worried about it being a refurbished phone, but it works great. My only complaint is it doesn't come with the latest update, and for some reason sometimes the newest updates of iOS can sometimes make \"older\" iPhones not work well. So I've been a little weary of updating it, but that's not really the problem of the sellers. Anyway overall a great buy and would definitely recommend!","rating":5},{"id":"RZ610XF4S2F8B","title":"eh.","text":"I am very disappointed by the battery life of this phone. Otherwise it does everything it is supposed to.","rating":3},{"id":"RZ18MT4RESCKG","title":"Defective Phone","text":"I received the phone fairly quickly. It came with a few starches but I just over looked as they were minor. After about 1 week of having the phone the bugs begin. My home button would stop working and the screen would freeze. I would have to restart the phone in order to get it to work properly. I ignored it in the beginning however, it got worst as time went on. A couple weeks ago the phone started shutting off & on, on its own until about a week ago when it completely crashed & no longer came on. So I have since returned the phone & won't repurchase.","rating":1},{"id":"R11IKRECKS58P6","title":"The iPhone 5s was in excellent condition when I had recieved it","text":"The iPhone 5s was in excellent condition when I had recieved it, along with the charger. There were no scratches or significant markings. I did not recieve any headphones with the package, which is not an issue with me since don't like apple ear buds anyway. I had no issues having the SIM card inserted in my phone through my carrier.","rating":5},{"id":"R2XQ9D0XLR4NUG","title":"Five Stars","text":"I recommend this phone is what I was expecting","rating":5},{"id":"R29FAOEKAK3ERD","title":"I got this as a replacement for a phone with ...","text":"I got this as a replacement for a phone with a shot battery. Now this one has a shot battery too:/ completely ridiculous. And TWO DAYS before the 90 day warranty expires.","rating":1},{"id":"R27ANKJLPL9UL8","title":"Love this phone","text":"Love this phone. The only issue I have had is my phone screen starts acting crazy when you're charging it and it's around 80%. Apparently this is a common issue that iPhones have when you're charging them with a charger that's not officially apple. So that saying, if you get a charger from this order, it's most likely not apple.","rating":5},{"id":"RIN69RQX6Y8OM","title":"Not phone I ordered","text":"I ordered a NEW silver phone.  I received a scratched white one.  I would have been okay with a certified refurbished one or even the white one but it was heavily scratched. It was clearly not the one that I ordered.  It went straight from opening to ups return.","rating":2},{"id":"R1N85LAG77QB6C","title":"Like New","text":"Love this phone.  This was my second refurbished iphone by BuySpry and the phones all have been in like new condition without any wear and tear on them.  So far so good.","rating":5},{"id":"RPZCMWMMLO1DF","title":"Highly recommended.","text":"Love it! Like a new phone. No flaws. Came with its original box along with all the accessories.","rating":5},{"id":"REGNNFY92Q55S","title":"apple 5s, whats not to like?","text":"bought this for my wife, it arrived when expected, looks and functions as new. my wife had no trouble setting it up with straight talk, and she loves the phone more than her old 4s, which she was really pleased with.","rating":5},{"id":"R1W861543R6SAI","title":"We are delighted with this purchase","text":"We are delighted with this purchase. The option for gold was an added bonus. Bought the phone as an upgrade for my mother (her first smart phone).","rating":5},{"id":"R2QAXKM8LN5W03","title":"Couldn't Be Happier!!","text":"I want to start off by saying that I was VERY hesitant to buy a refurbished phone as I had never done so before. With that being said I am extremely happy with the phone I received. It looks like a 100% brand new phone and operates as one as well. I really could not be happier that I decided to go this route rather than buying a brand new phone for much more than double the price. This was a great deal and I am very happy with the product I received - would highly recommend if you're looking to save money on a new phone.","rating":5},{"id":"R31J29JC47N1QT","title":"Amazing Deal unlocked iPhone 5s","text":"Bought this for my daughter for her Big Christmas Gift... She absolutely LOVED IT!!!! Awesome Camera (better than the regular 5)...  So much storage for apps, pics, texts etc... Came with EVERYTHING that usually in the iPhone box... (Only things not included were SIMS card and original iPhone box... Phone came in cellophane baggie securely placed inside a small white box, no Apple symbols)The seller was outstanding to work with!!! Extremely fast and safe shipping!!! Will shop again","rating":5},{"id":"R2A00693MAPT12","title":"TECHarvard and Certified Refurbished on Amazon","text":"I am a 75 year old whose flip phone served her well but was on its last leg and the charger was also becoming unreliable.  Husband and daughters maintained that it was time that one of the two of us needed to update and it was going to be me.  I have two Nanos, one iPad Mini and an iPod Touch so there was no question I would go with an iPhone.  The question was when and my husband pushed for Christmas (2016).  I started doing research right after Thanksgiving but then put it off until I ordered everyone's Christmas presents.  After a week's time devoted to family's gifts, I had to start all over again finding an available Certified Refurbished 5S 16GB GSM Unlocked iPhone within my price range from a very reputable dealer.  I read reviews until my eyes were crossed and TECHarvard filled the bill.  In less than a week it was on my doorstep and it looked like new.  It has performed beautifully and I am thrilled to have made the decision both to buy an iPhone and to have purchased it from TECHarvard.  I will certainly not only recommend this firm but will be purchasing from them in the future.  They assured me that should I need any help or information, I need only contact their customer service.  Certified Refurbished on Amazon is the additional guarantee of quality.","rating":5},{"id":"R3SF3SGVO796I9","title":"iPhone 5S","text":"Arrived on time and was in basically brand new shape. I am thrilled with my purchase. Works and looks great. The only thing I did not like was that the accessories that came with it (charger, box) are not actually made by Apple. Otherwise I would highly recommend.","rating":4},{"id":"R2W72HKFUTE4G7","title":"Absolutely love my iPhone","text":"I bought the iPhone S5  A few months ago and I absolutely love it. The battery time is perfect it is never gone dead on me I've gone a day or so without putting it on the charger. I have had many phones over the years and I have to say this is the Best phone I have ever purchased. As for service and delivery outstanding.","rating":5},{"id":"R2KGOI3WJE10X9","title":"I almost thought it was new when it arrived","text":"The phone​ is in such good condition I could have sworn it was brand new, if not for two very small scratches on the front glass.","rating":5},{"id":"R2HZR1461PV8O2","title":"Great phone","text":"It looks great and works with my carrier, cricket wireless.  Thank you.","rating":5},{"id":"R2XTLL30X1T5IH","title":"Physically it's fine, only minor tiny scratches but that happened to ...","text":"Physically it's fine, only minor tiny scratches but that happened to my ipod touch even being in a case.The battery shuts off now and then around 20% and when I plug it in the percentage jumps around, it's kinda iffy, not sure if that's just a fault in the overall product or this one specifically.Not sure why it took like 5 days to process the order when I selected one day shipping.","rating":4},{"id":"R94ITCOF1B2FS","title":"HIGHLY RECOMMEND","text":"I was so nervous buying this product but it came in ON TIME and I could not have asked for a better phone! NO SCRATCHES OR DENTS!! Works great with straight talk also!","rating":5},{"id":"R1CRDI3M410BH9","title":"Got the phone fine, charged it up","text":"Got the phone fine, charged it up. Didn't go through any setup at all.  Just let it sit on the table without being used. Battery drain to zero within a couple of hours without the screen lit or any use at all. Returning it. Frustrated. Now I have to roll the dice again on another used phone.","rating":1},{"id":"R3IX1Z3PFDQMFB","title":"It was packaged very poorly for shipping. It was ...","text":"It was packaged very poorly for shipping. It was put in a small box inside a much larger box with nothing in there to cushion it. The small box holding the phone did not stay closed so the phone was loose and banged around inside the much larger box. The battery dies VERY fast and sometimes won't charge. I have to reboot the phone for it to show as charging. If the charger is disconnected and then reconnected, the phone has to be rebooted again for it to continue charging. Also, the charging cord that came with it did not work at all, I had to buy a new one. This phone was a huge waste of money.","rating":1},{"id":"R14AGA6GWM2LXD","title":"if you are looking for temporary phone, this is it.","text":"I literally bought this like three months ago. The screen is completely gone. All i know is whenever i plug my charger it makes vibrate so that's the only way that i can check that my phone is still alive. I tired pressing home botton and lock botton at the same time. It showed merely bright apple logo for second and it's pitch black now. I spent over 300 bucks on this thing. and i only got to use this for 3 months. It's not worth it.","rating":1},{"id":"R312ZE5LS2W3EU","title":"meh","text":"Ive only had this phone since july 2016. kept it in good condition but not long after getting it it started to 'glitch'. the screen would freeze and wont even load apps. siri sometimes wont respond no matter the level of volume you use and now and suddenly the touch screen wont work and i cant answer text messages or phone calls because of it. I now have to find a new phone. Was expecting the phone to last awhile even refurbished since my last phone, a Iphone 4 lasted for years and still works.This phone is okay if you wanna upgrade just don't expect it to last long.","rating":2},{"id":"R10TAN3F3VT7Z6","title":"Great product, great value. AA+","text":"The phone arrived quickly, well packaged, and as a refurbished item, looks and functions like new. The best price I could find, a great deal overall. I would purchase from this dealer over and over, if I needed more items. I've owned several iPhones, starting from the first release. This iPhone I purchased to use primarily as a phone. It fit my needs perfectly, at a fraction of cost of the latest models. Perfect deal.","rating":5},{"id":"RJ0P91VW0G3N2","title":"Good phone, came just like new.","text":"I needed an unlocked phone for when I was moving to Australia from America and so I bought this one. It came just like new (like they said). I was a little worried about it being a refurbished phone, but it works great. My only complaint is it doesn't come with the latest update, and for some reason sometimes the newest updates of iOS can sometimes make \"older\" iPhones not work well. So I've been a little weary of updating it, but that's not really the problem of the sellers. Anyway overall a great buy and would definitely recommend!","rating":5},{"id":"R3H89WOQSIV8ZY","title":"Be careful","text":"Bought this phone for my daughter, a few days after the 90 day warranty ended the screen was  no longer working (you could no longer open anything by touch) took the phone to Apple they were unable to fix the screen, was told that the inside of the phone was bent. Tried to contact seller and they still have not responded.","rating":1},{"id":"R1U2IOIHDQRQNC","title":"Home button not/bad functioning","text":"The phone came with a dis-functional home button (the button you use the most). Right after I bought it I had to travel so I had no choice to return the item.  However this is a mal-functioning phone so I am not sure if the certification as the state is really true.Disappointing.","rating":2},{"id":"R3RFIBKEH5PRMA","title":"Right size and works with European SIMs.","text":"My iPhone 4 got run over when it fell out of my pocket while riding my bike. I was actually happy since I had wanted an iPhone 5 for a while. It was easy to connect it to my phone service and this summer, when I traveled in Europe, it worked with the various SIM cards I bought there. My friend's, supposedly unlocked iPhone 5, would not accept the European SIM cards. Love my i5!","rating":5},{"id":"R2W72HKFUTE4G7","title":"Absolutely love my iPhone","text":"I bought the iPhone S5  A few months ago and I absolutely love it. The battery time is perfect it is never gone dead on me I've gone a day or so without putting it on the charger. I have had many phones over the years and I have to say this is the Best phone I have ever purchased. As for service and delivery outstanding.","rating":5},{"id":"R3HSUPEMSGDF74","title":"Great Little Phone","text":"Works great with the exception of the voicemails not showing up for 24 hours.  Apparently it is a common glitch when you unlock these phones.  Everything else works great and it looks brand new.","rating":4},{"id":"R1HFZK5OS0IREV","title":"A BAD EXPERIENCE","text":"i received it under optic conditions but after 6 months the screen touch stopped working so now i don't have celphone. It was restored and the screen changed but still not working. It seems to be a problem with the plate that cost the same as a new phone. I am very dissapointed.","rating":1},{"id":"R1LOJQEUPZKZDZ","title":"FEELS NEW MY SIBLINGS LOVE IT, PERFECT SIZE FOR 12Yrs","text":"LOOKS NEW, FEELS NEW MY  SIBLINGS LOVE IT, PERFECT SIZE FOR 12Yrs olds","rating":5},{"id":"R3RYTW0B79KX6V","title":"Better then advertised","text":"The phone exceeded what I was expecting . Its a refurb but you cant tell by looking at it . I was up and running in no time . This is the second one that I purchased . So far i'm a happy customer .","rating":5},{"id":"R1K4ICKKN22QME","title":"Great battery and never had had an issue with it","text":"Have had this phone5 now six months. Great battery and never had had an issue with it. Wanted to write a review way after to make sure it works. I will buy from BREED again.","rating":5},{"id":"R31KGZHRZ6D4HW","title":"Good quality at lower than retail price.","text":"This iPhone was a present for our son and worked as expected right out of the box. The appearance was as advertised and like new.","rating":5},{"id":"RB81MSZV2K9JU","title":"This piece is defective. I got checked in Apple ...","text":"This piece is defective. I got checked in Apple Store also. Audio is not working. As per apple store, i cannot insert ear plugs as some other metal piece is inside which is struck. I am really frustrated with the service provided. I never expected Amazon to send me a defective piece. This is totally frustrating.","rating":1},{"id":"RNYGLXSJAIODZ","title":"Bad product","text":"I bought this as a gift for my girlfriend who was traveling in Europe. The phone itself was in good condition with minor scratches. I was pleased with the purchase and I thought she would be as well. I sent it to her and when she went to get it activated she turned it on and the screen was just pink. Like all the pixels were smashed and the only color it could display was bright pink. Of course it didn't work at all and since I had to send it all the way to Europe (at great expense) we were not able to return it within the time allowed. I basically took 250$ and just flushed it down the toilet. I am very disappointed in this product and will never buy from this seller again and I recommend you don't either.","rating":1},{"id":"RGD7XYKFEAB8J","title":"So far so good.","text":"Ordered 2 of these refurbished Iphones for my sons. Its been a week and so far so good. No problems. I will update this review if we come across any issues. Knock on wood, but there is a warrantly.","rating":5},{"id":"R25XRR84IQFOHF","title":"Phone was is an excellent shape. However","text":"I purchased this as a gift and received it yesterday. Phone was is an excellent shape. However, it did not come with any of its normal charging accessories(cable and adapter) or the apple headphones. Came in a little ziplock inside a generic white box. Little disappointed in that it doesn't quite round up as a gift.","rating":4},{"id":"R2BWV1YI57ODC3","title":"... it's refurbished that is not new to me kinda disappointed last one had horrible battery life in cold hopefully ...","text":"Ordered the phone under new category and it's refurbished that is not new to me kinda disappointed last one had horrible battery life in cold since it was refurbished instead new was a at&t phone before got rebuilt put my Verizon SIM card in it no service says this is not a Verizon phone don't want return it cause I downloaded a bunch my personal content on it","rating":1},{"id":"R3HSUPEMSGDF74","title":"Great Little Phone","text":"Works great with the exception of the voicemails not showing up for 24 hours.  Apparently it is a common glitch when you unlock these phones.  Everything else works great and it looks brand new.","rating":4},{"id":"R3RYTW0B79KX6V","title":"Better then advertised","text":"The phone exceeded what I was expecting . Its a refurb but you cant tell by looking at it . I was up and running in no time . This is the second one that I purchased . So far i'm a happy customer .","rating":5},{"id":"RIN69RQX6Y8OM","title":"Not phone I ordered","text":"I ordered a NEW silver phone.  I received a scratched white one.  I would have been okay with a certified refurbished one or even the white one but it was heavily scratched. It was clearly not the one that I ordered.  It went straight from opening to ups return.","rating":2},{"id":"RGD7XYKFEAB8J","title":"So far so good.","text":"Ordered 2 of these refurbished Iphones for my sons. Its been a week and so far so good. No problems. I will update this review if we come across any issues. Knock on wood, but there is a warrantly.","rating":5},{"id":"R1K4ICKKN22QME","title":"Great battery and never had had an issue with it","text":"Have had this phone5 now six months. Great battery and never had had an issue with it. Wanted to write a review way after to make sure it works. I will buy from BREED again.","rating":5},{"id":"R1PDXZ1RBFOMU0","title":"The phone seems fine so far (2wks) but I can't shut off the ...","text":"The phone seems fine so far (2wks) but I can't shut off the camera shutter sounds which is loud and annoying. I tried muting the phone (it did, but the shutter sound persists), doing reset by pressing the home bottom and off buttons, changing the volume to min. It seems to be a defect.","rating":3},{"id":"R3PB6BPA2AFYDI","title":"Absolutely a waste of money and time; seller's description is totally off","text":"Seller's description is totally off since the phone is not refurbished at all; really  rough edges, glass screen is off the casing, phone excessively  warms up while charging which is clear indication that battery was not replaced.Amazon shouldn't be endorsing this seller if they don't make a better effort to sell a product that is accurate to the description been advertised. I'm expecting my money back right away!","rating":1},{"id":"R1PO8AB62HZG1D","title":"worked out for me.","text":"I'm currently going on a product review rampage. Yea so it's been about a year since I bought this. The battery is still pretty good and I didn't have a problem with it in the northeast winter. It's been a reliable phone and is compatible with my crappy Straight Talk plan.","rating":5},{"id":"R2VNPFNRG64BYH","title":"Horrible - experience","text":"Bought the phone for use overseas for parents. the phone died on day 1 (was not working or holding charge), had it looked at the apple store who said the batteries and some parts were changed and battery had no life left on it, the phones were used for 2 years !! Horrible - experience, since I did not buy it with intention of returning them - amazon gave me 20 days but the phones are overseas so I was stuck with the loss.","rating":1},{"id":"R2U0TXHIYFOGVR","title":"Iphone forever","text":"So glad we made the step into the IPhone world- these phones work amazing and quickly!  Loving everything about it- especially the fingerprint reader!  Easy to handle, decent in size, quality screen and a very nice camera as well!  Can't think of any issues I've had with it except that I hadn't found one sooner!","rating":5},{"id":"R2391W0GNUNHYC","title":"Works great","text":"The phone arrived even earlier than predicted. I waited over a month to write a review in case it started acting up, but so far it has been working great! The Touch ID feature works well and I have not had issues with this device. The only complaint I have is that it didn't come with the little metal piece to open the SIM card holder. A thin enough paper clip worked as a substitute though.","rating":5},{"id":"R3AXUWIG0HCC80","title":"The iPhone made affordable.","text":"A refurbished iPhone 5S is an excellent opportunity to get an apple device at a significant discount. The Amazon Certified Refurbished device performs exactly like a device purchased directly from Apple would, however it is worth noting that there are no headphones provided, and the charging adapter and cable are both third party and much lower quality than official charging devices from Apple.","rating":5},{"id":"R3STGLTX4IVKE0","title":"This is legit (:","text":"Just got the phone today so I will update review if any problems occur, so far so good. Only noticed my phone got hot for a few seconds while I was using it. Really hope this doesn't cause me problems because it really looks BRAND NEW and I would hate to have to return it. Wasn't expecting headphones because of other reviews I read but I received brand new ones as well as a charger.","rating":4},{"id":"R1HT7V9DPC83QQ","title":"Not satisfied","text":"The Iphone it supposed to be like new?It came w like four scratch and glass brokenI will not recommend this itemI  found other Iphone new better priceTnks anyway.","rating":1},{"id":"RSWB6TO8U7HD6","title":"Extremely great product, came well packaged","text":"Extremely great product, came well packaged, in good condition, no scratches or dents, everything works well, and actually unlocked. I was really impressed. I was a bit worried before buying but i made a good choice best buy on Amazon ever!","rating":5},{"id":"RDLJPSE4P98H4","title":"Should of just bought from metro 150 bucks only","text":"It came basically brand new looking thats the only reason i gave it 3 stars and also it works fine so far. The reason i regret buying is because the charger is a cheap and not the real or official Apple charger which i will have to purchase now for like 30 bucks it takes about 6 hours for a full charge and dies quickly even when i don't use it i have to charge it twice or three times a day.I have metro and they sell the phone for $150 i feel stupid for not just buying it straight from them because they would of gave me the official charger and not some cheap 3 dollar charger. I would return it but im too lazy","rating":3},{"id":"R2LJK5JYMJYIU0","title":"False advertising","text":"Product is not truly unlocked as described in ad and does not have a 90 day warranty, it only has a 30 day warranty. I'm stuck with a phone I can't use because if this false description. Not a happy customer.","rating":1},{"id":"RK4L91SSLSOKP","title":"Love it!","text":"Love this phone! I trust Amazon 110% and that's part of the reason I decided to buy a refurbished electronic product, actually this is my second refurbished Apple product and I'm very happy with both purchases. So save money and buy refurbished products, don't be cynical! If you don't, the only thing you have to lose is MONEY! I recommend this product to anyone who likes saving money. My iPhone is no different than my daughter's. Except, my bill is cheaper because I use AT&T go phone service! AND I OWN THIS PHONE! NOT THE CELL CARRIER!","rating":5},{"id":"R27POOZTP9X973","title":"Expectations Exceeded!!","text":"I have to say I was a bit nervous about purchasing a refurbished phone. Especially an older version of a phone, but this has way exceeded my expectations! The shipping was super fast with Prime, and it came exactly as described. I have been a die-hard Samsung fan since the galaxy 3 came out; I have to say I have converted my thoughts to being more of a fan of the iPhone now. I would highly recommend this company to anyone who is looking for an IPhone at a cheaper price and doesn't care about the box that it comes in.","rating":5},{"id":"R1N21WJVP2K7PJ","title":"Works great Good","text":"Delivered as statedHad ATT store transfer all info and pics to new phone ,no problem.Works greatGood buy","rating":5},{"id":"R2BWV1YI57ODC3","title":"... it's refurbished that is not new to me kinda disappointed last one had horrible battery life in cold hopefully ...","text":"Ordered the phone under new category and it's refurbished that is not new to me kinda disappointed last one had horrible battery life in cold since it was refurbished instead new was a at&t phone before got rebuilt put my Verizon SIM card in it no service says this is not a Verizon phone don't want return it cause I downloaded a bunch my personal content on it","rating":1},{"id":"RJ5QLF8DJL1NU","title":"Money out the window. BEWARE!!!!","text":"WORST EXPERIENCE EVER WITH AMAZON. If I could give a zero star rating that is what I would give because this phone, an iphone 5S, worked for about 8 months and that was it. One of the microchips was defective. Not worth repairing. $300 in the rubbish. HOW DARE YOU DO THIS TO THE PUBLIC????","rating":1},{"id":"R1Y9V2QR08Y53S","title":"Five Stars","text":"Like new iphone 5s, my 11 years old son loves his new phone.","rating":5},{"id":"R3RMI6HFRJGXBG","title":"Five Stars","text":"excellent product in perfect condition and released in Venezuela works perfect I highly recommended you purchase","rating":5},{"id":"R2EKM6LIVQ821B","title":"Five Stars","text":"great price","rating":5},{"id":"RKHVO5K9DZBDF","title":"I am so glad I did","text":"I've never had an iphone before and I wanted to try it out.. I am so glad I did! I am now converted to iphones! There are little differences in how the phone operates that makes it so much better! I only wish iphones took memory cards because I'm a mom that is constantly taking pics of my babies and I have had to transfer quite a few pics to my computer already.. It'd be nice to not have to do that as often.. I'm glad I didnt go with the 8GB or I'd be transferring pictures every week!!","rating":5},{"id":"R1ISKU18KHEH3S","title":"Looks Like New","text":"Awesome so far. My first iphone. I almost returned it because I saw all these thumb prints on the glass which makes it feel so used but then I realized it was just the screen protector. Peeled it right off and it looks brand new.  Also, my iphone didn't come with any other accessories except the charger.","rating":5},{"id":"RSC8RLC2KH8E3","title":"I am not sure what is wrong with it but I feel like I wasted my","text":"Bought this phone in June and its only two months and the phone keeps shutting down. I am not sure what is wrong with it but I feel like I wasted my money","rating":1},{"id":"R1AYQTS2G2I0HF","title":"Solid phone at a great price (once used)","text":"It's an iPhone. It's a pretty decently-built phone, though I dislike that I am unable to expand the memory and don't want to update and slow it down too much.","rating":4},{"id":"R1RNLE822CTXIU","title":"Very disappointing","text":"The lightning cable is badly damaged, so the product had much more use than I expected (too much used for a \"Certified refurbished\" product). The iPhone is apparently in good condition, time will tell.","rating":2},{"id":"R1PDXZ1RBFOMU0","title":"The phone seems fine so far (2wks) but I can't shut off the ...","text":"The phone seems fine so far (2wks) but I can't shut off the camera shutter sounds which is loud and annoying. I tried muting the phone (it did, but the shutter sound persists), doing reset by pressing the home bottom and off buttons, changing the volume to min. It seems to be a defect.","rating":3},{"id":"R1N7K76HEH45EJ","title":"It works fine just rarely it freezes on certain apps I don't ...","text":"It works fine just rarely it freezes on certain apps I don't know why and it had a few scratches on the back but other than that I'm satisfied.","rating":4},{"id":"R1LU58MU8WTTXW","title":"Five Stars","text":"good","rating":5},{"id":"R29CYOPSSJ6ZY6","title":"Great Buy","text":"We've had the phone for two weeks.  When i went to have it turned on I was told the phone was locked.  I started the return process.  I found out later the phone was actually unlocked.  After getting over all the hassel (not related to the purchase) the phone is working.  My 10 year old is super excited!","rating":5},{"id":"RJDSO6AT61M9S","title":"Five Stars","text":"Product looks brand new and works perfectly.","rating":5},{"id":"R1UH8D9I1W2QLG","title":"Great iPhone 5S 16GB","text":"I bought this iPhone 5S 16GB for my daughter and she loves it. The screen is picture perfect clear. The camara take beautiful pictures. The phone has great loud speakers.","rating":5},{"id":"R2TXUVERRW2XS8","title":"Below standard for \"certified refurbished\"","text":"Very scratches and dented far more so than I'd have ever expected from \"certified refurbished\". Scratches on the apple itself and sings along the tops of the phone. It's a bummer because the phone works pretty decent other than three very noticeable burn marks in the screen.","rating":2},{"id":"R2Q2SCPVUEVWBN","title":"Very disappointed. My headphones won't even connect into the port","text":"Very disappointed. My headphones won't even connect into the port. I tried several headphones that all fit into my 6s and even tried in my old 4s. The port is just too small for some odd reason. Also, the volume turns down automatically to the lowest volume level almost every time I'm on a call. It started doing this about a couple weeks after the 30 day return policy. I'm pretty upset as this phone is supposed to be a replacement for my old 5s business phone that was stolen in Peru. Now I'm stuck with it...$200 later","rating":1},{"id":"R2XTLL30X1T5IH","title":"Physically it's fine, only minor tiny scratches but that happened to ...","text":"Physically it's fine, only minor tiny scratches but that happened to my ipod touch even being in a case.The battery shuts off now and then around 20% and when I plug it in the percentage jumps around, it's kinda iffy, not sure if that's just a fault in the overall product or this one specifically.Not sure why it took like 5 days to process the order when I selected one day shipping.","rating":4},{"id":"R31J29JC47N1QT","title":"Amazing Deal unlocked iPhone 5s","text":"Bought this for my daughter for her Big Christmas Gift... She absolutely LOVED IT!!!! Awesome Camera (better than the regular 5)...  So much storage for apps, pics, texts etc... Came with EVERYTHING that usually in the iPhone box... (Only things not included were SIMS card and original iPhone box... Phone came in cellophane baggie securely placed inside a small white box, no Apple symbols)The seller was outstanding to work with!!! Extremely fast and safe shipping!!! Will shop again","rating":5},{"id":"R1MRH4HWTORLZA","title":"... for a couple of months and it's still working great. It came packaged well and looked brand new","text":"Had it for a couple of months and it's still working great.  It came packaged well and looked brand new.  There was not a single blemish on it - I would never have known it was a refurb.","rating":5},{"id":"R3VAJS9UTFOM4X","title":"Five Stars","text":"Works well great for the price","rating":5},{"id":"R2NER4ZGQZUAHZ","title":"One happy customer.","text":"I was a bit nervous about ordering this phone but I decided to go ahead and buy it. I must say I've very happy I did. Phone was in almost perfect condition. It was fully unlocked and activated with in minutes with my cricket sim card. The screen was in perfect condition. There was one very very small scratch on the side of the phone but it was unnoticeable unless you are looking for it. Very happy customer.","rating":5},{"id":"RH3IUM92H8BG6","title":"Glad I gave it a chance and ordered.","text":"Reading some of the other reviews I was a bit worried that I might receive a phone that was beat up and just not up to par with what should be certified refurbished. I was pleasantly surprised when I received a phone that was practically brand new! I installed my old SIM card and was up and running within minutes. Thanks!","rating":5},{"id":"RRS6AVMCDYIMZ","title":"So far so good!","text":"I was a bit worried given the good price point of this product and the slightly mixed reviews. However, the phone came in great condition - no scratches or visible marks. I've had the phone for a couple of weeks and have had zero problems with functionality. I will update should anything change but so far I am very happy with my purchase.","rating":5},{"id":"R2DM3HWCRRLSE8","title":"Refurbs are the way to go if you don't want the latest, greatest model.","text":"I love this phone.  I wanted an iPhone, but didn't want to pay $700+.  This phone is terrific!  It works good, looks great.  I'm a firm believer in refurbished electronics.  Have been for years and am rarely disappointed.","rating":5},{"id":"R25XRR84IQFOHF","title":"Phone was is an excellent shape. However","text":"I purchased this as a gift and received it yesterday. Phone was is an excellent shape. However, it did not come with any of its normal charging accessories(cable and adapter) or the apple headphones. Came in a little ziplock inside a generic white box. Little disappointed in that it doesn't quite round up as a gift.","rating":4},{"id":"R2THF6X0MSF1WE","title":"I expected better.","text":"it's ok, I expected better.","rating":3},{"id":"R2XGSXACZVZ9X8","title":"he and I could not be happier with the purchase","text":"I was a little skeptical about purchasing a refurbished phone for my son, but because a new iPhone 5s would cost between $400 - $500, and a 6s would cost even more than that, I went this route.  To say the least, he and I could not be happier with the purchase.  The phone showed up on time, packaged very neatly and safely, and most importantly the phone works flawlessly and looks brand new.  There is literally not a scratch or mark on the screen or case anywhere.  I highly recommend this product to anyone.","rating":5},{"id":"R148QNSRYNS64K","title":"It's great except it's a Japan phone","text":"It was in perfect condition when I got it no problems but it is a Japan phone so you can't turn the camera and screen shot click sound off and it's really annoying.","rating":3},{"id":"R12T2EYX7YOB9T","title":"Not satisfied phone wont keep a charge.","text":"I bought this phone for my son for Christmas and the phone does not keep a charge. My son has to literally keep the phone on the charger all day in order to use it. I have contacted the seller to exchange or refund the phone and I'm waiting on a reply.","rating":1},{"id":"R3FE8SISOKOQBS","title":"Very disappointed as our 12 year old saved money to buy ...","text":"We got our phone this week and within a day the charger housing burnt out. The charger it came with actually made sparks and seems to have burnt out the charger housing to the phone. It now will not charge. Very disappointed as our 12 year old saved money to buy his fist phone and this is what happened to it. Now we have to go through the most likely painful process of filing a claim and returning everything. Jus glad we're still in the manufacturer's warranty period.","rating":1},{"id":"R3RQ58J8O8O9NT","title":"Works better than her 4S Dinosaur","text":"So far it's working well. Only one glitch that's why 4 stars instead of 5. The phone would not dial so my sonwent to my moms and turned the airplane mode on and off and it worked fine. I bought the phone for my mom who turned 88 years  2 weeks ago. She lives in the same area as my son. So he's her techie. It calls well can't say much on other functions as texting is beyond her grasp God bless her!","rating":4},{"id":"R3OYOBVMBC2QF9","title":"New and beautiful","text":"This phone looks and acts brand new. Delivered right on time, with specified recharger. I'm giving it only four stars because although it was really unlocked as described on the website, it arrived with a sticker on the back designating it as a Verizon phone. The seller could not be reached, as it was a Saturday, and Amazon customer service could not provide any more info. When I took it to my service provider of choice (not Verizon), there was no problem. It was unlocked. Just carelessness on the sellers part. It's a great phone at a good price. Just don't get nervous if you get the sticker.","rating":4},{"id":"R2P0OL1P17W8AZ","title":"So happy!","text":"This product was 10/10 because it was exactly as described. A lot of people complained because it didn't come with earphones but still. This is a great deal for so cheap! People should be more grateful. My phone is honestly brand new, works perfectly, I fell in love at first sight. I will always recommend this seller and I will buy from them in the future! It arrived on time, and I live in the Caribbean so shipping usually takes two weeks but it took 5 days for it to arrive! I was surprised. Fastest shipping. Great service. However; please know that there's minor scratches. But who cares? It's minor because you can hardly see. I didn't notice until I stared really really well, so no worries. Put a case on and you'd be fine! Thank you to my seller for such great service and phone! ❤️🌹 Currently typing on my phone hehe","rating":5},{"id":"RF1GP5ICFQEHU","title":"Fantastic Condition","text":"I purchased my phone from BuySPRY. I think some of the negative reviews I have read are directed towards the seller yet the seller was not mentioned in the review so I thought it would be worth mentioning who I purchased from.The phone I received is in perfect condition. Looks brand new. The phone was indeed unlocked and very simple to set up. It came with charging cable and USB to AC adapter, but no headphones. The first thing I did was test the battery life as that is probably the biggest complaint on refurbished phones. The batter charged fine and has been holding its charge without issue. Everything on the phone works perfectly, I am very happy with the purchase.","rating":5},{"id":"R1HT7V9DPC83QQ","title":"Not satisfied","text":"The Iphone it supposed to be like new?It came w like four scratch and glass brokenI will not recommend this itemI  found other Iphone new better priceTnks anyway.","rating":1},{"id":"R36P1TXRG2SZT0","title":"I will be RETURNING this device!!!!","text":"The phone was in EXCELLENT condition, unlocked and I had no problem getting it activated through Metro PCS.  However, I have only had the phone for 2 weeks (I received it March 2, 2017)and with minimal usuage, my battery does not last. It will jump from 50% to 20% and down to 5%. It's been over heating, it will randomly shut off and I have to charge it at least 4 times a day. I will be RETURNING this device!!!!","rating":2}]