[{"id":"RXH30OBTHZIGB","title":"GO BUY J7PRIME DON'T WAIT YOU MUST BE CRAZY PRICE IS RIGHT..BOTTOMLINE!","text":"What more can I say This phone j7 prime 2016 man forget about it simple Amazing Flag ship phone. I'M WAITING ON THE GOLD TO ARRIVE BY 9PM TODAY FOR MY EARTH MEANING WIFE , I'M  SURE SHE GOING TO BE AMAZED. IF YOU READ MY POST WHAT YOU WAITING ON BUY ONE NOW.","rating":5},{"id":"R1EDBDGH2BFXOF","title":"Love it!!","text":"Fast, pretty, excellent for the price.SIM CARDs are NANO, I had to cut my SIM card.Camera is Amazing!!","rating":5},{"id":"R2J9EYG4NZW9MD","title":"Best Smartphone ever!!","text":"Best smartphone ever. Good job #Samsung. Am really loving and enjoying my J7 prime.","rating":5},{"id":"RL2QA1743CKRH","title":"Five Stars","text":"Toppp","rating":5},{"id":"R3PR7XY3Q2M1A4","title":"Four Stars","text":"Good","rating":4},{"id":"R30Q9W20AYH9LX","title":"Four Stars","text":"Good value for money. Excellent service by NGP STORE when I accidentally received only a 16GB version. Since I had left the country by the time I found out, they apologized and did not hesitate to refund me an appropriate amount for which I will put in a bigger SD card.","rating":4},{"id":"R2O65SEEYP82YI","title":"Great product for the price!","text":"Great product, good feel and grip, very good image quality, acceptable sound and probably one of the best products for the money. I have been looking for something like this and I would like to say that I am very pleased with my purchase. I am recommending this without a doubt, but be careful when you buy a protective case, because some of the adds do not correspond to reality!","rating":5},{"id":"R2IHA1Q40QC0OF","title":"Five Stars","text":"Great","rating":5},{"id":"RDHZO0OE8CY22","title":"Great phone....!!!","text":"Excellent phone for the price. Nice desing, work perfectly and smooth screen has a great resolution. Battery performance is great, only cons is the camera not so great but is above average an do a fine job. But by the piece in great","rating":5},{"id":"R3G07FIW0L7SDX","title":"excellent product. Only the sound is not the best ...","text":"excellent product. Only the sound is not the best and it takes time to turn the screen when you put it vertically. The ram is good and the screen is clear despite not being amoled. It has a bit of reflection but it is fine.","rating":4},{"id":"R2IHA1Q40QC0OF","title":"Five Stars","text":"Great","rating":5},{"id":"R1IC5PC5PND7DN","title":"Five Stars","text":"excellent product. I'm coming in time","rating":5},{"id":"R3BGH6XAUCUEQZ","title":"Nice phone....crap battery","text":"I really like this phone....i was an iPhone user for years. Takes great pictures but giving 3 stars because of battery life; it drains very fast and ive disabled all background apps and deleted a lot of apps I like but it still doesn't last.  Bummer. Not sure what I'm going to do with it.","rating":3},{"id":"RYX61PWVZPFKR","title":"If you can find a better high quality android phone with all the bells and ...","text":"If you can find a better high quality android phone with all the bells and whistles this phone has for this price buy it. You won't I looked.","rating":5},{"id":"R3LRIJQUVPEQL9","title":"Four Stars","text":"EXCELENTE!","rating":4},{"id":"R1DHSUQLDXMPF0","title":"Five Stars","text":"Excelent telephone.","rating":5},{"id":"R6I18V6O92UAZ","title":"Great features but freezes at times.","text":"The phone looks as advertised and come with a charger (110V), a key to open the slots and headphones.HOWEVER, within a few days of using it, the screen has started freezing when tapping on it. It started with the camera app while taking phones. You keep touching the screen but the phone does not respond. Sometimes it takes more than a minute and I have to close the camera and reopen it. It has now started happening in other apps. I find this very strange since I have had the phone about 2 weeks now if so much...It uses the micro sim cards and has two slots and a space for adding more storage space. The photo quality is very good, both front and back and it has a built in flashlight app. A+ for me. One less app to download.Feel free to ask me any questions... I'm considering returning it for a replacement however.","rating":3},{"id":"R2XO906F1Z6XF9","title":"Lovely phone!","text":"Just received this phone, but love, love, love it so far.Works with LTE 4G very well.Love the size.  This is a substantial phone.","rating":5},{"id":"R2XO4LHYYXAUKA","title":"Five Stars","text":"Excellent cellphone!","rating":5},{"id":"R578KPHHKQSY4","title":"After several months of looking for Galaxy Smart Phones, I am glad it end up with ...","text":"After several months of  looking for Galaxy Smart Phones, I am glad it end up with this one. It works perfectly as expected and paid about half the price of Galaxy S7..I dont use it as a phone that much but use for playing Crash of Clan all the time. Other functions that I like most is to do banking online by deposit checks without making a trip to the bank ( PNC Bank). It works like a tablet, with 5.5\" screen, so we can check the weather report, read the news, listens to music, vidio from utube, etc. Highly recommended.","rating":5},{"id":"R2H4UAY4MTVEK5","title":"Amazing phone for the price !","text":"So far im in love with this phone ! I love the quality of the phone and the sleek metal body. I love the fact that the speaker is on the side of the phone and its loud! The only complaint is that this version of the j7 doesn't have the selfie flash option like the 2016 j7 has. Other then that it's amazing ! And regardless of the selfie flash the camera is amazing front and back:) highly recommend this phone if you'd like something updated but won't break the bank!!!","rating":5},{"id":"R234H8BQZGTAAT","title":"Love it! Hassle free","text":"Love it! Hassle free, product arrived as advertised, meaning brand new and factory sealed! Great experience! Mostly when my previous experience with cell phone purchases from other sellers cost me so much energy, headaches and frustration. This is how it should be done always when you are selling something!","rating":5},{"id":"R37OFJHIX4INUL","title":"This phone looks great.. It will be given away as a ...","text":"This phone looks great..It will be given away as a gift..I hope this item works or function well. Im sure she will like and love this.","rating":5},{"id":"R13MWKWZPQW82S","title":"Five Stars","text":"Perfect!","rating":5},{"id":"RXH30OBTHZIGB","title":"GO BUY J7PRIME DON'T WAIT YOU MUST BE CRAZY PRICE IS RIGHT..BOTTOMLINE!","text":"What more can I say This phone j7 prime 2016 man forget about it simple Amazing Flag ship phone. I'M WAITING ON THE GOLD TO ARRIVE BY 9PM TODAY FOR MY EARTH MEANING WIFE , I'M  SURE SHE GOING TO BE AMAZED. IF YOU READ MY POST WHAT YOU WAITING ON BUY ONE NOW.","rating":5},{"id":"RUV1FF38AB7PG","title":"Five Stars","text":"Is an excellent product, completely satisfied with my purchase","rating":5}]