[{"id":"R1O9AQBU862N39","title":"Desperate attempt with not enough effort","text":"I purchased this phone as an upgrade to my BlackBerry Passport. The phone is made very well and feels like a quality product including the nostalgic QWERTY keyboard.If you plan on using this phone and tie it into your BlackBerry server the BB interface is on par with the previous BB Hub in BB10.Unfortunately my company decided to no longer support BB once the last BB OS phone dies and I had to move to Good.I had very high expectations of this phone from BlackBerry merging their security, features with the Android OS and app availability.The OS does what every Android phone does but I noticed bugs quite frequent. The lack of a fingerprint scanner is annoying if you use Good instead of BES12 or use other applications that will require a second sign in. I preferred to use the on screen keyboard most of the time as typing is much faster. I attempted to use the keyboard for scrolling and keep away from smudges and fingerprints but the screen response to keyboard swipes is very jerky and not fluid at all.","rating":3},{"id":"R2HE15EV4MXQDD","title":"I love the features of the phone itself but that is ...","text":"I've had this phone for 2.5 months and it slid off my desk onto CARPET while it had the case on that I purchased from blackberry for this phone and the screen dented and cracked. Not durable at all. I love the features of the phone itself but that is pretty ridiculous in terms of durability.","rating":2},{"id":"R9IYS7YME5CDP","title":"It is working good now, but customer support was required from both ...","text":"This is not a factory unlocked phone.  It is an AT&T version.  It is carrier unlocked.  It is working good now, but customer support was required from both T-Mobile and Blackberry several times to achieve this.","rating":3},{"id":"RKYISFASUNLNN","title":"Nice, large screen","text":"Nice, large screen. The only complaint I have is that the keyboard is too small, so typing on it takes some getting used to. Given the overall size of the phone, you might expect that there could be larger keys, and a separate row for the number keys.Other than that, everything is working well.","rating":4},{"id":"RYM1OYSQABPB9","title":"PRIV is fun, functional, and fragile","text":"I am a lifetime Blackberry user. The PRIV is a good mix of Blackberry and Android and it has good tools for monitoring which programs are using what data, how much data, etc. Obviously, it has the keyboard, which is well made. Blackberry fans should like that. I am giving the phone a low rating, however, because the screen seems to be very fragile despite being advertised by BlackBerry and all its retailers as being made of very durable Corning Gorilla glass and having been \"rigorously drop tested.\" It's far more fragile than any other phone I've had, including other Blackberrys. If you look around online, you'll see myriad other users have had problems with the screen. In particular, minor impacts that would not damage the screen on another smartphone seem to shatter the PRIV's screen. Even this wouldn't be such a problem if a) reasonably priced parts were available for this easily replaceable screen or b) Blackberry and its retailers stood by Blackberry's claims about the screen's durability, which they do not. Finally, Blackberry customer service has been absolutely terrible so far both from a sales perspective and a support perspective.","rating":2},{"id":"R34QNDDLBJWLN6","title":"Loving it","text":"I don't think I can use any other phone after this. Just incredible. Only downside is a little slower than I expected, camera not so great and the colors on the screen  are a little dull. But the keyboard is incredible. This phone is just made for productivity.","rating":5},{"id":"R2QBEBL0AW9JWW","title":"but don't scratch easily. The touch screen not glass so i recommend ...","text":"there are a few minor things but nothing from keeping me from loving the phone. The back is kind of cheap and flexes, but don't scratch easily. The touch screen not glass so i recommend the gorilla glass accessory. The blackberry stuff is there, but i don't really use it and is a sold android phone. overall, i love the keyboard and the phone!","rating":4},{"id":"R2CCPETPNHKXWP","title":"We love it , almost perfect Smartphone","text":"Bought it for my daughter, she is happy as a pig with her new phone, works almost perfect.It comes with Android so it's easy to handle and with the BlackBerry approach to safety and security it's probably the most secure Android smartphone.The screen is big, crystal clear,sharp seams to be high quality.Battery last more than a full day (heavy use mostly wifi).The only negative point : The shape of the screen is a bit like samsung edge, therefore it's difficult to get screenprotector installed, we tried curved ones, but they all failed and come loose after short time (at the edges) now we got one for the main middle part only.so edges are not protected.We didn't tried but obviously it's not possible to root or put a custom ROM on the priv.","rating":5},{"id":"R3H7E9MTEP71A3","title":"Awesome big and easy","text":"Love it it is big it is easier for me text sense I have problems with texting with smaller  phone with my hand finger issues.","rating":5},{"id":"R13TA10U0D85EZ","title":"Good phone","text":"Good. Worked in UK, but had to reset when I brought it back to US. Using it on T Mobile, so can't use installed ATT apps.","rating":5},{"id":"R2BFCEIBC2A4A7","title":"Very good phone, best upgrade of a phone since my ...","text":"Very good phone, best upgrade  of a phone since my BlackBerry 10 unit. Loving the android software, and the update to Marshmallow.","rating":5},{"id":"R3C0OGOSE3U3GH","title":"BB priv","text":"It was exactly what I want, didn't switch it on just unboxing but it looks pretty good.Thanks a lotBest regards - Salah","rating":5},{"id":"R2CCPETPNHKXWP","title":"We love it , almost perfect Smartphone","text":"Bought it for my daughter, she is happy as a pig with her new phone, works almost perfect.It comes with Android so it's easy to handle and with the BlackBerry approach to safety and security it's probably the most secure Android smartphone.The screen is big, crystal clear,sharp seams to be high quality.Battery last more than a full day (heavy use mostly wifi).The only negative point : The shape of the screen is a bit like samsung edge, therefore it's difficult to get screenprotector installed, we tried curved ones, but they all failed and come loose after short time (at the edges) now we got one for the main middle part only.so edges are not protected.We didn't tried but obviously it's not possible to root or put a custom ROM on the priv.","rating":5},{"id":"R2YXX6NS2U855J","title":"Great Phone!","text":"Ir works perfectly in Argentina.  Ir is real y unlocked. Great Phone!","rating":5},{"id":"R182PTQMZ8L4QL","title":"Five Stars","text":"I love this phone! It's the better android choice.","rating":5},{"id":"R2DQZ8JRG7YH36","title":"Four Stars","text":"I give it four stars until I receive the marshmallow update.","rating":4},{"id":"R2OWDKO8CF2755","title":"Great mix between BlackBerry and Android","text":"Great mix between BlackBerry and Android. Not only does the phone provide a near stock Android experience, it adds some intangibles such as the physical keyboard for precise typing along with with top notch security and productivity apps. Aside from that, a great screen for watching media and surfing the Web. Phone is a top pick  for 2015.","rating":5},{"id":"R2DR6JKFT9KG30","title":"Five Stars","text":"Works fine. Thanks","rating":5},{"id":"R3IE3F93Y2Z1NA","title":"Five Stars","text":"great product!!","rating":5},{"id":"R2RUGN85GHN8TW","title":"The best phone out there with the worst defect","text":"I wanted to buy a phone with keyboard and BB classic was too low spec for me so I really had no other option but to buy this phone.Looks wise, its one of the best out there, deserves full 5 stars, build quality is good too. Specs are decent, even at its launch price and has all the features needed except a finger print scanner.The camera is ok, not very bad but not the bests either. Maybe I don't like the camera too much because I have always used Nokias before, and their cameras impossible to match. However, this slight shortcoming is more than made up by the beautiful and bright touchscreen.I wanted to give it 5 stars, if only because of its keyboard and the way it feels when you hold it. But that's where you run into a big problem; it overheats like an oven. and I am taking two stars off because of that.I bought it in Houston, Texas, but I live on the other side of the world so there's no way to exchange it, and I use the cover I bought with it to prevent my fingers getting burned.","rating":3},{"id":"R2BFCEIBC2A4A7","title":"Very good phone, best upgrade of a phone since my ...","text":"Very good phone, best upgrade  of a phone since my BlackBerry 10 unit. Loving the android software, and the update to Marshmallow.","rating":5},{"id":"R4QYLG1F8MLY4","title":"Good Blackberry effort","text":"This is a really good smartphone by Blackberry. Was a fan of BBOS10 and they really made the transition to Android good.","rating":5},{"id":"R1R6R4FS1TD44E","title":"Five Stars","text":"is perfect","rating":5},{"id":"R20EQ43UH0C2C9","title":"NOT UNLOCKED DEVICE","text":"I would like to start by saying that the blackberry priv is very impressive and bring a fresh altenative to todays smart phone options I would 100% recommed this device to anyone with that said lets review the seller.This is not unlocked device comes with att packeging  it is att branded phone. The when I called att to try and unlock code it the said that I would have to use there service with the blackberry priv for 6 month before they can unlock it. Now this is not a big deal for me because I am planing on using my BlackBerry as a secondary device so I dont mind using att but I I know that there will be a lot of disappointed customers that will not want waitthe time or use att service for that long the seller should inform buyers of this because ths is false advertising.","rating":2},{"id":"R3FT0X2NUZGR4F","title":"PHONE SCREEN WENT BLANK!!!","text":"After spending $700 on the PRIV I had to buy a new phone last week.  The phone screen went black!  I was one of the first on board when this phone came out and now I'm totally disappointed.  Wish I could give it zero star!","rating":1},{"id":"R1AMKY2LE18ODA","title":"Five Stars","text":"Fantastic ! Loved it ! Blackberry is back on the game !","rating":5},{"id":"R3UCP7IGCEVUDE","title":"Five Stars","text":"Excellent product, delivery in a timely manner.","rating":5},{"id":"R2YXX6NS2U855J","title":"Great Phone!","text":"Ir works perfectly in Argentina.  Ir is real y unlocked. Great Phone!","rating":5},{"id":"R2DQZ8JRG7YH36","title":"Four Stars","text":"I give it four stars until I receive the marshmallow update.","rating":4},{"id":"R182PTQMZ8L4QL","title":"Five Stars","text":"I love this phone! It's the better android choice.","rating":5},{"id":"R2RJHSTTZHFYY9","title":"Five Stars","text":"Loved the keyboard","rating":5},{"id":"R36OJAIH7XIS0E","title":"Amazon's quality","text":"Sold and shipped by Amazon. There is something wrong with the DAC chip, audio is full of noise. The slide is a little bit loose at the bottom left corner. Small scratch at the top. Other parts are perfect. Amazon sent me three products with many issues, horrible quality. Decide to keep it as warranty remains.","rating":3},{"id":"R1AMKY2LE18ODA","title":"Five Stars","text":"Fantastic ! Loved it ! Blackberry is back on the game !","rating":5},{"id":"R1ZJ6GUL4Y6WWV","title":"Five Stars","text":"Smashing","rating":5},{"id":"R1METH1HSI45PO","title":"I understand the bad reviews! It overheats","text":"I understand the bad reviews! It overheats, underpowered and overprice! Good design though! Product arrived on time and works right off the box!","rating":3},{"id":"R374A2A22Y3WWI","title":"Five Stars","text":"Awesome phone :)","rating":5},{"id":"R3AWXDFLGHXXLI","title":"Five Stars","text":"great","rating":5},{"id":"R23603J6GGZHKB","title":"Five Stars","text":"i like","rating":5},{"id":"RTDIP6S705STJ","title":"Doubtful","text":"The box was already open when the phone came.... I doubt about the newness of the phone","rating":2},{"id":"R2CDWQVP4KZD24","title":"Excellent Phone","text":"This phone is outstanding. Best phone I've ever owned. Highly recommended.","rating":5},{"id":"R3O5K9N63YV7QD","title":"A fabulous Android.","text":"This is an utterly outstanding device -- if you want an Android phone for the \"ecosystem\" and apps, this may be your next phone.I'll mention the worst aspect of the phone right up front -- the front camera (\"selfie cam\") is not impressive at all.  It's a 2MP, and I suspect the issue there is simply space; there wasn't room for anything bigger, so it is what it is.However, the bad news ends there.  The rear camera is 18MP, and the image quality is outstanding. People claiming that it \"shoots slow\" probably have auto-HDR on and it's using it -- and by the way, it doesn't cheat -- it takes the full three shots before merging (most smartphones only take two.)  The quality is out of this world. It's not a dSLR (I own a Canon 5d3) but even under pixel-peeping inspection at 400% magnification the images hold up well.  The camera tends to overexpose highlights a bit BUT it has manual exposure bias control in the viewfinder; knock it down a stop and that goes away.  Compression artifacts are well-controlled.Compared against the Passport's main camera (which I also own) the shooter in here puts the Passport to shame.  It's not a $5,000 dSLR and lens, but it didn't cost $5,000 either.  Qualitatively it's on-par with anything else in the market and the focus is phase-detect fast (nearly-instant.)  OIS means stable video as well.  The lens is wide-angle, probably around 28mm equivalent.  I intend to get some ~28-35mm equivalent shots with both the Passport and my 5d3 in the next few days and will be posted a full review over on my blog including them.The keyboard is amazing and you don't realize how nice it is until you have the on-screen one up, it's taking up a third of your screen, you slide the screen up to expose the keyboard and suddenly you have the entire display page back.  No other high-end device on the market makes this possible.The battery is a very large 3,400maH model.  Like all Android handsets you can shoot yourself in the head in terms of battery life (e.g. using an \"active\" wallpaper, for example) and apps can as well.  But here we have a new weapon in the form of DTEK and it's a BlackBerry exclusive -- it has already caught a couple of apps that when you simply hit \"HOME\" keep asking for position every few minutes, which of course turns on the GPS and does horrid things to your battery.  Hit the square and close 'em completely, the problem goes away and your power drain while idle, screen off, falls to a very respectable ~25-30ma.  In other words, close to 100 hours of endurance on standby.  Will it go through the day?  Yes, for most people if you're intelligent about not running apps that blow your battery up.  The phone also has both QC 2.0 and wireless charging (wireless charge is slow, as with all such devices -- use the cable if you want fast.)The Hub is also present; it's a bit different than BB10 but the convenience of having all your emails and main social media account notifications in one place is not to be missed.  And, the \"spark\" tells you which apps have notifications pending for them.  Nice.I set mine up against my Exchange server and had my contacts, calendar and emails on the device in minutes; syncing has been flawless.The screen on this phone is gorgeous; you'd expect it from the specs, and it does not disappoint.  It's also nicely usable in full sunlight, which many phones are not.  And while it's OLED BlackBerry has managed to keep the over-saturation under control, the nemesis of color fidelity in a lot of these panels.  Hats off to the folks who put the display together; they have a winner.The slider mechanism is precise and feels awesome.  For that matter so does the back cover; it's a grippy carbon-fiber like material that has been used before; I believe it's the same as the Z10 and Z30 (I own a Z10.)  The phone feels great in the hand and doesn't threaten to slip out and wind up on the floor with a smashed screen.  Bravo.WiFi signal retention is excellent (better than my Passport by a wide margin) and cell service works well too.  The phone is Band 12 capable if you're on T-Mobile; they're deploying a lot of it and this is one of the devices that can take full advantage of that.  It has all the bands used by all the GSM carriers in the US and Canada; unfortunately it does not have CDMA so it won't work with Verizon or Sprint.Make sure to manually update all the BlackBerry apps when you first get the phone.  There are updates for all of them on Google Play but the first time they won't come down automatically because they were not loaded from there originally, being on the device native.  Once you update them manually the first time they will track on their own from then on.  There are serious improvements in the updated versions on the Play Store, particularly in the Hub and Camera.For those who want an unlocked Android device BlackBerry has a winner here.  This is a flagship phone and not inexpensive but the hack-hardening, keyboard and productivity apps that are proprietary to this device make it well worth consideration if you're looking for a flagship-level device.Recommended.Update 6/12: The black box, factory unlocked model will get Marshmallow when turned on.  The orange box, AT&T model will *not*, so do check which you're buying -- Amazon itself sells the black factory unlocked model, but some vendors selling on Amazon have the AT&T unit which is functionally identical but cannot accept the factory unlocked firmware and are tied to AT&T for updates at the present time.","rating":5},{"id":"RXTLOVILY40DK","title":"BlackBerry PRIV: One Year Review! Excellent BlackBerry/Android Experience!","text":"Had owned this phone for almost a year exactly! So this review is based off my experience during the 2016 year!About Me:I was never big into \"apps\" and games on my phone. When i look at phone, I look for Messaging, Phone Call Quality, Build Quality, and ease of use. Overall I look for a solid \"Communication\" tool, when it comes to phone devices.I have been big into phones since the LG Env3. That was probably my favorite non-smart phone ever. After that i was one of many first Apple iPhone Owners. It was definitely hyped up alot, and it was a great device, however it got boring quickly. So i sold that, and tried out the Motorola Droid with slideout keyboard. Awesome device....when it worked! Phone would freeze/lag multiple times, then eventually the physical keyboard stopped working. Fail. After having tried, Apple's device, and Android device and being disappointed in both, i was in the market for a new device.First BlackBerry Experience:Thats when i purchased my very first BlackBerry Bold 9700. And thats when i was hooked! A solid and beautifully crafted device, that just offered a premium experience i couldnt get with Apple or Android! So from there, have come to use several BB devices such as the Bold 9930, Curve, then once OS10 was born, owned the Z10, Q10, Passport, Passport Silver Edition (BEST BB10 experience currently available)And Now! BlackBerry PRIV! First Impressions:When, the device came in, i was observing the build quality, and it feels like such a premium device. It has that hardware build quality, I have always felt with BlackBerry devices. This was a bit of a challenge too. Not only do you have a sliding mechanism, that is constantly sliding up down, you have this physical keyboard hidden underneath, that is ALSO functions as a touch sensitive trackpad, so you can scroll, left/right/up down by swiping across the keyboard! Just wonderfully crafted and it still holds up after a year!Software, Camera and Battery Life:It took some getting use to Android, coming from BlackBerry 10. BlackBerry 10 is incredible, but i just came out too late to get traction, and not having access to the app world the way Apple and Android does. really held BB10 back. My Android arrived with Lollipop installed, and it was pretty blazing fast! I also liked BlackBerry's Launcher on the device. It just allows you to still have the Hub where everything you need is all in one section. And its so nice to know you can go into the Google Play App Store, and install any app and know it will work. No sideloading or hoping the app works, because its for a BB10 device. Now the battery life at first wasnt good. It maybe lasted a good 6 HRS with occasional use, but once updated to Marshmallow, the battery life got significantly better! I could go 12 hours, and still have 50% when id get home. This device also rarely, RARELY freezes up or lags, like previous Android device experiences. Camera is also very quick and clear! No issues here.Phone Call Quality and Messaging Experience:GREAT Phone call quality! Clear and crisp. The slideout Physical keyboard is beautiful! I bit small for me however, but keyboard's keys are solid and are constant everytime! I do sometimes type on the virtual BB keyboard which is also brilliant and responsive! But its really nice having those options depending on my mood/preference at the time.Overall:Been very happy with the device. BlackBerry continues to listen to their user base and continues to make refinements and updates to continuously give us the best BlackBerry/Android experience we can get!","rating":5},{"id":"R1XRUKLT7N3XSE","title":"Beware! Carrier unlocked vs factory unlocked.","text":"The phone is very nice. This is more of a warning to people to confirm what they are getting. Most of these sellers are listing \"Unlocked Priv\" and are showing pictures of the factory unlocked device. Don't be surprised if you get an AT&T branded phone at your door. While it will be \"carrier unlocked,\" this is not the same as a factory unlocked phone. You will get the carrier bloatware along with being at the mercy of the carrier for your software updates.","rating":4},{"id":"R3A5OO72P9C1YV","title":"Outstanding Phone","text":"I am biased:  I love BlackBerry phones.  I owned the Bold and the Curve back in the early days of smartphones, then I got all caught up in the iPhone craze.  I came back to BlackBerry when, to my surprise, I discovered they were still in business and making great phones.  I ditched the iPhone, got a Q10 and then a Passport.  I love, love, love BB10, the current OS.  But, like a lot of people, I really missed some of the apps I used on the iPhone.  Of course, BB10 can run some Android apps, just not all of them and some of them run poorly.  Then I found the Priv.  It's an odd but swanky phone that people notice and you'll enjoy using in public.First, let me say that it's a near-top-of-the-line Android phone, so if you like Android, you'll love the Priv.  BlackBerry has tweaked the OS slightly and that tweaking seems to have improved the over all security of the phone.  It comes with the Google Play store preloaded and that is the ONLY place to get your apps, unless you want to download APKPure, another great source for Android apps.  Your BlackBerry apps are not available for the Priv.  This is a BlackBerry phone in name only.Second, this thing is fast!  I mean blazing fast.  I used the Galaxy Note (not sure which version) to compare, and the Priv compares favorably, though the screen was slightly smaller.  Speaking of the screen, it's a huge selling point.  Streaming videos (Netflix or ones locally stored) look awesome.Third, the rear facing camera is slightly better than average.  The front facing camera is not the greatest.  So if you are a compulsive, narcissistic selfie addict, you'll be underwhelmed.  The onboard photography suit is pretty decent, though.Fourth, the keyboards.  Yes, plural.  The slide-out physical keyboard is good, although the keys seem small to me.  Mind you, I was used to the awesome Passport with it's large keys, so my judgment might be a bit subjective.  Typing using the physical keyboard was a bit of a chore, and eventually I found myself slapping it shut so I could use the virtual keyboard, which is outstanding, I have to say.  BlackBerry has scored with its virtual keyboard; it's far, far superior to the iPhone keyboard.Lastly, I give this phone 5 stars because it is a good piece of technology.  People get all caught up in buying a \"name,\" like Samsung or iPhone, but the BlackBerry Priv holds its own in a world awash with good quality phones.  One final point, the build quality is unsurpassed.  This thing is tough; a lot tougher than it feels, which is to me, its only downside - how it feels in the hand.  Maybe it's the slider mechanism, but this phone doesn't feel as \"solid\" as the Passport or the Q10.  But it is, I assure you.  I've dropped it a couple of times and you'd never know it.In the end, I still prefer the BB10 OS to the Android OS; it's smoother, prettier, and more intuitive.  My Passport remains by favorite, go-to phone.  But there's no denying that the Priv is a top notch smartphone that is hard to beat and fun to use.  It was way overpriced when it first came out, but the price has really come down in recent months, making the Priv a wise choice.","rating":5},{"id":"R2AUZKS999KB44","title":"Great screen, good battery life, sub-par camera","text":"Bought this for my wife.  It replaced a Galaxy S7 Edge, so it was up against some stiff competition.  I did NOT expect it to be a better phone, especially with the $320 price tag vs $700 for an unlocked S7.  With that being said, it's a fantastic value for the price.  The biggest negative item here is the camera.  It seems to have a hard time focusing every now and then, it's slow to focus, and the picture quality is only so-so.  The colors seem to be a tad washed out, and the quality degrades more than expected if you zoom in anywhere on a picture that's taken.  Other items of note:- I noticed people complaining about battery life.  The experience I've seen so far is that battery life is NOT an issue.  Perhaps blackberry rolled out an update recently to fix this issue.- It does in fact feel a little top-heavy when sliding out the keyboard.  It's not enough to be detrimental, but it's still noticeable.- Having a physical keyboard to type on again is great.  It does take some getting used to, though, going all these years typing on a screen.- The screen is bright and crisp.  Actually not much different from an S7 as far as I can tell.  It's about as quick, too.  I haven't noticed any lag switching between, opening or closing apps.That's all I can think of for now.  This is over the course of about 2 weeks of use.  I'll update in 30 days and say whether or not the review still stands at 4 stars.  -1 was for the camera issue.","rating":4},{"id":"R19IBRXCTX2EVY","title":"Great phone that just ended up not being for me","text":"Really wonderful phone. So glad Blackberry combined with Android to make such a phenomenal phone.PROS:Beautiful ScreenGreat Blackberry apps and featuresBlackberry full encryption securityloud front speakerAwesome battery lifevery functional slide out keyboardHigh quality build overallNice cameraCONS: (nitpicking not really cons)low-ish quality front camera (doesn't bother me at all)If you are much faster with touchscreen keyboard, the physical keyboard can end up feeling uselessI was between this phone and the Moto X Pure Edition. I decided to try this one first. I really did love it. Everything is very smooth on it. Blackberry has created one of the lightest and smoothest launchers and features. Blackberry hub is really neat especially for people who are constantly communicating over multiple mediums. In the end tho I felt as if I would be happier with a Moto X (and I am) mostly because I just did not feel like I put the keyboard to use, as good as it is, because I have become so efficient with the Google keyboard. I gave this phone to my dad because he missed his Blackberrys of old. He loves this phone. It's basically the perfect blend of all the wonderful things a Blackberry should have with the efficiency and utility of Android. Highly recommend this phone to anyone looking for a physical keyboard.","rating":4},{"id":"R3O36TN8MEN1M1","title":"Dont be hesitant to get this phone!","text":"Im 22 and had a galaxy s6 active and I've always wanted to go back to a keyboard phone but didn't want to go back to basic. I took a chance buying this phone because I was afraid to switch to blackberry because it seemed so outdated.If you are in the position I was in, I say do it! It is such an awesome phone!!!! It is android powered so it can do everything a galaxy phone can do. It's very modern! I love the quirky features it has when it comes to customizing.The phone is fast, updated, modern, and it works amazingly! I use the keyboard and the on screen keyboard. I love both of the options.The only con (that's why it's 4 stars) I see with this phone is the 2mp camera in the front. It sucks for selfie lovers but honestly, it doesn't even seem like a big deal. The back camera is 18mp, more than the galaxy s6, so if you really wanted to take a selfie, just the phone around, it's big enough to hold. Overall, I love it! And I recommend getting it!!!!!","rating":4},{"id":"R1BB5B95DVPRIM","title":"I think ill keep it. (One year update)","text":"If you're like me, then 90 percent of the reason you're considering this phone is for the keyboard. In fact I went so far as to switch carriers, and take a more expensive plan just to get this phone. I have been searching for about 2 years for an updated smart phone with a physical keyboard. When the passport came out I was excited. I liked the look of it, but upon learning it ran blackberry os, I decided that it ultimately was not for me. So when the priv came out, imagine my surprise.My first 10 minutes with the priv were disappointing. I found the device clunky, buggy, and could visibly watch the battery life drain. On top of that the physical keyboard, which was the main reason I bought the phone, was difficult for me to use even though I do not have large fingers. Dismayed I thought about returning it, but the thought of having to re-port my number was even more unappealing. Do I gave it a chance and I will admit its growing on me. Here are my pros and consPros:The physical keyboard: pure and simple the physical keys are a godsend for me. I can't stand touch typing I honestly don't feel like that technology is really there for it yet. The privs keyboard, while not without several shortcomings is usable. I am finding that I get better with it each day and I by no means feel like I've topped out my learning curve. One feature that I'm really beginning to appreciate is that touch sensitive physical keys- meaning that I can type a please then simply swipe my finger upward if I like the one predicted word. If not I just keep typing with my accurate physical keys. Accuracy when you want it precision when you need it. Autocorrect when you want it and precision when you dont. One of my main gripes with predictive technology is that I have to frequently fight it to type words that I want, God forbid I have to type a proper noun or anything of that sort. The touch sensitive physical keyboard is also handy for navigation as you can use it to move around the screen and navigate websites without having to move your fingers to the upper part of the phone. The keyboard, for all its shortcomings is growing on me.Blackberry suite: if you're into that. The only thing that's been nice has been using the hub to sync all my email accounts, but I'm not a member of the blackberry cult so I don't use BBM etc. Overall I could take or leave the blackberry hub, this is android so there us a short third part app for everything that usually does what you want it to do.And for me... that where the pros really end. It has lots of ram but it doesn't feel well utilized...Cons:Overall design:  I am really scratching my head on this one. I really don't understand what blackberry was thinking when they designed this thing. It's huge, unwieldy and the curved screen just seems to be something I accidentally rub my finger on and accidentally swap the screen. To be honest I don't get the curved edge screen thing, so maybe it's just not my style. The phone is massive as it is but on top of that there's a pull down keyboard. When the keyboard is slid out the balance is awkward. You cannot operate this device one handed. I am baffled about this. It's just uncomfortable to hold any way you try it. The main focus of the phone which I would think to be the keyboard is small and not very ergonomic. As I type my hands are starting to get cramped up.Heat: it gets hot, doesn't bother me but some other users were griping about it.Battery life: OK this part actually scares me. The battery life is atrocious. It's actually the main reason I considered returning the thing. I it's gone frome 84 to 73 percent from the beginning of this review till now. Yes I get it I am online, but seriously... I don't know how blackberry got away with releasing it this way. I will note that many claimed this is due to poor optimization and this may be the case. Other reviewers noted that there is a wearing in time , and that I should expect to wait 2 weeks for the battery to improve. If I will give it this: the battery life is improving but boy does it make me nervous.Buggy: I'm not sure why people say that android is inherently buggy because ithis hasn't been my experience. The bugs aren't bad... it's just not polished. Especially for the priceOther things:Camera seems fineThe phone is very slimLooks goofy with keyboard slid outThe back seems thin... I don't feel like this phone would survive a fall very well. It doesn't necessarily feel cheap or anything just fragile.I guess the bottom line is that when I pay 650 dollars (or more) for a phone I expect a pretty darn polished experience.  I didn't feel like blackberry delivered. I can't say that I recommend this phone at that price. If it were in the 300 dollar range I'd find all these quirks a bit more acceptable.I will note this: the priv does grow on me as I use it more. I started this as a 3 star review and dropped it to a 2 because I really couldn't think of any pros other than the typing experience (which continues to grow alongside the battery life (hopefully)). I think if the UI gets some more updates and the battery stabilizes I will update to a solid 3 stars, but I can't in good confidence do that now. I think the main reasons I'm keeping it are more out of laziness and not wanting to go through the hassle of returning it. If that changes I will update my review. My recommendation to those like me who miss a physical keyboard would be to wait, unless you're feeling like burning some money. Wait for a significant drop in price, update in UI, or a different device. I wanted very much to like this phone... I really really did. Battery at 70 percent as I finish. Scratch that 69.____________________________Well it's been a year now, and Ill say that I've dropped my review another star. And then there was one:On the overheating: I mentioned earlier, this phone gets hot. I didn't really have a problem with that, but as of late I've started to get \"overheating messages\" which bogs down cpu performance, and makes the phone barely usable until it cools off. This can happen when I play graphically intense games, or watch movies.The keyboard: still about the same. I seemed to have maxed out at a sreasonable typing speed, I think mostly due to the cramped nature and awkward position that your hands are forced into to both support the weight of this collassal beast, and simultaneously type.Battery life: Abysmal. Great when you're not using it, but when you do anything, and I mean anything you can watch the battery drain. A few times I've been streaming a movie with the battery plugged in at 20 percent, and the phone has actually died on the charger.Build quality: so far the screen has held up pretty darn wel. Not reality any major scratches, I take good care of it, but based on previous phones I would have expected more scratches. It has survived a few fairly nasty falls.The USB port however seems frail. The charger that came with it died on me last night, and the way the plug fits into the phone to charge makes me nervous.Still feels clumsyUI still feels clunky and underpowered, even though the specs are technically impressive. I'm finding that the UI seems to be getting buggier as time goes on for some reason, even though Updates continue to come.But still after all this...i just can't bring myself to give up my physical keyboard. It's so convenient to be able to walk, and text without looking (remember that! Texting without looking?)If any tech guru venture capitalist is reading this somewhere, please, don't let qwerty phones die.Still bitter about paying 600 for it, and watching the price plumett. At its current price of around 350, I don't know that I could firmly recommend. 200 range, I think would be a good buy imo, if you're OK with the afformentioned quirks.","rating":1},{"id":"R201KUJ26BBZS","title":"but this is a fine android phone","text":"Using a tiny onscreen keyboard really slows me down, so I got this for the real keyboard.  Turns out the screen is big enough to have an onscreen keyboard that is reasonable to use.  I never had a blackberry before, but this is a fine android phone.  eye candy.  It supports the 802.11ac standard for WiFi, so I was able to get 450Mbps d/l speed.  (no, that is not a typo)Liked it so much I gave one as a gift.","rating":5},{"id":"R2B6GD43WH6UHI","title":"PRIV is the way to go.","text":"I switched to the PRIV from a Passport, so it was quite a change going from BB10 to Android. This device, however, makes that transition very easy. I have owned it for a few months now, and I am extremely satisfied with the performance. There is a certain clunky feeling that comes with android, since every simple action runs on an app of its own (i.e. text messaging), but the phone itself is very solid. And of course, the physical keyboard is awesome!","rating":5},{"id":"R1BV1AZN4FTVH7","title":"It's a great Phone. I switched from iPhone to this one","text":"It's a great Phone. I switched from iPhone to this one. I don't like the screen keyboard instead I like the Physical key board. It took some time to get back to me to the Physical key board world. Wonderful Phone!!!","rating":5},{"id":"RZLDUA0MGZXIJ","title":"its an att phone, and the unlocking code doesn't ...","text":"its an att phone, and the unlocking code doesn't work. I think  I was cheated!  hopefully I can get my fully refund.  why us choose amazon? because we believe in it.  but now …","rating":1},{"id":"ROI5ESGCZSLZI","title":"Can one be in love with a phone?","text":"This is, far and away, the best phone I've ever had. It is beautiful and well-made, with the rounded edges a stylish and comfortable touch that makes the device feel high-end and special. I recently took the phone on a trip to Europe, and the camera absolutely astounded me and everyone around me with the level of detail and capabilities in all different light levels. Like many cameras, it struggled a little in backlit situations. This was the only way in which my friend's iPhone was a little better. But in all other ways he was jealous of the Priv's photos. I've received many oohs and ahs over the pictures I took, from glorious landscapes to dim church interiors.I have missed having a physical keyboard so much, and I am loving the accuracy and speed with which I can type on the Priv after years of struggling with touch screens. It does take some getting used to, so give yourself a week or two to reacquaint yourself with the keyboard, but I am soooo much less frustrated when I type now than I was on every other Android.I've heard complaints about the battery life but find it comparable to other Androids. It seems to run down quickly at the beginning of the battery cycle but make it through the rest of the day. I made it through days of heavy use, including GPS, camera, and email/social networking. While the battery isn't its best feature, in my experience it's not a reason to avoid the phone.I'm just thrilled to have Blackberry back with the benefits and app choices of Android, along with a spectacular camera. Well done, Blackberry!EDIT NOTE: I have T-Mobile, and had 0 problems getting this AT&T phone to work with my SIM card. That said, getting over the air updates is not, for now, possible with this particular version of the phone. For me, the price difference is worth it, and I understand that Blackberry is working on an easier way for people like me to get updates. Still, this hasn't bothered me since I have no issues with the current OS.","rating":5},{"id":"R3C18100O6X07","title":"Improve my Android user experience. Good camera.","text":"Great phone for productivity and entertainment. It can handles all tasks just like other top Android phones. But Blackberry's customization improves Android experience by miles. For example, I use the swipe up and left to launch the device search a lot, and edge swipe for quick  look at today agenda. The tile-style multitasking view (likes in BB10) is more usable than Android card stack.Pro1. Apps! Now I can just carry one device that has the great HUB for communication and all apps from Android play store. Working on Docs, keeps, sheets with the physical keyboard is very fluid.2. Very good screen.  Better than Samsung S6 IMO.  Brighter, more color adjustment, sharp.3. Good sound.  The front facing speaker is good for video watching and conference call.4. Good camera. It has good lenses and software.  Images are sharp and full of details.Note: watch youtube channel JoeTestedThat for extensive camera, screen, and sound comparison with SGS6.5. Physical keyboard is handy. I like that I can see the full screen when typing. No more annoying screen block from the virtual keyboard.6. Battery life is good for Android phone. It can last all day in my normal use.Con1. Size is a little too big for my like. It is almost as big as Samsung Note 3 (I use Note 3 case on Priv). Very challenging to use with one hand.2. Blackberry software is still immature. It lacks the native file manager. USB OTG takes many step to use.  The use of SD card is not smooth, like the camera app always popup to ask to save on SD card every time. Hub is not as fluid as in BB10. But I  think these issues can be improved with more updates.3. The device gets hot when running high graphic app.  Even Disney magic timer app (tooth brushing video) makes Priv hot, lol.4. The wireless charging doesn't work on my phone (unlocked from Amazon ). I thought all STV100-1 has it.5. Camera app is slow comparing to other phone. Low light images are OK but not great. Forget about selfie, the front facing camera sucks.","rating":5},{"id":"RADRRMKAPH6NO","title":"Back to Blackberry!","text":"After a few years of using HTC, Samsung, and One Plus phones, I am glad to be back on Blackberry hardware. The phone feels sturdy and the keyboard/track pad makes typing and navigating webpages so much easier.My Android apps transferred easily from one phone to this one through NFC. I'm still getting used to working with Blackberry Hub, but so far so good.One gripe is the battery life. My One Plus would last up to 2 full days of moderate use, but this phone may not make it through on while day without a charge... I'm not sure if this is software related, or if it is because of the fact that this phone runs warm.  Either way, I hope Blackberry addresses this issue soon in one of their frequent updates.  My old Bold had such amazing battery life, so I believe this is something that Blackberry can fix for a five star review.","rating":4},{"id":"R2FI9MEMZDHTS1","title":"Great battery life, otherwise...meh...","text":"Pros1. Great battery life....on my second day and still 45% left.2. Nice screenCons1. The shape of this phone is very uncomfortable to hold. It digs into your hand.2. The physical keyboard is just ok, but useless, generally speaking. I only use it as a slider for reading. Ergonomically speaking not as natural as they used to be.3. As another reviewer mentioned, there's a slight movement between the body and the slider part when closed. Sometimes my hair gets stuck in the gap, when I'm talking on the phone... Very annoying.","rating":2},{"id":"R1AUE1SPDSBTKZ","title":"Very Poor Battery Life and Never Had A Phone Get So Hot To Touch.","text":"First off, beware that you must contact seller before purchase to determine what you will be getting! Is it a Carrier phone suchas ATT or is it truly an unbranded Priv! By Blackberry means made by BB and not who is selling it nor if it is or isn't a carrier branded phone! Look for SELLER lower down on Amazon page. Now to the phone, I bought on and went on a trip. The Priv was plugged into car charger while driving. While using Navigation and blue tooth streaming music to the car the phones became terribly hot, I've never felt a phone get this hot ever. I could feel the heat rising from 4 inches above phone with the palm of my hand. When I put it to my ear the first time for a call it through me off it was so hot, it was do-able but un-comfortable. Out of the car, waking up to 100% charge at 7AM and by 9AM the charge was down to 67% with simple web surfing. I had time before leaving on trip to let it update, but Marshmallow wasn't available at the time so I cannot speak to a Priv on MM. I cannot stay tied to a charger so I sent it back and immediately bought a new Passport which I next day shipped to me so that I could finish the trip, which should show you how unhappy I was with the Priv.","rating":2},{"id":"R3IPQRRE71WK1R","title":"absolutely love it. one pointer i'd like to give people","text":"absolutely love it. one pointer i'd like to give people. I found the volume with the included headphones to be extremely low, you can improve it by using your Classic or Passport headphones and you'll see a 50% improvement on max volume","rating":5},{"id":"R1S1ZF7RK02XOP","title":"Two Stars","text":"I sold it, it keeps hanging","rating":2},{"id":"R2OWDKO8CF2755","title":"Great mix between BlackBerry and Android","text":"Great mix between BlackBerry and Android. Not only does the phone provide a near stock Android experience, it adds some intangibles such as the physical keyboard for precise typing along with with top notch security and productivity apps. Aside from that, a great screen for watching media and surfing the Web. Phone is a top pick  for 2015.","rating":5},{"id":"R13SWN7YCH9HK7","title":"Excellent phone for professionals.","text":"Great phone, marvelous screen. Very good sound and speaker mode. Lots of options and modes to set and play with. Love it. Google Play store apps a great plus. Solid build. Great battery life. After a week I get used typing again faster on the slide out keyboard.","rating":5},{"id":"R32R3K9R6ICBC","title":"Android phone with a keyboard!","text":"Been waiting a while for another android slider. Keyboard works great, I can almost type without looking at the phone. Nice to be able to answer calls by flicking the phone open (even if you're wearing gloves). Keyboard doubles as a trackpad. Supports HDMI (slimport) and USB OTG. Also wireless charging, as well as QC 2.0. I get about 5-6hr screen-on-time on average.The best part of this phone is the ability to hang up by SLAMMING THE PHONE SHUT!!! YEAH!!!!!  ...uh, sorry, got a little carried away there.","rating":5},{"id":"R2QTS1TYRZHPBI","title":"Such a great phone. It is too bad it hasn't not ...","text":"Such a great phone. It is too bad it hasn't not sold well due to poor marketing. Even though it was released in Dec-2015 for AT&T and is coming on 6 months in the mkt with other US carriers, It is still superior to many other current phones being offered. I got a great deal for $420 on Amazon. I would have bought sooner at a higher price.  I was waiting for Sprint to offer this on their network. Since they announced they would not support it, I dumped Sprint and switched to T-Mobile. It is unlocked and has the AT&T logo on the back but works perfectly on the T-Mobile network. I have had no issues with this phone...I love it!!!!","rating":5},{"id":"R2PITOU0YUTIN7","title":"Out of all mobiles I've owned, this one blows me away!","text":"Best mobile phone i've had. I've tried all of them, everything from iPhone 5s and 6s, Samsung Galaxy, Nokia. This phone blows me away. They've thought about all the little details, it's super responsive, keyboard is the fastest I've experienced. I wanted to add Facebook events to my calendar and wasn't sure how to, spoke with Blackeberry on Twitter and they fixed me up. Very happy, thanks Blackberry!","rating":5},{"id":"R1BGBBF2EP1U3E","title":"This is an AT&T Unlocked carrier phone...Not a Blackberry factory unlocked phone","text":"I'm a blackberry fan and since I cracked my screen of my passport, I went ahead and replaced it with priv.  The phone is nice.  It was suppose to be delivered by fedex at certain, it did not.  No fault of the seller.  FedEx service in my residential area is unsatisfactory.  However, when I opened the boxed I noticed that it was in AT&T packaging, booted up with an AT&T mobile log and has a AT&T logo on the back of the phone.  And upon further review it has AT&T apps loaded that you cannot delete.  So this is truly not a factory unlocked phone from blackberry but an unlocked AT&T blackberry priv.  The description should say that.  I use TMO as my carrier and now I have unnecessary applications taking up memory space on my phone.  I'm planning on sending it back because I wanted a TRUE unlocked blackberry phone.  Please update your description to indicate that this is a AT&T unlocked carrier phone.  Even though my TMO sim works fine, I have to deal with the AT&T loaded apps, software and settings.","rating":3},{"id":"R2KPNXIIVNI17J","title":"I had been considering this phone for a while as I like physical keyboards","text":"OK.  I had been considering this phone for a while as I like physical keyboards.  When my phone died I got this.  I did buy it from Amazon open box deals at a fairly good price, crossing my fingers that it won't be scratched and works properly.  I was happy to say it looked new.  Fab!  A bargain for once.  However, it was not pairing with my samsung gear s2.  And it was not charging on the charging pad.  Why?  Because, on the box it says made for Canada.  The listing said has a US warranty.  Nowhere did it say a canadian phone. I knew that the canadian versions are unable to charge on charge pads so would not have bought if I knew.  Is this why it would not connect to my s2?Anyway, as usual, thank goodness I purchased from Amazon whom refunded me.It is a lovely phone.  It is heavy.  And what a luxury to have physical keyboard.","rating":4},{"id":"RI8V5S41B8OOF","title":"this phone won't disappoint. It's admittedly my first forray into Android","text":"If a QWERTY keyboard is a must have, this phone won't disappoint. It's admittedly my first forray into Android, so my comparative analysis is going to be naturally lacking. It doesn't make up for problems that are inherent to most other Android manufacturers, but each company has it's strengths and weaknesses. Some of the BlackBerry proprietary apps are nice (Dtek, Hub), others, not so much.At the end of the day though, you're buying hardware, not software. Devices are getting harder and harder to root as OS security improves, so blackberry's resistance to allowing root on the Priv is less relevant than it may have been in the past.It certainly gets hot (105F, 30ishC), but I've read that to be a common issue with the Android OS generally, and snapdragon processors specifically.Really, it's a qwerty phone with good hardware, and it runs Android. Keyboards are a must for me, so this is my phone. Were I not so stuck on physical keyboards, a Nexus or Motorola might have been my choice.Keep it up BB, I'm rootin' for you.","rating":4},{"id":"R2EYFEG98IZDD9","title":"May be unlocked but not entirely carrier-agnostic","text":"AT&T logo on the box and etched into the back of the phone, with many AT&T apps pre-installed on the phone -- wish that had been disclosed in the product description (though I honestly don't know if it would have affected my decision to buy).  Other than that, after less than a day it seems to be a great phone.  QWERTY keyboard slide was a little stiff at first, but is now easier to use -- I'm a huge fan of tactile QWERTY keyboards on phones (major factor in my purchase decision) and this is one of the best I've ever used.  Display clarity is excellent, perhaps due to the curved screen.  Battery performed very well during initial downloading / installation of my favorite apps, with plenty of memory for all, although as other reviewers have noted the back (battery area) gets very warm to the touch when the phone is \"awake\".  On balance, I'm pleased with this phone so far ...","rating":4},{"id":"RKJZV6SV2JRL8","title":"Best smart phone","text":"I got mine last week and because it was an AT&T, updates are slow to be qualified and that means MM and security updates.Happy to get BlackBerry PRIV. It should list AT&T in detail name and specs.I sold my iPhone 6S plus for this, previously had Note II, S6 and a 5S - this tops all those. Size, weights, screen, how apps behave.But I had hoped now that6.01 is rolled out - for non-ATT to have the improved Security and battery performance-oriented well, have to wait on MM.","rating":5},{"id":"R1ME8V564MKLDK","title":"Physically the phone is perfect I love that it has an option for a ...","text":"Physically the phone is perfect I love that it has an option for a physical  keypad and it feels pretty solid so no complaints there, but it dos have some odd software hiccups nothing that would break my opinion of the phone just a little annoying besides that I still think it is an amazing phone.","rating":5},{"id":"R3JVKYYMUDTH93","title":"The build quality of this phone is great and I am falling back in love with a ...","text":"I just received the priv today and finished setting up. The build quality of this phone is great and I am falling back in love with a physical keyboard. The only issue is the duplicate notifications but that can only improve since its software.This is really the phone to get","rating":5},{"id":"R37Z3RQ51LUSFA","title":"Love the Keyboard","text":"I am in love with my Priv! My favorite function is the keyboard! I really like using the keyboard. And the screen is big. I love the entire design.","rating":5},{"id":"R3VQBEEOEQHXTI","title":"Great smartphone for former BB users","text":"Exellant smartphone, BB hub works well as expected, however the keys on the physical keyboard are a bit small compared with my old BB Torch.  I have aso had problems opening documents in dropbox.But generally I'm satisfied.","rating":4},{"id":"R2GPEQ9OWI422E","title":"Great BlackBerry Android phone!","text":"Great Phone! The PKB really is useful and I found it faster to type with it rather than the VKB. The more updates it gets the better it has been getting! Awesome camera as well!","rating":5},{"id":"R1F2ERYRZ4233S","title":"The phone is ok, but be careful","text":"The phone is Ok, but it is an ATT branded phone. That condition is not mentioned in the publication on Amazon. The issue is: I live in Costa Rica and as I do not have a sim card from ATT, I will not be able to update the Android versión of the phone. AFAIK, there is no solution to this problem.","rating":1},{"id":"R1SFXPV6Y6D5CF","title":"Blackberry might not be done...","text":"At the time of testing, I had the Nexus 6P, Oneplus 3, and Samsung Galaxy 7.There is something very attractive about the size of the phone even with the keyboard. That said, I used the keyboard 15% as much as I thought. The phone is fast and is a great Android phone. The battery life was kind of the killer but it's much better than my S7 so now I think of it more highly. I also think I took USB C, but I might be confusing that with the OnePlus 3. Would rank the Oneplus 3 slightly ahead but think the Priv is more secure for those in highly sensitive environments or that fancy a slightly different look.","rating":4},{"id":"R1R6R4FS1TD44E","title":"Five Stars","text":"is perfect","rating":5},{"id":"R2DHKSPQ7H6FJP","title":"i am very disappointed.","text":"This phone has problems:very often shows \"work folder has stopped\",also overheating often,last 3 weeks the Google play store has stopped .Now i can not use play store,i am very disappointed.","rating":2},{"id":"R3T1VATXWC5WJP","title":"This was a horrible purchase. I am very unsatisfied with the product","text":"Might have gotten a defective phone but either way, I'm sharing my experience with the product I had received. The phone gets warm during usage, even for a short amount of time. The phone lags a lot. After a month a half, the phone died and now I am phone less again!  This was a horrible purchase. I am very unsatisfied with the product.","rating":1},{"id":"R3UCP7IGCEVUDE","title":"Five Stars","text":"Excellent product, delivery in a timely manner.","rating":5},{"id":"RSPCNMHQTRJKA","title":"BlackBerry Priv -Android and very safe phone.","text":"The best and safe smartphone, with android, so far.","rating":5},{"id":"RYM1OYSQABPB9","title":"PRIV is fun, functional, and fragile","text":"I am a lifetime Blackberry user. The PRIV is a good mix of Blackberry and Android and it has good tools for monitoring which programs are using what data, how much data, etc. Obviously, it has the keyboard, which is well made. Blackberry fans should like that. I am giving the phone a low rating, however, because the screen seems to be very fragile despite being advertised by BlackBerry and all its retailers as being made of very durable Corning Gorilla glass and having been \"rigorously drop tested.\" It's far more fragile than any other phone I've had, including other Blackberrys. If you look around online, you'll see myriad other users have had problems with the screen. In particular, minor impacts that would not damage the screen on another smartphone seem to shatter the PRIV's screen. Even this wouldn't be such a problem if a) reasonably priced parts were available for this easily replaceable screen or b) Blackberry and its retailers stood by Blackberry's claims about the screen's durability, which they do not. Finally, Blackberry customer service has been absolutely terrible so far both from a sales perspective and a support perspective.","rating":2},{"id":"R32R3K9R6ICBC","title":"Android phone with a keyboard!","text":"Been waiting a while for another android slider. Keyboard works great, I can almost type without looking at the phone. Nice to be able to answer calls by flicking the phone open (even if you're wearing gloves). Keyboard doubles as a trackpad. Supports HDMI (slimport) and USB OTG. Also wireless charging, as well as QC 2.0. I get about 5-6hr screen-on-time on average.The best part of this phone is the ability to hang up by SLAMMING THE PHONE SHUT!!! YEAH!!!!!  ...uh, sorry, got a little carried away there.","rating":5},{"id":"RKKNGUCG6F0J8","title":"AT&T unlocked phone - not a true unlocked PRIV","text":"Understand that this seller is selling unlocked AT&T BRANDED phones.If you happen to be on AT&T, then great! This phone will be a fantastic buy. The screenis gorgeous and large. The OS runs smoothly and is of course secure. The typingexperience, touch pad or slide out, is great. Really no complaints regrading the hardware.For me however, 4-stars, because the seller does not really disclose that this is aAT&T based phone, not a truly unlocked PRIV. I roll T-Mobile, so updating to Marshmallow 6.0is not going to happen for me. I also loose out on several other features of my T-Mobileservice because this is not a true unlocked phone. Other than that, seller seems ok and thiswill not deter me from purchasing from them in the future (so long as they properly refundmy purchase... I will update my review based on my full interactions with the seller).","rating":4},{"id":"R1ZJUT75QS8O0C","title":"Five Stars","text":"Best phone ever. Good battery too. Keyboard for very fast typing . Beautiful display.","rating":5},{"id":"RMRU7LKLI97K1","title":"BlackBerry Stays Relevant","text":"A remarkable attempt by BlackBerry to stay relevant.It is a bit of a reverse learning curve to use the physical keyboard. But there are other advantages.","rating":4},{"id":"ROQ059CJXIQKN","title":"It's curved look appears like the Samsung edge phone","text":"It's curved look appears like the Samsung edge phone. Benefits of touch + keyboard and with Android u now have access to all apps. Best of both worlds","rating":5},{"id":"R2YXP9RQQCI3V","title":"Priv is beauty","text":"It is a bit slow as compared to other androids. But I bought it becaue of its beauty... I'm in love with its shapeP.S unlocked AT n T phones are lagging marshmallow update, dnt know how much time they will take , rest of all the privs have been updated","rating":4},{"id":"R13SWN7YCH9HK7","title":"Excellent phone for professionals.","text":"Great phone, marvelous screen. Very good sound and speaker mode. Lots of options and modes to set and play with. Love it. Google Play store apps a great plus. Solid build. Great battery life. After a week I get used typing again faster on the slide out keyboard.","rating":5},{"id":"R35TC6OY2VNKHJ","title":"Five Stars","text":"so far I love it, only the problem i have, it gets hot sometimes, but its a great phone.","rating":5},{"id":"R1BGBBF2EP1U3E","title":"This is an AT&T Unlocked carrier phone...Not a Blackberry factory unlocked phone","text":"I'm a blackberry fan and since I cracked my screen of my passport, I went ahead and replaced it with priv.  The phone is nice.  It was suppose to be delivered by fedex at certain, it did not.  No fault of the seller.  FedEx service in my residential area is unsatisfactory.  However, when I opened the boxed I noticed that it was in AT&T packaging, booted up with an AT&T mobile log and has a AT&T logo on the back of the phone.  And upon further review it has AT&T apps loaded that you cannot delete.  So this is truly not a factory unlocked phone from blackberry but an unlocked AT&T blackberry priv.  The description should say that.  I use TMO as my carrier and now I have unnecessary applications taking up memory space on my phone.  I'm planning on sending it back because I wanted a TRUE unlocked blackberry phone.  Please update your description to indicate that this is a AT&T unlocked carrier phone.  Even though my TMO sim works fine, I have to deal with the AT&T loaded apps, software and settings.","rating":3},{"id":"R1L32VMYE5GASA","title":"Great phone","text":"Switched from an HTC One M7, which I was very happy with. But this definitely beat out the HTC--is just a fantastic phone. Blackberry has done their best to keep on top of things and am pleased with their new orientation. Hopefully it keeps up.","rating":5},{"id":"R64ILDRMIOTMG","title":"BUY Directly from Amazon!","text":"Make sure you buy it directly from Amazon to receive the factory unlocked and uncarrier blackberry priv. Although its a bit more expensive to buy directly from amazon you get a pure blackberry , no carrier logos or boxes or bloatware.  You also get updates immediately. Its a fantastic phone and it feels good to support a Canadian/American company in this day and age!","rating":5},{"id":"R2FKA86XPNS3V7","title":"Surprisingly great phone","text":"Really good fast phone with a great camera and tons of BlackBerry services  and battery life which help make the device standout. I like it more than expected and very satisfied. Only knock is most of the stock Google Apps outside of maps are meh but otherwise I'm impressed.","rating":5},{"id":"R3R4PB4LXL108J","title":"Great phone","text":"Really loving this phone.  For me it's much better than my iPhone.  Only snag is that the keyboard is a teeny weeny bit slow, but not enough of an issue to be mark it down.","rating":5},{"id":"R1DZ8YMZVNVAUK","title":"The best feature is the push email","text":"A tool and not a toy. The best feature is the push email, no sync necessary. If timely email  receipt is important and you have sketchy cell coverage, push email is a must. Continuous reception needs to be in effect when the device decides to sync or you will miss  a quick response.  Item was delivered timely and as described.","rating":5},{"id":"RKJZV6SV2JRL8","title":"Best smart phone","text":"I got mine last week and because it was an AT&T, updates are slow to be qualified and that means MM and security updates.Happy to get BlackBerry PRIV. It should list AT&T in detail name and specs.I sold my iPhone 6S plus for this, previously had Note II, S6 and a 5S - this tops all those. Size, weights, screen, how apps behave.But I had hoped now that6.01 is rolled out - for non-ATT to have the improved Security and battery performance-oriented well, have to wait on MM.","rating":5},{"id":"R3IPQRRE71WK1R","title":"absolutely love it. one pointer i'd like to give people","text":"absolutely love it. one pointer i'd like to give people. I found the volume with the included headphones to be extremely low, you can improve it by using your Classic or Passport headphones and you'll see a 50% improvement on max volume","rating":5},{"id":"R3MF263PXQGSTK","title":"While the item that I received was, in fact ...","text":"While the item that I received was, in fact, an unlocked version of this phone, it was an AT&T branded unlocked phone.  It will work on any GSM network, but the unlocked AT&T versions of this phone are currently unable to receive security updates or other software upgrades unless you are connected to the AT&T network with an AT&T SIM card.  If this is acceptable for you, then by all means this phone will work well.  As for me, I can say that the return process has gone very smoothly.","rating":2},{"id":"R2QBEBL0AW9JWW","title":"but don't scratch easily. The touch screen not glass so i recommend ...","text":"there are a few minor things but nothing from keeping me from loving the phone. The back is kind of cheap and flexes, but don't scratch easily. The touch screen not glass so i recommend the gorilla glass accessory. The blackberry stuff is there, but i don't really use it and is a sold android phone. overall, i love the keyboard and the phone!","rating":4},{"id":"RILM3JVJ7UNI9","title":"The best phone for 2015","text":"BlackBerry has a winning  with this one. This is the best phone for the year so far. The dual keyboard is a huge advantage I use the virtual keyboard for messages and the physical one for writing documents. The Android OS is excellent and smooth with this phone. I never thought I would say this but I love the BlackBerry and Android combination.","rating":5},{"id":"RADRRMKAPH6NO","title":"Back to Blackberry!","text":"After a few years of using HTC, Samsung, and One Plus phones, I am glad to be back on Blackberry hardware. The phone feels sturdy and the keyboard/track pad makes typing and navigating webpages so much easier.My Android apps transferred easily from one phone to this one through NFC. I'm still getting used to working with Blackberry Hub, but so far so good.One gripe is the battery life. My One Plus would last up to 2 full days of moderate use, but this phone may not make it through on while day without a charge... I'm not sure if this is software related, or if it is because of the fact that this phone runs warm.  Either way, I hope Blackberry addresses this issue soon in one of their frequent updates.  My old Bold had such amazing battery life, so I believe this is something that Blackberry can fix for a five star review.","rating":4},{"id":"R2PITOU0YUTIN7","title":"Out of all mobiles I've owned, this one blows me away!","text":"Best mobile phone i've had. I've tried all of them, everything from iPhone 5s and 6s, Samsung Galaxy, Nokia. This phone blows me away. They've thought about all the little details, it's super responsive, keyboard is the fastest I've experienced. I wanted to add Facebook events to my calendar and wasn't sure how to, spoke with Blackeberry on Twitter and they fixed me up. Very happy, thanks Blackberry!","rating":5},{"id":"R2HE15EV4MXQDD","title":"I love the features of the phone itself but that is ...","text":"I've had this phone for 2.5 months and it slid off my desk onto CARPET while it had the case on that I purchased from blackberry for this phone and the screen dented and cracked. Not durable at all. I love the features of the phone itself but that is pretty ridiculous in terms of durability.","rating":2},{"id":"RU1FJJBF4NDRS","title":"It's Great!","text":"I've used Blackberries for many years, and I was nervous about changing to Android.  I didn't know how much work it would be to convert, and I wasn't sure about that slide-out keyboard.  The actual transition was pretty easy, and it hasn't been difficult to learn to use the Android-based version.  The keyboard works well.  Whenever I have something very short to type, I use the \"glass\" keyboard that automatically pop us.  For anything long, or for anything that is alphanumeric, I use the slide-out keyboard, which is great.The screen is stunning!  I can't believe how good pictures look, and I really enjoy having a much larger landscape.  This device replaced my Blackberry Classic.  I am so glad that I bought it.","rating":5},{"id":"R9IYS7YME5CDP","title":"It is working good now, but customer support was required from both ...","text":"This is not a factory unlocked phone.  It is an AT&T version.  It is carrier unlocked.  It is working good now, but customer support was required from both T-Mobile and Blackberry several times to achieve this.","rating":3},{"id":"R2QTS1TYRZHPBI","title":"Such a great phone. It is too bad it hasn't not ...","text":"Such a great phone. It is too bad it hasn't not sold well due to poor marketing. Even though it was released in Dec-2015 for AT&T and is coming on 6 months in the mkt with other US carriers, It is still superior to many other current phones being offered. I got a great deal for $420 on Amazon. I would have bought sooner at a higher price.  I was waiting for Sprint to offer this on their network. Since they announced they would not support it, I dumped Sprint and switched to T-Mobile. It is unlocked and has the AT&T logo on the back but works perfectly on the T-Mobile network. I have had no issues with this phone...I love it!!!!","rating":5},{"id":"R1RE9LBJKW3R4J","title":"The screen is beautiful and the menu design is great","text":"The screen is beautiful and the menu design is great. Being a Blackberry, the product is sturdy in that it can take a lot of damage and still look and work fine. I've dropped it a few times, or put it in the same pocket as my keys, and still not a scratch. The processing power is good for my needs as I've never experienced input lag from social media apps or Google apps.The battery can last for about 2.5 days if you use the phone sparingly throughout the day for notifications or phone calls.For snapshots, the native camera app lets you pick a spot to focus on, and you can take snapshots using the side volume buttons if you want to take a wide screen shot. The video recording is actually very nice and is great at adjusting color balance.","rating":5},{"id":"R31A0WMTF9W4LM","title":"If you prefer Android, you should seriously consider this phone for what BlackBerry adds to it, including more security.","text":"So far it has been a great experience with this phone. I am customizing my Android experience nicely and really not missing my BB10 which I thought I would. BB10 is a great OS which world doesn't know about. A big error by BlackBerry, but it seems the latest OS from Android has covering some ground.I think a big plus for this phone is the additions of the BlackBerry integration. I think it really enhances the Android experience and not to mention make it more secure. Plus, the physical keypad. Nice.If you prefer Android, you should seriously consider this phone for what BlackBerry adds to it, including more security in a really nice package.","rating":5},{"id":"R2KPNXIIVNI17J","title":"I had been considering this phone for a while as I like physical keyboards","text":"OK.  I had been considering this phone for a while as I like physical keyboards.  When my phone died I got this.  I did buy it from Amazon open box deals at a fairly good price, crossing my fingers that it won't be scratched and works properly.  I was happy to say it looked new.  Fab!  A bargain for once.  However, it was not pairing with my samsung gear s2.  And it was not charging on the charging pad.  Why?  Because, on the box it says made for Canada.  The listing said has a US warranty.  Nowhere did it say a canadian phone. I knew that the canadian versions are unable to charge on charge pads so would not have bought if I knew.  Is this why it would not connect to my s2?Anyway, as usual, thank goodness I purchased from Amazon whom refunded me.It is a lovely phone.  It is heavy.  And what a luxury to have physical keyboard.","rating":4},{"id":"R125FTCPNENRYT","title":"Loved it!","text":"I purchased this product and LOVED it! The seller said it had minor scratches but I HONESTLY reviewed the cellphone carefully once it arrived because YES I was that excited...lol! And barely could see any. I was so happy. It was worth the price! It even came as if I had purchased it from Blackberry itself, I was impressed and VERY HAPPY. I only noticed a month later that when I scroll down in the APPs page that it's slightly glitches. Either way, It's a 5.","rating":5},{"id":"R3H7E9MTEP71A3","title":"Awesome big and easy","text":"Love it it is big it is easier for me text sense I have problems with texting with smaller  phone with my hand finger issues.","rating":5},{"id":"RP0TG1B5RMCF1","title":"Blackberry Priv: Blackberry with Android","text":"I don't like how the battery doesn't last very long and needs to be recharged frequently.I like that I can get Android Google playstore apps and they work well on this phone.","rating":4},{"id":"R1B4RPQX4ZRBVV","title":"Great Phone","text":"I hated the android OS until I tried the BlackBerry Priv. This phone provided me with all I needed for my daily life and move.","rating":5},{"id":"R3TVNS3F01BSX6","title":"Spectacular Return for BlackBerry smartphones","text":"Absolutely worth every penny! Cutting edge technology and extremely attractive design! Also be sure to get involved with the BETA program! Come on guys don't delay get your own today!","rating":5},{"id":"R13TA10U0D85EZ","title":"Good phone","text":"Good. Worked in UK, but had to reset when I brought it back to US. Using it on T Mobile, so can't use installed ATT apps.","rating":5},{"id":"R1C5IZ69OT5O4C","title":"Great phone! All the Blackberry perks","text":"Great phone! All the Blackberry perks, including reliable email service and a physical keyboard, plus Android for access to every app.This is a fantastic phone!","rating":5},{"id":"RI8V5S41B8OOF","title":"this phone won't disappoint. It's admittedly my first forray into Android","text":"If a QWERTY keyboard is a must have, this phone won't disappoint. It's admittedly my first forray into Android, so my comparative analysis is going to be naturally lacking. It doesn't make up for problems that are inherent to most other Android manufacturers, but each company has it's strengths and weaknesses. Some of the BlackBerry proprietary apps are nice (Dtek, Hub), others, not so much.At the end of the day though, you're buying hardware, not software. Devices are getting harder and harder to root as OS security improves, so blackberry's resistance to allowing root on the Priv is less relevant than it may have been in the past.It certainly gets hot (105F, 30ishC), but I've read that to be a common issue with the Android OS generally, and snapdragon processors specifically.Really, it's a qwerty phone with good hardware, and it runs Android. Keyboards are a must for me, so this is my phone. Were I not so stuck on physical keyboards, a Nexus or Motorola might have been my choice.Keep it up BB, I'm rootin' for you.","rating":4},{"id":"R129ZECL9ANAG1","title":"lovely phone","text":"very lovely phone....the seller kept to his words and sent exactly what i wanted...honestly the blackberry priv is the best thing to ever happen to the Android os..its so organized and basically combines the best of the blackberry 10 os with the best from Android","rating":5},{"id":"R21YCEEZ3I6DLZ","title":"Back to being a BB fan!","text":"Love the phone... joining with Android OS it has surpassed all expectations.  I still use BBM with my international customers so it allows me to have the best of both worlds.  I have given my iPhone to the kids.Only real negatives are as already discussed elsewhere... the camera facing you is lacking, but the 18 Meg forward facing is great.  And does require letting the battery build memory.","rating":5},{"id":"R2ST1GWJS6J6O2","title":"LATEST AND BEST REVIEW READ!","text":"PLEASE TAKE YOUR TIME AND READ!!! This product is the BEAST one of the best smartphone out there Blackberry don't pay for advertising!!!  I Recommend to buy it ! BUT NOT this one !!!! Why ?? Because it's AT&T unlocked ! But still a AT&T carriers PHONE !! So you will be stuck with the OLD version of Android 5.1.1 .... Stilllllll waiting for the Marshmallow UPDATE!!!  This is 101% annoying!!","rating":3},{"id":"R2YXP9RQQCI3V","title":"Priv is beauty","text":"It is a bit slow as compared to other androids. But I bought it becaue of its beauty... I'm in love with its shapeP.S unlocked AT n T phones are lagging marshmallow update, dnt know how much time they will take , rest of all the privs have been updated","rating":4},{"id":"R3VQBEEOEQHXTI","title":"Great smartphone for former BB users","text":"Exellant smartphone, BB hub works well as expected, however the keys on the physical keyboard are a bit small compared with my old BB Torch.  I have aso had problems opening documents in dropbox.But generally I'm satisfied.","rating":4},{"id":"R2RUGN85GHN8TW","title":"The best phone out there with the worst defect","text":"I wanted to buy a phone with keyboard and BB classic was too low spec for me so I really had no other option but to buy this phone.Looks wise, its one of the best out there, deserves full 5 stars, build quality is good too. Specs are decent, even at its launch price and has all the features needed except a finger print scanner.The camera is ok, not very bad but not the bests either. Maybe I don't like the camera too much because I have always used Nokias before, and their cameras impossible to match. However, this slight shortcoming is more than made up by the beautiful and bright touchscreen.I wanted to give it 5 stars, if only because of its keyboard and the way it feels when you hold it. But that's where you run into a big problem; it overheats like an oven. and I am taking two stars off because of that.I bought it in Houston, Texas, but I live on the other side of the world so there's no way to exchange it, and I use the cover I bought with it to prevent my fingers getting burned.","rating":3},{"id":"R3TVNS3F01BSX6","title":"Spectacular Return for BlackBerry smartphones","text":"Absolutely worth every penny! Cutting edge technology and extremely attractive design! Also be sure to get involved with the BETA program! Come on guys don't delay get your own today!","rating":5},{"id":"RP0TG1B5RMCF1","title":"Blackberry Priv: Blackberry with Android","text":"I don't like how the battery doesn't last very long and needs to be recharged frequently.I like that I can get Android Google playstore apps and they work well on this phone.","rating":4},{"id":"R26Y0TQSGKAHIF","title":"Just buy it!","text":"PRIV is a very good phone. I always wanted it because of the HUB and the keyboard. Now using it more and more, I don't even use the keyboard anymore. Definitely buy it>>","rating":4},{"id":"R1C5IZ69OT5O4C","title":"Great phone! All the Blackberry perks","text":"Great phone! All the Blackberry perks, including reliable email service and a physical keyboard, plus Android for access to every app.This is a fantastic phone!","rating":5},{"id":"R1B4RPQX4ZRBVV","title":"Great Phone","text":"I hated the android OS until I tried the BlackBerry Priv. This phone provided me with all I needed for my daily life and move.","rating":5},{"id":"RSPCNMHQTRJKA","title":"BlackBerry Priv -Android and very safe phone.","text":"The best and safe smartphone, with android, so far.","rating":5},{"id":"R1WM2SYDA8V11Y","title":"Really nice blackberry phone","text":"Love the phone... The keyboard is great, good camera, good integration with personal and work mail. Excellent battery life!","rating":5},{"id":"R35RUDASOLNQ5Y","title":"Phone Screen went black for no reason","text":"My Phone's screen went black right after 2 months for no reason. Did not fall, Nothing happened but all of a sudden the screen went black and is still the same.","rating":1},{"id":"R3ICBZSTRZBEP7","title":"Physical keyboard is a dream come true","text":"I was unfortunate enough to receive the orange box version but it did contain instructions for unlocking it. However my Straight Talk Sim card works with it without needing to unlock it. For now I will leave the review at 3 stars until I get a better feel for the phone. The biggest problem I have so far with the phone is the fact that it doesn't say anywhere in the description which size Sim card it takes leaving me to have to buy a Sim card cutter. Also not getting  a choice between AT&T orange box and unlocked black box version is annoying. I used the phone's slide out keyboard to write this review and it's great, best feature the phone has to offer.Update 07/16/16I just updated the phone to Marshmallow, which was one of the things I was worried that I wouldn't be able to do since I received the orange box version.Update 07/21/16I've had the phone for over a week now and I've upped the rating to four stars. The physical keyboard really is a dream come true. The battery life isn't terrible but it also isn't great, with android 6.0 I have definitely seen an improvement in battery life.","rating":4},{"id":"R1KKO36QG051BE","title":"Works great have no issues","text":"just what I needed.....Works great have no issues....","rating":5},{"id":"R2X1WL9E63UTI","title":"Works great for T-mobile","text":"Arrived quickly and works perfectly with T-mobile SIM card.","rating":5},{"id":"R2IRH32LQQ38UN","title":"Five Stars","text":"Great product.  Everything as expected","rating":5},{"id":"R4QYLG1F8MLY4","title":"Good Blackberry effort","text":"This is a really good smartphone by Blackberry. Was a fan of BBOS10 and they really made the transition to Android good.","rating":5},{"id":"R27WFPMG7GUU4Y","title":"The Best Phone I've had yet.","text":"Great phone. Great battery life, great screen, great external speaker, fast shipping by Amazon.","rating":5},{"id":"RHBZMD0C11JNN","title":"Beware - NOT TRULY UNLOCKED","text":"Great phone - 5 stars!It is not unlocked!Yes, you will be able to insert a SIM card for other carrier and use it.No, you WILL NOT receive any system updates for AT&T branded phones!There is a lot of work on system going on now, and receiving updates is very important.Best buy an unlocked phone from Blackberry site.","rating":3},{"id":"RR6RDTKEXB7BQ","title":"Supreme feelings due to its elegance and style","text":"I am an IOS user. I used to be a blackberry user 5 years back. The last phone i used was Blackberry bold 9900. Since than i am using apple. Now after 4 years i have put my hands back on Blackberry just because of its stylish, elegant looking phone with android in it. I bought it after hearing news about it. I never expected to to have such a huge leap as compared to other Phones in the market.Seriously guys as soon as I had the first touch on the Phone i felt so much superior and embraced due to its elegance and style. above all it has a millions of functions with such a high level of security privileges as if you are a president or an agent. the only issue is that it over heats sometime but this over heating has nothing to do with its speeds. Instead I use it as heater for these winters. lolz..Overall I can bet on it that it would be declared as the best phone in design and software for the upcoming year 2016.","rating":5},{"id":"RDIZKLV9UNM8K","title":"Basically new. Quick charge not as fast as S7.","text":"Bought like new from Amazon Warehouse and it's basically new. Described accurately, coming with a damaged original packaging but contents were still excellent, save for the creased paperwork.Phone is big. I have a Galaxy S7 and oh man. Came factory unlocked, not from a carrier, like some reviews stated. Phone gets warm just from charging, which takes a while even with quick charge. It's got a bigger battery than my S7 but my Galaxy charges way faster. S7 is still the better phone. I used to have keyboard phones so I couldn't resist the reduced price of the Priv.Keyboard not as high quality getting compared to vintage BlackBerry devices. It's cramped but I have small hands so not bad in my case. No spacious individual keys like the Droid 4 or Xperia Mini Pro. However, you have gestures, like scrolling and deleting words. You can also double tap the keyboard to switch to a text cursor scrolling model.Be sure update to the latest Marshmallow softwares. The PRIV may get Nougat in the future but nothing confirmed. If so, that'll be the last version of Android the phone may receive.","rating":4},{"id":"R3FBX0LD6NAZU3","title":"Finally, a new phone I actually like!","text":"Bought this because I hate being without QWERTY. Owned both the classic and the passport, although not for long. Loved the keyboards but I hated how I couldn't use my favorite apps (like snapchat and my credit card app) on those phones. Because those phones had such a sad user experience for me, a waited a while to buy the PRIV. I really wish I didn't wait so long. This phone is great. It does everything I want it to do. No more frusterated typing on touch screens anymore. I can just flip the keyboard out. Both cameras are great. It runs apps perfectly.I can type notes up quickly and accurately.I don't have to slide my greasy fingers across the screen when reading articles, because I can slide them around the keyboard/trackpad instead. It's even got a little swipeable \"edge\" tab at the one side. The only improvements I could suggest are that I wish it had a better battery life , and I wish I could switch though songs by holding the volume buttons.Either way, this is a new phone I actually like. I hated settling with phones that are nothing but screen .  I hate those phones so much they all look the same and they're so ugly. So boring and I hate waiting for the keyboards to come up just for them to take up half the screen. Not to mention typing in the cold or with long nails or without looking at those phones is a freaking nightmare. This phone is the best.","rating":5},{"id":"R1Z8POJSTKB3T4","title":"... I've had this phone for a month and I love it! I have got to say that I ...","text":"So far I've had this phone for a month and I love it! I have got to say that I was a little skeptical about whether or not I would like this phone. Afterall, BlackBerry? Haven't they been a dead company for a while now?Anyhow, some pro's and con's of the phone.Pro:- Great battery life: I get a predicted 25 hours of battery life out of this phone. It gets me through a whole workday with moderate use. This includes snapchat, reddit as well as hammering out those emails.- Physical Keyboard: I have to admit, going from a touch screen to physical keyboard was a hard thing to get used to, however, once I got the hang of it I was typing out emails much faster with fewer mistakes than a touch screen. Further, the keyboard is capacitive, allowing you to scroll through websites without using up valuable screen space for flicking.-18 MP rear facing camera: This is starting to become more and more of a standard feature across most android smartphones, but it is nice that Blackberry included this- Rock Solid build: I'm not the most careful with my phone as I have dropped it onto tile flooring multiple times (i.e fell out of my pocket, off the bed, etc etc) from heights of 4 feet. I was surprised that my screen hasn't cracked yet. This was before installing a glass screen protector.-Android app availability: Literally the largest amount of app selection compared to other operating systemsCons:- Back creaks a little bit, might be due to the space required to have the slide out keyboard- 2MP front facing camera for selfies. Although, I don't utilize this very much, it may be a deal breaker for some. I suspect like other reviewers that there simply wasn't enough space to put a bigger camera.- Keyboard travel is a little shallow. Doesn't have that button press feel as earlier Blackberry Bolds. Still nice to have a keyboard though.","rating":5},{"id":"RIQ8FVC0IZPMR","title":"Love it","text":"I love it. I could write a 1000 words assay on this phone, suffice to say that it is a superb unit, seriously well built, first class materials and runs Android fast and smoothly. The change over from my former BB, a great Z10 which I was very sad to part with, went very smooth. All my accounts, contacts, apps and media files transferred without a glitch at first try.The phone is nothing short of awesome for me. The physical keyboard took a few days to get used to but now I am able to use it automatically. Display is impressive and the quality of photos taken very casually without trying to extract the maximum from the cameras are to me top class. I am glad I waited a year, to pick up this phone at very reduced cost than originally sold. In my opinion the first release price was very steep, even though it is a top quality phone. Now the price is right and this phone is still at the time of this writing early 2017 the right level.","rating":5},{"id":"R2DBVB4OFHTZ9Z","title":"Buy it asap!","text":"Love my Priv! You will not be disappointed!","rating":5},{"id":"R2X5PS7BGDP3VB","title":"Exceeded Expectations by Far","text":"BlackBerry Hub system is still best way to organize incoming messages of all types. Keyboard is great and as a longtime BB user I find it indispensable for multiple paragraph correspondence. In fact it's better than most tablets. Now with access to Android and Google it is a great phone. I brought it to the ATT store where tech got it going in ten minutes. Only problem has been low phone volume, but that is better after Marshmallow update, which was easily done. So, I got it for Android and keyboard, but it exceeds my expectations in many other ways.","rating":5},{"id":"R336K479I8WX2K","title":"just love it. and this phone beats any iphone or ...","text":"I am a life long user of bberry. just love it. and this phone beats any iphone or droid phone out there, without trying too hard. bought the protective case and was pleased to see that it resisted a very tough fall on concrete. cannot recommend it enough","rating":5},{"id":"R26AAVMIJPEB8S","title":"Husband loves it!","text":"Got it for my husband, a die-hard blackberry fan. He enjoys the access to android apps while maintaining all the blackberry features. The display is large and HD. Nice looking phone overall! He's had it for over 10 months now and working flawlessly. No complaints.","rating":5},{"id":"R31A0WMTF9W4LM","title":"If you prefer Android, you should seriously consider this phone for what BlackBerry adds to it, including more security.","text":"So far it has been a great experience with this phone. I am customizing my Android experience nicely and really not missing my BB10 which I thought I would. BB10 is a great OS which world doesn't know about. A big error by BlackBerry, but it seems the latest OS from Android has covering some ground.I think a big plus for this phone is the additions of the BlackBerry integration. I think it really enhances the Android experience and not to mention make it more secure. Plus, the physical keypad. Nice.If you prefer Android, you should seriously consider this phone for what BlackBerry adds to it, including more security in a really nice package.","rating":5},{"id":"R365TOAVE47FTM","title":"One Star","text":"From BAF Distributors I ordered two of these phones. Both came AT&T branded and LOCKED. Be aware!!!","rating":1}]