[{"id":"RHNM1RWBP43R2","title":"The cable was not original The screen was not the original The battery was not the original Some pieces like a litter metal plat","text":"I pay for a NEW iphone 6, and the cellphone it is not only refurnished, but badly refurnished:The cable was not originalThe screen was not the originalThe battery was not the originalSome pieces like a litter metal plate and some screws were missedThe Apple guarantee is expired because the phone was activated ONE YEAR AGO, that’s why they send you a paper warning you not to go to Apple store because the “guarantee” is with them.Obviously, the screen is damaged and I cannot return the device because I am not in USA. Who protects the foreign costumer?","rating":1},{"id":"R1BIB1CZQXDVM","title":"Satisfied!","text":"Bought an this iPhone because I needed a new phone. It came in and was satisfied! Bought it from Supreme Deals 18. They are authentic and would def buy from them again","rating":5},{"id":"R1RGA12L91S8FF","title":"Beware of h2o","text":"Be careful who u order this phone from h2o, suppliers are China n have sound restrictions on there phones, cant turn off or mute shutter for camera.","rating":1},{"id":"RLTTNFZ0W0E6G","title":"Got it for a great price and everything works great","text":"I bought this phone for my daughter and she absolutely loves it! Got it for a great price and everything works great! The only thing is that she has trouble connecting to our home wifi when she is back in her room. The rest of our family do not have i phones and we do not have any problems connecting to wifi when back in her room. Not sure if this is an issue with the particular phone or i phones in general. Overall though she loves it!","rating":5},{"id":"R2MHWVDWSL0IWR","title":"Bad Quality iPhone 6 Sold","text":"Bought this phone from this seller.After 30 days having the following problems1 - After fully charging battery would not last for more than an hour and a half2 - Gets heated up a lot while charging3 - Produces random vibrations while using the phone4 - While talking on the phone randomly turns on speakerIt looks like they make sure the device works for 30 days and if there are issues after 30 ays, the buyer doesn't have any choice other than getting stuck with the deviceOverall Disappointed","rating":1},{"id":"R3EYW3RRPZK2UV","title":"Received Fake iPhone.","text":"Be warned! The product that I received was fake. The product was marked \"new\" but everything was dirty.  Product boxing does not match Apple fonts/colors. Everything feels cheap. The phone's body feels like plastic.  Easily scratched it with my thumb nail. Earphone plastic case has scuff marks all over.  It's a fake product. Searching for the serial number using checkcoverage.apple it comes up as an iPhone 5.","rating":1},{"id":"R11MVW220G0DJ6","title":"The phone does not work - it was sold as ...","text":"The phone does not work - it was sold as new but when I had it looked into it was serviced by unauthorized apple dealer and the phone would freeze. I send it over to my mom and once she told me it was too late to return. This is a fraud do not buy!!!!!!!","rating":1},{"id":"RRVSWE29D6V6H","title":"DO NOT TRUST","text":"totally untrustable company, my iphone was not new and the speaker isnt working correctly i cannot listen to music alarms or phone calls if im not wearing earbuds or headphones... never refunded because didnt have the time to do so because of work!","rating":1},{"id":"R29VJ7F7NL2RQQ","title":"Great Phone, in need of some improvements.","text":"The iPhone 6 is a great phone for your average consumer. It's fast, it's very attractive, and it's easy to use. Although Apple is still behind, it still has the same retina screen quality if has had for years, which in this smartphone age is way behind. The base storage of 16GB is almost a rip off, giving you about only 12GB to actually use. Also, I think Apple should have made the normal 6 models have a 5.0 inch screen, the 4.7 is a tad bit too small.","rating":4},{"id":"R2IOGSVXKDO6XN","title":"phone is good, but I was upset that I can not ...","text":"phone is good, but I was upset that I can not turn off the sound when doing photos. likely this phone was made for Japan, as in Japan, the law - you can only take pictures with sound.","rating":3},{"id":"R2QCORVO7O4MD4","title":"Five Stars","text":"Excelente","rating":5},{"id":"R315WAOBGDR252","title":"Five Stars","text":"Fast shipping and excelent phone","rating":5},{"id":"R1QUCTDI19K3JI","title":"Five Stars","text":"I bought it sold by TechnoMaster  and Fulfilled by Amazon .it is Unlocked GSM Cell Phone.","rating":5},{"id":"RVF6SPFAPSRWD","title":"so it was a waste of my hard earned money","text":"The phone didn't work for boots mobile per paid , so it was a waste of  my hard earned money !!! Thanks for nothing","rating":1},{"id":"RK3ZCBLFBDPGW","title":"Good buy","text":"Good Condition! Works very well!!! Thanks.","rating":5},{"id":"R139NZW4TSLSWG","title":"Great Quality!","text":"Fully functional and no wear! Looked New!","rating":5},{"id":"R3LOVMUPYSLOF7","title":"but they were great about giving me a refund","text":"unfortunately the phone was defective, but they were great about giving me a refund.","rating":1},{"id":"R2HT8E4A329YEO","title":"Five Stars","text":"EXCELLENT","rating":5},{"id":"R3EETVPEBVTBC","title":"You can not go wrong with Apple","text":"This phone worked really well in Venezuela.","rating":5},{"id":"R3UZFKEI55UD8E","title":"Five Stars","text":"Satisfied with purchase came in Time and better then expected.very good customer service","rating":5},{"id":"RUL787X9J1UE6","title":"The Best iPhone Ever!!","text":"I am in love with my iPhone 6! i have been waiting to get one for the longest time ever. A great upgrade from a 5 to a 6! It is in perfect condition, a few scratches, but nothing major! Very Costly $400 but very cheap! It has not given me one problem at all ever since i got it yesterday! Thank you Cyberdime for the iPhone! Your Company Rocks!!","rating":5},{"id":"R3EQUY2C0OTJHR","title":"It is so beautiful and perfect","text":"Finally got my phone, It is so beautiful and perfect, Love it so so much! The package was delivered very fast and Amazon gave me a very good costumer service after the problem i had with the shipping, they solve my problem, I'm very pleased!","rating":5},{"id":"R2PER98TIEP5GW","title":"... am Venezuelan and everything arrived on time and in perfect condition.","text":"I am Venezuelan and everything arrived on time and in perfect condition ... And with a bit of use and everything works perfectly, I am satisfied with the purchase buy another alike","rating":5},{"id":"R2Z38CUNZK48F5","title":"Excelent phone i bought as gift for my sister and ...","text":"Excelent phone i bought as gift for my sister and she loves it. Im from Venezuela and the siller is excelent work perfectly for Movistar and is unlocked highly recomend it","rating":5},{"id":"R3538ZESEH54S5","title":"This is not authorized phone","text":"I got this product and found it is warranty is not expiredAnd the official apple web site showed me a different phone with different color when I checked with the device serial number","rating":1},{"id":"R24HTL2GUO41LR","title":"Good Phone; Didn't Work for Me; But Vendor Good About Return","text":"Liked iPhone 6, wasn't able to get service on it from my provider, but vendor was decent to work with and made it easy to return.","rating":3},{"id":"RESOW6AK15JPI","title":"Everything was great. Real like new product","text":"Everything was great. Real like new product!. Only thing was lightning cable which sometimes get me into trouble. I think that cable and charger was not originals. Besides that, everything was great","rating":5},{"id":"R3C4J40589JC2L","title":"Got what I was told","text":"This is the first phone that I purchased that isn't in a contract and the description was right on point. The price was right, the company shipped quick and according to other reviews their service is good. Hopefully I won't need that but so far so good!!","rating":4},{"id":"R2M1CWZO9CQ9SH","title":"unbelievable, came with a charger from Europe or somewhere ...","text":"unbelievable, came with a charger from Europe or somewhere where the outlets are different then here in canada, and the shutter sound to the camera will never Shut off, they option to shut it off is taken out, for privacy reasons in another country, but here in canada we're allowed to have it off! and i want it F'ing off! i can't take any photo's without someone looking at me because it makes the snap noise, i got Scammed!!!!","rating":1},{"id":"R1VX89N66EU2X5","title":"iPhone 6","text":"I am very please with my order and the condition of it. It came exactly as stated and they communicated with me everyday and answered in a minute. I recommend that you buy from them , you will not be disappointed.","rating":5},{"id":"R20JF9JZINXO9Z","title":"Amazing!","text":"Phone came in brand new factory sealed and everything. Works Perfectly. If you're wondering if you should upgrade from your 5s, I would highly recommend doing so.","rating":5},{"id":"RZECCC4JSQ6AE","title":"Great phone, with moderate battery life, and great usability.","text":"Apple UI is hard to beat as far as ease of use, and simplicity. The phone does everything I'd like it to. Battery life is not the greatest. Screen size was something of a worry for me, since I thought that the iPhone 5/5s screen size was perfect for me. I got used to it real quick, and now it doesn't bother me at all.","rating":4},{"id":"R2QJRBQTEI5WJX","title":"Excellent Phone!","text":"The phone is incredibly fast, the photos are very clear even with flash and it is very thin and light. I have nothing negative to say about this item. Would highly recommend.","rating":5},{"id":"RHEBFZNSMORI8","title":"These people strip all the apple parts out of there ...","text":"These people strip all the apple parts out of there phone and replace them with cheap parts. DO NOT ORDER FROM TOOK PHONE TO APPLE AND COULDN'T BELIEVE WHAT THEY SEEN WHEN THEY OPENED THE PHONE UP","rating":1},{"id":"R1BW02HVOL4SP9","title":"Broke after 3 months","text":"Apple iPhone 6 16GB Factory Unlocked GSM 4G LTE Internal Smartphone - Space GrayI have only been using this phone since November 1st. It has worked great until today. The screen instantly turned off and the phone would not react to a charging cable connected to the wall or computer. I've been told the logicboard has malfunctioned, and that specific piece makes up the bulk of the price of the phone. I am disappointed. It is only three months later, but I am back to square one.","rating":1},{"id":"R2BAL0GM79F580","title":"Not working phone","text":"The phone is not working, not even opened.","rating":1},{"id":"RU7CPEJ76PCWY","title":"One Star","text":"dont work","rating":1},{"id":"R2RT642MO9SW6N","title":"FRAUDULENT MISREPRESENTATION OF THE CONDITION!","text":"FRAUDULENT MISREPRESENTATION OF THE CONDITION!  My phone was not new as stated on Amazon.  After having touch screen problems a few month into the purchase apple would not support the 1 year warranty do the fact that it had gone through 571 charging cycles.","rating":1},{"id":"RWH3JOGIIQ9D0","title":"Duplicate/Used phone...Fake body","text":"We took this to Apple after we found battery gets drained in 3-4 hours and Apple told us this phone is out of warranty and someone used this phone for more than 1 year so battery is completely gone and phone body was also not original. Do not buy this phone from SLS deals Inc.","rating":1},{"id":"RRVJWYAH81FIZ","title":"Exactly what you're looking for!","text":"At first I was very hesitant to buy this iPhone.My reasons are because of the price and that it is online and you never know who you are actually buying an item from or even if it's the right item.My iPhone 6 (space gray) arrived two days ago and I can't be happier. This phone is amazing and I got exactly what I paid for! You won't regret it!","rating":5},{"id":"R2J8YJAE6ZU2JS","title":"Buyer beware!!!!","text":"Horrible!!! Camera snap sound will not turn off because this phone is from Japan where law prevents sound from being turned off. DO NOT BUY FROM AMAZON!!!!","rating":1},{"id":"R1TPYEO06Y0O6F","title":"NOT A GENUINE APPLE PRODUCT!","text":"There is no way this is a genuine apple product. It freezes all the time, GPS does not function, and it will shut down randomly while sitting untouched on the table. Absolute JUNK and is getting returned today. I hope they do not loose it as they did with other products I have returned!","rating":1},{"id":"RX7D6C4TZT51R","title":"works great.","text":"Connected with a straight talk nano SIM card and work fast. Easy to configure.","rating":5},{"id":"R3NOVYG6IX5KQX","title":"Order from WBB LLC and receive a DEFECTIVE device!!","text":"Phone arrived with PASSCODE locked. I've tried EVERY SINGLE METHOD to reset the password. Tried connecting to itunes while holding home button, I've tried holding home and wake/sleep button while connected to itunes (as Apple suggested). Nothing worked. Ordered this phone from WBB LLC on Dec1, arrived Dec13 and was defective. Had to return the phone, what a POS. Do yourself a favor and buy elsewhere. These guys are a JOKE!","rating":1},{"id":"RQ8UCV4KG3V7F","title":"Not unlocked.","text":"I bought it and the quality is fine, but I can't activate it. It says it's unlocked but it won't allow me to activate it. The window to return it has passed. I've purchased unlocked phones and never had this issue before. Now I have an expensive phone I can't use.","rating":1},{"id":"R2QJ1A0LORRVYW","title":"It is not an Iphone, it is a copy.","text":"Be carefull about Thannksgiving.The battery goes down from 60% to 1% en 10 seconds.The cell phone was checked by Apple Store, and they realized that this Iphone has not orignal components.  The battery reports moren than 500 charges.The display in not original.It is not an Iphone, It is a copy.","rating":1},{"id":"R3EYW3RRPZK2UV","title":"Received Fake iPhone.","text":"Be warned! The product that I received was fake. The product was marked \"new\" but everything was dirty.  Product boxing does not match Apple fonts/colors. Everything feels cheap. The phone's body feels like plastic.  Easily scratched it with my thumb nail. Earphone plastic case has scuff marks all over.  It's a fake product. Searching for the serial number using checkcoverage.apple it comes up as an iPhone 5.","rating":1},{"id":"R3C84O46IYXFAE","title":"Shocked","text":"I bought a brand new IPhone 6, but the seller shipped me an uncertified refurbished one. The screen was replaced by a copy. A technician in an authorized maintenance center told me after some colorful lines began to appear in the screen. Be careful of \"Prime On Digital\". Feeling bitterness to be blackmailed.","rating":1},{"id":"R3I64F8WL6OHTP","title":"i feel conned","text":"i bought this phone on feb 2017 it worked fine for 3 weeks after it started to show up problems  with the battery and charging system , it happened twice so i took it to an authorized service center and they told me that the phone was sold by VERIZON in 2015 so the warranty is no longer valid, when i bought the phone on AMAZON it did not say it was refurbished or sold before to another customer ( i thought it was brand new ) at the authorized service they told me thta the LOGIC CARD can not be fixed , so the phone is not working properly , cant be fixed and it can not be sold again","rating":1},{"id":"R4LYNWNVPHCT1","title":"Product states unlocked - no service on phone with AT&T ...","text":"Product states unlocked - no service on phone with AT&T.Took phone to AT&T twice and spoke with AT&T tech support.Nothing would make phone get service. Assuming this phone is not unlocked.","rating":2},{"id":"R130BKNX0IW1ED","title":"Shipping International Version When Bought US","text":"Shipped international version of the phone without mentioning it. I bought the US version but it turned out to be an international version and we could not turn off the volume of the photo shutter","rating":1},{"id":"R19LTU6K0G2XI5","title":"This phone is phony! It is not an APPLE ...","text":"This phone is phony!  It is not an APPLE product.  I bought two and they were both fake Iphones.  Beware!","rating":1},{"id":"R26H0DRUAYREW2","title":"Beware of refurbs unless you are buying them from Apple","text":"Battery only stayed charged for less than 30 mins, then dies, beware of refurbs unless you are buying them from Directly from Apple, we ended up buying a new iPhone in the end, much better decision especially since my wife had been without her iPhone for close to 2 weeks.","rating":2},{"id":"RWH3JOGIIQ9D0","title":"Duplicate/Used phone...Fake body","text":"We took this to Apple after we found battery gets drained in 3-4 hours and Apple told us this phone is out of warranty and someone used this phone for more than 1 year so battery is completely gone and phone body was also not original. Do not buy this phone from SLS deals Inc.","rating":1},{"id":"R2DAJNKV395ZU8","title":"I'm really disappointed about this item","text":"I'm really disappointed about this item. It's not working on my phone company and that make me waste time waiting for my refund to buy a different phone.","rating":1},{"id":"RDUKWSII7B077","title":"a terrible accident happened even before I had decided what carrier ...","text":"It arrived on time and I immediately charged the battery.  The language was in Chinese!  After a call to Apple I was able to get English.  However, a terrible accident happened even before I had decided what carrier to use.  It must have slipped off my desk and fallen in the trash.  I searched everywhere for it but to no avail.  I had not taken it from the room.  And that is the sad story of my iPhone!  Since I will be 89 years old in a few months, it was a major decision for me to get an iPhone.  It has not even been paid for yet.  Marie Sutter,  suttersinden15@gmail.com","rating":1},{"id":"R3L5PBBJ8EXOAJ","title":"Frozen","text":"Was in good physical shape but electronically messed up.  Froze up all the time had to reboot it all the time to get it to work.  Then it just had a huge delay in action I could touch screen 8 times and nothing 5 min later phone would start acting on my touch and seem to be alive operating all by itself!","rating":2},{"id":"R2QJRBQTEI5WJX","title":"Excellent Phone!","text":"The phone is incredibly fast, the photos are very clear even with flash and it is very thin and light. I have nothing negative to say about this item. Would highly recommend.","rating":5},{"id":"R2B2PTJBUMUUFA","title":"Marcelo A. Rivera Silva","text":"Dear,The equipment arrived on March 25, but the Iphone did not come as a new equipment, since it was programmed, ie it was configured.I do not know if that's right, but I do not think a new team comes in that terms.I hope to have some satisfactory news from you.Greetings and thanks.","rating":2},{"id":"RHEBFZNSMORI8","title":"These people strip all the apple parts out of there ...","text":"These people strip all the apple parts out of there phone and replace them with cheap parts. DO NOT ORDER FROM TOOK PHONE TO APPLE AND COULDN'T BELIEVE WHAT THEY SEEN WHEN THEY OPENED THE PHONE UP","rating":1},{"id":"R1HQXSJPH5X6BW","title":"DO NOT BUY!","text":"I bought this device used from this seller and --excuse my language-- it is a complete piece of s***!  It doesn't connect to the internet whatsoever, neither wi-fi nor cellular data work on this phone.  Also, when I tried to do a hard restart in an attempt to fix this issue, the screen goes greeen, blue, purple, and red, instead of straight to black and then showing the Apple logo.  I also tried completely resetting the device but I needed to turn off Find My iPhone first -- you can't turn off Find My iPhone without an Internet connection so I had to manually remove the device from my iCloud device library and I still wasn't able to reset it.  As a last resort, I put the device into, what's called, \"recovery mode\", bypassing EVERYTHING and force-reset the device.  After putting the iPhone into recovery mode and force-resetting it, it worked fine... for a few hours.  I went to sleep that night and when I woke up it was back to its dysfunctional ways.  I decided to reset it again, following the recovery mode method, and it worked good for a few days.  It now is, once again, back to its dysfunctional ways, this is why I am writing this review now.  DO NOT BUY ANYTHING FROM THIS SELLER, they were clearly selling it because there is something wrong with it, they're obviously not a good person, why would you want to buy anything from them, electronic or not?","rating":1},{"id":"R4RYOVZJK8327","title":"Great product and A plus shipping.","text":"A plus shipping. The product really is good. I did have to reset it sonI could log in as my own account. Other than that, so far so good.","rating":5},{"id":"R1NP0KXR80O54Y","title":"... phone for about a month now and it works fine with my gsm carrier","text":"I've had the phone for about a month now and it works fine with my gsm carrier. It did have a few scratches on the screen as it said it had. I just wish the packaging was a bit safer because it looked like it wasn't when it arrived.","rating":4},{"id":"RLTTNFZ0W0E6G","title":"Got it for a great price and everything works great","text":"I bought this phone for my daughter and she absolutely loves it! Got it for a great price and everything works great! The only thing is that she has trouble connecting to our home wifi when she is back in her room. The rest of our family do not have i phones and we do not have any problems connecting to wifi when back in her room. Not sure if this is an issue with the particular phone or i phones in general. Overall though she loves it!","rating":5},{"id":"RW78B0ICT8J3Q","title":"This phone is a fake. It felt heavier that ...","text":"This phone is a fake. It felt heavier that an usual iphone, the side was kind of opened and the screen damaged.","rating":1},{"id":"RYUXTRT3FAMU8","title":"Internal parts break..","text":"Scam... don't buy this phone, breaks within 30 days, phones internal antenna breaks, always searching for signal.","rating":1},{"id":"R19LTU6K0G2XI5","title":"This phone is phony! It is not an APPLE ...","text":"This phone is phony!  It is not an APPLE product.  I bought two and they were both fake Iphones.  Beware!","rating":1},{"id":"R113AN8KS7ZSY3","title":"Absolutely got cheated!!!! The phone had ...","text":"Absolutely got cheated!!!! The phone had some issues with the camera so I took it to the Apple store. They told me that the phone was out of warranty because it was activated back in September 2015. They sold me a phone that was activated once and sold it to me as a brand new phone.","rating":1},{"id":"R1LTGJI9HDMGMX","title":"Seems like iphone with all accecories which is not working","text":"never buy it, it is a big scam...please...Charging port of Iphone is damaged...we cannot charge at all...Seems like iphone with all accecories which is not working....","rating":1},{"id":"R29VJ7F7NL2RQQ","title":"Great Phone, in need of some improvements.","text":"The iPhone 6 is a great phone for your average consumer. It's fast, it's very attractive, and it's easy to use. Although Apple is still behind, it still has the same retina screen quality if has had for years, which in this smartphone age is way behind. The base storage of 16GB is almost a rip off, giving you about only 12GB to actually use. Also, I think Apple should have made the normal 6 models have a 5.0 inch screen, the 4.7 is a tad bit too small.","rating":4},{"id":"R2PPAHIF8ZL69L","title":"Not unlocked and doesn't work on T-Mobile!!!","text":"Buyer beware.  The phone that was shipped to me isn't unlocked and won't work on T-Mobile's network.  So frustrated!!!!","rating":1},{"id":"R2SKL8SHS7FY2B","title":"Five Stars","text":"i have not had the opportunity to learn all the features yet, but so far i'm loving it.","rating":5},{"id":"R2YMGFR0XLYB8Y","title":"Great experience","text":"It was a wonderful experience from quick shipment to delivery. Item found exactly as described. Just wonder why it didnt include the pin to replace SIM. Apple claims that every device package should have one. No big deal though. Not sure why is device getting hotter when used, but I'll give it some time before making any conclusions.","rating":5},{"id":"R1116655ERJ8PS","title":"Great phone, GET A DIFFERENT COLOR...read below","text":"If you're looking to buy this product, please read this before. Wasn't sure what to rate this product because I love the phone but this color won't do. It's not really the color of the phone, it what happens to this one and for some reason this one only. On this color/type the camera shifts almost 1/3 to half the way over to the side which is very often and is actually called the #crescentgate or crescent moon club if you'd like to give it a look on google. It hasn't effected the quality of the photo but it's very bothersome and just looks weird. Also, the back camera header fades and also looks strange. I'm not encouraging you to not buy an iPhone. My phone is great!! I'm encouraging you to buy a different color because I did some research and this is the only color of this model that has this problem. Also, it doesn't go with many cases..but that should effect whether you buy it or not.","rating":3},{"id":"R1RUFLCOKFOHAG","title":"This was a gift for the teen who LOVES IT ...","text":"This was a gift for the teen who LOVES IT! Despite being reconditioned, it runs well and has a long battery. NO complaints.","rating":5},{"id":"R2VAEU658UT366","title":"Great Phone!","text":"Came on time! Looks great! I got mine from supreme deals 18. Would buy from them again! Looks brand new no marks or scratches! (Don't mind the bubbles, we tried to put on a screen protector)","rating":5},{"id":"RFY2JCPD5RZ9B","title":"Five Stars","text":"excelent","rating":5},{"id":"R3C4J40589JC2L","title":"Got what I was told","text":"This is the first phone that I purchased that isn't in a contract and the description was right on point. The price was right, the company shipped quick and according to other reviews their service is good. Hopefully I won't need that but so far so good!!","rating":4},{"id":"R1ABAQWDT2P6L3","title":"Five Stars","text":"Love It! Great buy","rating":5},{"id":"R1FX6YXYN4CEU1","title":"Five Stars","text":"So far excellent! Like a new phone!","rating":5},{"id":"R2A9HGQH6K6SNO","title":"Phone is not unlocked like it is supposed to be","text":"Phone is not unlocked like it is supposed to be.  No answer at the customer support phone number, and voice mailbox is full.","rating":1},{"id":"R1C9GFUE8CWOX0","title":"Misrepresented as usa capable","text":"Don't buy this phone if you want a usa phone  It is not a real usa phone.  It is different in how it reacts to recent OS updates than the US versions.  They do not say that.  The inference is that this is a usa phone.  It was not","rating":1},{"id":"R2B44YI4MBS3Z7","title":"looks like a","text":"Phone is working, but the box has been opened, the phone is no original film, looks like a Refurbished","rating":3},{"id":"R2VAEU658UT366","title":"Great Phone!","text":"Came on time! Looks great! I got mine from supreme deals 18. Would buy from them again! Looks brand new no marks or scratches! (Don't mind the bubbles, we tried to put on a screen protector)","rating":5},{"id":"R3946M193B6TBM","title":"Iphone 6 is defective and no apple warranty.","text":"The iphone 6 looks new but its defective and no apple warranty on it.Returtned the device to seller.","rating":1},{"id":"R250RQLOKSD7K","title":"Horrible! Horrible","text":"Horrible! Horrible!, Send this phone to my dad in Venezuela and tells me that came with the loose battery. Not new product, it is used","rating":1},{"id":"R3O9I2BJYNBRFM","title":"Product with a failure","text":"Product Was intact beautiful but the phone has a faillure it overheats im really angry about this","rating":1},{"id":"R2K6KZI9P9GR0G","title":"Love it","text":"Very satisfied with the phone I received. Very fast shipping and phone looks and works great!!!","rating":5},{"id":"R1YKKYGFMUNJNR","title":"Two Stars","text":"6 iPhone body was scratch","rating":2},{"id":"RX8IL1CJRF6A9","title":"Two Stars","text":"the battery is really bad and there are many dents onit","rating":2},{"id":"R22M5PYWNGVDV0","title":"CAMERA SHUTTER WONT TURN OFF","text":"Apparently, these phones are from Japan which is fine except that you can not turn off the camera shutter. I have tried everything I possible could and even called Apple, but there was nothing they could do.","rating":2},{"id":"R3E3W9RUHHUBH7","title":"The cellphone looks new, but sometimes the screen blacks ...","text":"The cellphone looks new, but sometimes the screen blacks out so I have to press the sleep button. I don't know if it is a factory default or maybe the iphone was refurbished. Anyways, the devide is working OK","rating":3},{"id":"R1U4E2QXV1DPWG","title":"The iphone 6 was in perfect condition. This is my second iphone that I ...","text":"The iphone 6 was in perfect condition. This is my second iphone that I bought on Amazon and the first one lasted a long time (almost 3 years). So far I haven't had any problems with the phone itself. It turns on quickly, opens apps smoothly and it charges quickly and doesn't loose it's charge.","rating":5},{"id":"R29RC6QOV6OGVV","title":"I fooled!","text":"The screen of the phone I purchased 6 months ago came out by itself. I took it to the Apple Store, they said the phone was purchased in 2014, the warranty is full, and the screen may have been changed, do you have a sanction on this issue? Help please","rating":1},{"id":"R3M0V0S0DMAEV1","title":"Ever since I received it doesnt work at it best. I am still trying to send it back ...","text":"Ever since I received it doesnt work at it best.  I am still trying to send it back for them to repair it.","rating":1},{"id":"RSJPV24NIM1LH","title":"One Star","text":"Phone not in good condition will not connect. Hardware issues per apple support tech in store.","rating":1},{"id":"R3VLGN39T611Y9","title":"So far so good","text":"It's only been a couple of weeks.....keeping my fingers crossed all goes well.  Will update review if needed.","rating":5},{"id":"R247NHZ2WRYQTA","title":"I BOUGHT MY GRANDSON this phone for Christmas and we ...","text":"I BOUGHT MY GRANDSON  this phone for Christmas and we have not been able to get it to work yet.  We bought a new nano-sims card from straight talk, because we were told we needed it and it still won't connect to straight talk.  can someone help me","rating":1},{"id":"R3QIZP7OQIJEI0","title":"Really bad battery. I did charge full battery and i ...","text":"Really bad battery. I did charge full battery and i don't use phone about 8 hours. When i open my phone i see battery down 60%. When i return phone back i need pay for my phone.","rating":1},{"id":"R2BAL0GM79F580","title":"Not working phone","text":"The phone is not working, not even opened.","rating":1},{"id":"R21FLK9FM0XGUK","title":"One Star","text":"very poorly scratched, the buttons are not working proper. hopefully retuning it and getting another one from different seller.","rating":1},{"id":"R3EQ88BNILIEKR","title":"Second time purchasing exact same phone","text":"This is my second time buying this phone for my daughter, 1st one was stolen, and it works just fine. The phone is 16g as stated, it came in a sealed apple box with all accessories that come with Iphones. (Charger, usb cord, earbuds) There were no scratches or signs of use noticed on the phone. The phone was unlocked as listed, I had no issues getting her number switched over. The reason for 4 stars is the front camera has a blue light glowing very dimly, but noticeable. This made me a little nervous as it glows even when phone is in sleep mode. All in all I would order from this company again. Oh, the 1st phone was perfect, too bad it was stolen.","rating":4},{"id":"R3K5OS1Q2XCKHC","title":"Used phone advertised as new.  Do NOT buy!!!!!","text":"This product was not as advertised, as a new iPhone 6.  It was verified by AT&T (by the IMEI number) that it is a USED phone.  The SIM card tray would not even open.  Do not waste your money.  I was extremely disappointed and upset to have been deceived.","rating":1},{"id":"RRVJWYAH81FIZ","title":"Exactly what you're looking for!","text":"At first I was very hesitant to buy this iPhone.My reasons are because of the price and that it is online and you never know who you are actually buying an item from or even if it's the right item.My iPhone 6 (space gray) arrived two days ago and I can't be happier. This phone is amazing and I got exactly what I paid for! You won't regret it!","rating":5},{"id":"RZECCC4JSQ6AE","title":"Great phone, with moderate battery life, and great usability.","text":"Apple UI is hard to beat as far as ease of use, and simplicity. The phone does everything I'd like it to. Battery life is not the greatest. Screen size was something of a worry for me, since I thought that the iPhone 5/5s screen size was perfect for me. I got used to it real quick, and now it doesn't bother me at all.","rating":4},{"id":"R3DD9CE9824CGU","title":"The phone itself works great!: )","text":"The charger cord over heated and melted! Apparently Apple isn't producing a charger capable to power the iPhones correctly. I had to buy a different charging adapter that could hold the power and not over heat. The phone itself works great! :)","rating":4},{"id":"RW7WPNX66Q8RW","title":"i have problems with my phone, Wi-Fi and Bluetooth ...","text":"i have problems with my phone, Wi-Fi and Bluetooth do not work , went to Apple informed me the main board was damaged, and no---guarantee for being  model 2007, ask me what changed or repaired, I trust in Amazon and i want to buy warranty for 2 years for my phone","rating":1},{"id":"R1T8JRX3TXT6OP","title":"I am not satisfied with this situation","text":"I received the product on time, however in less than a week the phone has been having some issues with it's battery, It has turned off twice (randomly) and at the Battery section of the settings shows a message that says \"Your phone battery may need to be serviced\" so think it's a battery problem. I am not satisfied with this situation, what should I do about it???","rating":2},{"id":"R1LTGJI9HDMGMX","title":"Seems like iphone with all accecories which is not working","text":"never buy it, it is a big scam...please...Charging port of Iphone is damaged...we cannot charge at all...Seems like iphone with all accecories which is not working....","rating":1},{"id":"R1EMO8KWP743HD","title":"Mint Condition Unlocked iPhone 6","text":"We bought our unlocked iPhone 6 from Vapor Dome.  It showed up in mint condition - in the box - with all the accessories.  Worked perfectly with our T-Mobile card from another phone.  No issues whatsoever.  Very happy with the purchase and the performance of the phone.","rating":5},{"id":"R20JF9JZINXO9Z","title":"Amazing!","text":"Phone came in brand new factory sealed and everything. Works Perfectly. If you're wondering if you should upgrade from your 5s, I would highly recommend doing so.","rating":5},{"id":"RL5FN7JNG4ON0","title":"Used I6","text":"Software is better than the 5 I had however I'm having issues with touchscreen sensitivity and screen blacking out and locking while talking on the phone.  Unable to unlock screen unless other person hangs up first.  😐","rating":2},{"id":"R27K123YGSFH9V","title":"SCAM ALERT.... Phone was supposed to ...","text":"SCAM ALERT....Phone was supposed to be new and not refurbished. Phone kept shutting off at 50 percent battery. Took it to the Apple Store and the battery had been charged 350+ times.  Also, they told me that it's not even an apple product.  It's another brand of phone with just the apple cover put over it.","rating":1},{"id":"RLDFLE8U9POXW","title":"Pretty Good","text":"The phone came really fast. I could tell the phone used to have a cracked screen because whoever replaced didn't align the screen & the phone all the way. Overall the phone came in great condition for the price! Occasionally it'll freeze but if I lock & unlock the phone it goes back to working normal again.","rating":4},{"id":"R5745V3M3JLP1","title":"Amazon sells stolen merchandise. Fulfilled by Amazon means it ...","text":"Amazon sells stolen merchandise. Fulfilled by Amazon means it is fenced then reported stolen after you can't return it.","rating":1},{"id":"R2YHSF4LZ5OEZ3","title":"Phone broke after a month of getting it","text":"The phone was a little more broken than expected. It looked fine when I first got it, with only minor bumps to the back. I had the phone for about a month and i plugged it in to charge, when I came back the screen wouldn't respond to my touch. I manually reset the phone and now it wont even turn back on.","rating":2},{"id":"R2YMGFR0XLYB8Y","title":"Great experience","text":"It was a wonderful experience from quick shipment to delivery. Item found exactly as described. Just wonder why it didnt include the pin to replace SIM. Apple claims that every device package should have one. No big deal though. Not sure why is device getting hotter when used, but I'll give it some time before making any conclusions.","rating":5},{"id":"R35E6NHTAS3LAJ","title":"Disgruntled","text":"This phone seem to have a bit of issue . The phone is going off when it's being charged and it's difficult to turn on or get power . If this is a new phone why am I feeling like I have been robbed. Upset","rating":1},{"id":"R1Y32WLVH1N0GH","title":"iPhone YES play-doh NO","text":"I bought my 16GB iPhone 6 from @ECL PRIMEHere's a link to the seller: https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=oh_aui_sellerprofile_o00_s01?ie=UTF8&isAmazonFulfilled=1&marketplaceSeller=1&orderID=106-2115012-5958633&seller=A19AKH4SNCK0KJI did not get any \"play-doh\" and the phone is real. I received it on time, it was dead, but who cares. Charged it, installed SIM in 1 minute, and it works like a charm. (picks up better signals than my LGv10). I'm not an iPhone fanatic so I wouldn't notice a \"difference\" between this iPhone and a \"real\" iPhone, if this one is fake. It's quick, smooth, and the camera quality is good! I can record at 60 frames in 1080p, and it looked good as NEW.","rating":5},{"id":"RRZX7VP5GHGJB","title":"... this back in September and it came in perfecly fine. I got everything (the headphones and charger) The ...","text":"I'm writing this late but I bought this back in September and it came in perfecly fine. I got everything (the headphones and charger) The phone works great and my sim works perfectly. My friend wants to buy from this company and I told her it's trusted since my phone came in perfectly fine. Great price!","rating":5},{"id":"RSBCB1KN9Q9MA","title":"FULL OF PLAY DOLL INSTEAD OF PHONE","text":"it was full of play doll! unbelievable!!! I spect my money back NOW!!!","rating":1},{"id":"R2RKH6XURYNGLA","title":"These Are Refurbs...","text":"These phones are refurbs and are not sold by Apple.  I discovered that mine was a refurb when I the first one I bought failed a drop test and required replacing the screen.  The tech replaced the screen while I watched and discovered the non-Apple seals inside.  Further, this particular unit was missing two of the three screws holding the Home button in place, which explains why it was \"mushy\" from lack of support when pressing.However, I received the model/color I asked for, the Apple box came shrink wrapped with all accessories, the phone activated properly, and I've had no Apple software related issues, including a successful upgrade to iOS 10.","rating":3},{"id":"R1BIB1CZQXDVM","title":"Satisfied!","text":"Bought an this iPhone because I needed a new phone. It came in and was satisfied! Bought it from Supreme Deals 18. They are authentic and would def buy from them again","rating":5},{"id":"R1RGA12L91S8FF","title":"Beware of h2o","text":"Be careful who u order this phone from h2o, suppliers are China n have sound restrictions on there phones, cant turn off or mute shutter for camera.","rating":1},{"id":"R3P4Q0KCNN3OKP","title":"Wasn't worth $500","text":"It freezes up a lot.. Has a lot of scratches that the pictures don't show","rating":2},{"id":"R2ZMKA31SUS5GH","title":"bad","text":"When I got this I was super excited!!! But the battery sucks on it. Every ten minutes it dies(not joking) and it is very annoying. It will be at 100% then go to 1% in 5 minutes. Not sure if this is for every phone, but it is VERY annoying.","rating":1},{"id":"R2HTX6TA5PJ2D","title":"When moving it sounds a little loose and does not ...","text":"When moving it sounds a little loose and does not light, and the Home button does not pre-order, totally damaged ... Requires change / reimbursement.(Al moverlo suena algo flojo y no enciende, y el boton Home no preciona, dañado totalmente... Requiere cambio/rembolso.)","rating":1},{"id":"R92VIYGRC6E09","title":"box no phone","text":"dont bro. you will get a box with no phone","rating":1},{"id":"R2IOGSVXKDO6XN","title":"phone is good, but I was upset that I can not ...","text":"phone is good, but I was upset that I can not turn off the sound when doing photos. likely this phone was made for Japan, as in Japan, the law - you can only take pictures with sound.","rating":3},{"id":"R22NSP7PYUZ0FY","title":"The phone arrived early and was in great condition. Setup was very easy","text":"The phone arrived early and was in great condition.  Setup was very easy; I have been using the phone for 3 weeks and I am very pleased.","rating":5},{"id":"R32PD1NC31OL3V","title":"Excellent!!!","text":"I got this phone for my son he absolutely loves it!Works great on family mobile which I was worried about but was the greatest thing I've gotten for the price.I recieved the phone on time also no problems what so ever!!!!!!!!!!!!!!!!!","rating":5},{"id":"R3QHZZZTMNGWK8","title":"Great phone.","text":"Just as described. Great phone.","rating":5},{"id":"RU7CPEJ76PCWY","title":"One Star","text":"dont work","rating":1},{"id":"R3FEWEYFCJ3N27","title":"Cellphone locked","text":"the cellphone was suposed to be unlocked but i couldnt use it with any operator, also I try to unlock it but it was at the black list.","rating":1},{"id":"R1VX8423V8CCQ0","title":"One Star","text":"You sell it unlocked but is not, it is locked. What do I do now ?","rating":1},{"id":"R1HPI56N0ND4MZ","title":"Wallet friendly upgrade","text":"Great price (relatively speaking) for brand new phone. Works great.","rating":4},{"id":"R2C43XEFOIELDV","title":"Five Stars","text":"Great product and great seller!!!","rating":5},{"id":"R30K5N0LJYUV0N","title":"Battery.","text":"The Phone is working good, but there are some issues about the battery. It goes fast, even though I charged normally. Don't really know what could be happening...","rating":4},{"id":"R7USPPEB46AFS","title":"Five Stars","text":"Excelent product,however I wanted to let them know that after updating the ios the phone is giving me problems with the wifi , I wonder if there is any way to repair or replacement. appreciate your response","rating":5},{"id":"R37HZ11NEVI4YI","title":"Four Stars","text":"Phone working as expected now. Got locked out & had to go to Apple Store st mall for help.","rating":4},{"id":"RVYADHW9404JS","title":"yesteday I had to pay nearly 300usd because my phone ...","text":"yesteday I had to pay nearly 300usd because my phone just blackout, I went to the apple repair shop and the reason was a defective circuit related to the power button, it's important that all phones sells from you have the proper quality to avoid these kind of situation","rating":2},{"id":"R18VQ6COKULA5","title":"One Star","text":"It was false advertisement, everything worked except the most important thing to me, wasn't able to connect it.","rating":1},{"id":"R7RYLHKTUJOTV","title":"The phone it was in good conditions. it suppose to be unlock so I ...","text":"The phone it was in good conditions .it suppose to be unlock so I can use it with any provider .I took the phone to South America and I couldn't use it at all.was not unlock !!I have to return in a month hopelly they I'll received the phone back .","rating":3},{"id":"RQ4WNSVJB5GGX","title":"Becareful !!","text":"Thick black vertical line in the middle of the screen.","rating":1},{"id":"R2XHTJIAO6ZWLG","title":"No SIM card","text":"Great phone no complaints. It was in great shape. Only thing was it showed no SIM card but they fixed it at the store no charge.","rating":4},{"id":"R31KB0C24RIMAX","title":"... worked for 15 min then the screen went off terrible purchase zero","text":"Phone worked for 15 min then the screen went off terrible purchase zero star","rating":1},{"id":"R96YI62Q0B9MO","title":"I have been having problems with this phone since I ...","text":"I have been having problems with this phone since I bought it whenever I am on the phone it makes weird loud noises for the person I am talking to","rating":3},{"id":"R209RZ1YGGIQRK","title":"Don't waste your money","text":"BUYER BEWAREThe phone worked for 6 months and then it stopped powering on.  Took it in to get fixed by Apple and was told they wouldn't touch it.  No IMEI on the back of the phone and its not printed on the sim card tray.  Didn't save the packaging and trying to find it using iTunes didn't work either.  Very disappointed.  I should have just payed a bit extra to buy it directly from a reputable retailer.This phone was not used by me so I didn't notice the poor quality until it stopped working.  Pretty sure they sold me a fake.","rating":1},{"id":"R1QE4EHO2LWCWI","title":"Bad product","text":"The phone is not new, it buyed on 2015 according Apple and it was refurbished. The phone was in bad condition. The sound was not working. I had to go to Apple Store and they said me that I should to change the phone. Bad product.","rating":1},{"id":"R1UF8KOSKS5HV6","title":"Five Stars","text":"great phone, good price, arrived quickly & in original packing","rating":5}]