[{"id":"R1SOWF4R0T8D8R","title":"The worst buy i ever done in amazon.","text":"Only two months of use and no longer serves. The image suddenly stops and the cell phone turns off without restarting. Worst of all is to have bought the cell phone to use it outside the United States and now I do not know where to claim for the guarantee.","rating":1},{"id":"R1D5CE6TTGMSBN","title":"One Star","text":"the phone just lasted two weeks then starts going freeze and doesnt turn on again","rating":1},{"id":"R13NNWT5O5C9M3","title":"Samsung - What has happened to your product and quality control?","text":"Purchased June 2016 died January 2017. There is no damage to this phone - Samsung is welcome to contact me to have the phone returned for inspection. In the middle of the day it began restarting itself. Would not allow a reset. I took it to UBREAKIFIX - they said they have never encountered this problem and also could not reset it to factory default - there was no charge for their efforts. This is the 5th Samsung phone I have owned up until now I have been very happy.Photograph of the phone attached.","rating":1},{"id":"R326VR7U0DCGOS","title":"I start using it everything went fine, until it start to freeze at the beginning ...","text":"I bought this cellphone from this seller on Augusto 02 2016,I start using it everything went fine , until it start to freeze at the beginning I restarted the phone to make it work but then that does not work anymore. I contact Amazon told me that the phone has pass the 30 days of warranty ( unfurtunately my phone started to freeze after I used it like a month and half ) Amazon contact the seller for me and thge seller gives me the same answer about the 30 days of warranty, well my last option is to go to a authorized samsumg shop well I have a Samsumg right!! But they tell me they can't do anything for me because the phone I bought is from an nonautharized seller: Wireless Everything. So, I am stuck with a phone that cost me $648.99. Be careful so this not happen to you!!!!!","rating":1},{"id":"R2Q1TWOT4RR4BW","title":"One Star","text":"Recieved it with hardware issue. Touch doesnt just work...as its international phone, samsung wont fix it...","rating":1},{"id":"R1HVHTV6X1H41J","title":"Worth it! Go for it!","text":"Great mobile for this price. Packaging was done neatly. Genuine brand new mobile with all genuine accessories inside. Very quick shipping by the seller. Thank you.","rating":5},{"id":"R3Q1503OUI8830","title":"Don't buy it","text":"IT stopped working after 1 day. Major disappointing","rating":1},{"id":"R83SZ0RCCYWQW","title":"Works perfect with the Brazilians (GSM) carriers","text":"Works perfect with the Brazilians (GSM) carriers. Nice and solid finishing. Noticeable improvement from version S6 (I have one). I wish it was for two SIMs, but's ok.","rating":5},{"id":"R1LMKTR87XFFXE","title":"One Star","text":"I received a fake phone","rating":1},{"id":"R28HIOYOP71EVN","title":"One Star","text":"The product start to have problems with the screen and the vendor dosen't have any to say about that","rating":1},{"id":"RD2IRC4AJBX7D","title":"Charger is a bit of an issue","text":"First of all, this product came delayed in shipping. One week late to be exact.Second, the cable charger usb that comes with the product is missing a line, slowing down my charging. Another small issue is that the charger plug is big and doesn't fit in most power extension cords.There is also a small heating problem with the phone when using it to play games or for long periods of time.For my personal preferences, I dislike the phone because all the buttons are very sensitive; even the power and volume buttons are sensitive and easy to press on.","rating":2},{"id":"R2IHCK6EYTIOIZ","title":"Do Not Buy This Version of the Phone!!!!!","text":"I purchased this phone back in April of 2016 and on March 4th it straight up broke. I was charging it on my desk for about an hour and when I returned, the phone was fairly warm to the touch and there were no lights indicating whether it was still charge or the charge was complete. It tried to turn the phone on with the home button, no response. I tired to do a system reset, no response. I tried to start safe mode, no response. I paid 700 USD for this and now I am left with a phone that is completely unresponsive.","rating":1},{"id":"R2HC9NYDQX4DFW","title":"Uhhhhh, I guess this is what I ordered...","text":"I sorta thought i would be getting a European power adapter with the phone, not a Great Britain adaptwe. But it is indeed unlocked and works just fine in the US.","rating":4},{"id":"R1FX4IX6PDS4ET","title":"I bought this phone from just about a month ago ...","text":"I bought this phone from just about a month ago. and the screen messed up. I started seeing multiple colours and now i can't see a thing. the phone didn't fall or anything of that sort. ineed a refund and or a new phone... please be warned..i have not heard back from seller!!! i feel cheated!!","rating":1},{"id":"RC4225XZ0FENQ","title":"One Star","text":"Unrepairable in USA","rating":1},{"id":"R3OMBGBZ95U3IC","title":"Sent me a broken s7 edge","text":"I got this device a day before Christmas as a gift for my wife and the screen was cracked, the sim tray was missing, and there is a flaw in the lcd display. I have to pay more to get it repaired quickly b4 Christmas. Thought to do in the middle east no repair shops on base!!!","rating":1},{"id":"R7YCRP0POEZN5","title":"Excellent product","text":"The cellular is from Saudi Arabia and come with applications installed that you can delete. Works without any problems and updated to Android 7.0 once you power up the phone. The charger it's from Saudi Arabia and it's too big but the seller provides an adapter. Buy from Wireless Everything","rating":4},{"id":"R2RDTMETNX3DVV","title":"Be aware, scam","text":"This phone is a mess. I used to love the first months but now I don't have any signal( I tried 3 conpanies already) and is heaing up and freezing and starting the phone. Also my fingerprins don't work. I can't believe amazon is selling fake phones or damaged phones","rating":1},{"id":"R1ZJO4SXJ2UXZ9","title":"I bought the phone in April 2016 and worked perfect until October of that year when it started to ...","text":"I bought the phone in April 2016 and worked perfect until October of that year when it started to restart itself and every time, and VERY HOT. There are days when I just can not use it and many others work fine. I contacted Amazon and they told me that it was out of the 30 day warranty but that I¨ll should go to a Samsun Center for the 1 year warranty. I did it and as I live in Ecuador, South America, I took it to the authorized center and they told me that the problem should be that it has to be update, it but they could not do it because the phone is from Egypt !! And that only in the place of origin it can be done!!So when they buy a phone notice of which zone it is.Sold by: Wireless Place.Now in March 2017 the  cell phone stopped working. For having been bought on Amazon it  had no Samsung warranty and as the damage occurred after the first 3 months, Amazon also did not take responsibility. I lost the $ 750 that it cost me before a year of use.I will never bought a mobile phone in Amazon again.","rating":1},{"id":"R3V1M40PEZG4JU","title":"However the phone it's self is working great and I am very pleased","text":"Reading the reviews I got very concerned about the phone I just ordered but I have to say I had no issues getting it and it is working perfectly. One thing I do have to say is you don't know what charger your going to get I got a European one and I live in the US, and when I turned on the phone the weather widget said the last place it has been was al twar Dubai and it has had a Arabic instruction manual, the phone was also already on when I opened the box but the box was sealed tight so I don't know if that's normal or what. However the phone it's self is working great and I am very pleased.","rating":5},{"id":"R152VWVL8SB52Q","title":"Cheers","text":"My wife loves the phone. No problems with this one and I hope none come about. Other than getting a lemon on the first phone she received, this one seems to be perfect. Samsung is my favorite brand. Love all thier stuff.Amazon is great at helping customers take care of any problems they have with item by ensuring return shipping is easy and refunds are fast.","rating":5},{"id":"R3UWZKOFKOSCUH","title":"Just terrible experience with this","text":"Just terrible experience with this. In a couple of months USB slot stopped working, so I could only charge it wirelessly. Then the device started warming up sometimes to a point it was difficult to hold it in your hand, and then going into restart cycles. I contacted the seller and was told they only provide 30 days return policy, which is reasonable. What I was shocked about is when I contacted Samsung support I was told they can't help me with an international version and I have to contact the seller. They basically refused to be liable for the product they manufactured. I had to buy another phone and have a useless piece of technology worth $600 at home, don't know what to do with it. Will probably have to throw it away eventually. The repair shops say to get to the USB slot they have to remove the screen which according to Samsung manual can't be removed without damaging it, so they give me 50/50 chance they can remove it without cracking. But since now it's completely unusable may be I could give it a try.","rating":1},{"id":"R2RDTMETNX3DVV","title":"Be aware, scam","text":"This phone is a mess. I used to love the first months but now I don't have any signal( I tried 3 conpanies already) and is heaing up and freezing and starting the phone. Also my fingerprins don't work. I can't believe amazon is selling fake phones or damaged phones","rating":1},{"id":"R15E1MWDAD3O0E","title":"Great Phone, at a Great Price","text":"We are on MetroPCS.  While this is an international version of the phone, it works extremely well.  We have no issues with service what so ever.  My husband set up the phones before taking them in to get the sim cards switched over.  Both had a direct update from Samsung to Android 7.0 that had to be downloaded, and installed.  On Wifi the download was very quick, and it was all done and installed in less than 30 minutes.  Gorgeous phone with glass front and back, and while my husband finds the edge apps annoying i love them.  I think its just the way he holds the phone.  We both love the battery life.  He is into an online only game, and now he can play through his 4 accounts and still has over 65% battery life left and that is going on them multiple times a day.  I have my wifi and data on all the time, and my phone has serious use through the day, and i have usually about 45% battery life left at the end of the day.We purchased the actual Samsung portable chargers for this, the little circles you just lay your phone on, and don't have to plug in the mini usb cord.  They work great, and charge the phones as expected.Overall this is my 3rd Samsung product and i am not at all disappointed.","rating":5},{"id":"R4IQFEE672KHL","title":"Phone works well for two months. Then the display ...","text":"Phone works well for two months.  Then the display turned off.  I tryed to get support from Samsung, and they said is an International version, it has not warranty in the US.  Needs to be sent to Australia for warranty service. Very ugly experience","rating":1},{"id":"R14RX2ZZ5AF6VM","title":"Unsatified Customer!!!!","text":"I HAD TWO OPTIONS THE SONY XPERIA XZ OR THE SAMSUNG S7 EDGE. I BOUGHT THE S7 EDGE CAUSE EVERYONE WAS LIKE, YOU CANT GO WRONG WITH SAMSUNG. BOY DID I WENT WRONG OR I GOT A DUMMY PHONE INSTEAD OF A SMARTPHONE. IN LESS THAN 24 HRS OF USING THE PHONE IT STARTS TO FREEZE UP, APPS SLOWING DOWN AND IT CONSTANTLY TURNS OFF ON ITS OWN. I AM VERY DISAPPOINTED. YOU WILL FOREVER SWIPE AT THIS SCREEN IT WON'T UNFREEZE. I EVEN TRIED TURNING IT OFF BY HOLDING DOWN THE POWER BUTTON FOR A FEW SECONDS AND IT WON'T EVEN GIVE ME THE OPTION TO RESTART OR TURN OFF THE DEVICE. WHEN AND IF YOU DO GET TO FINALLY USE AND APP AND YOU TOUCH THE BACK KEY IT FREEZES AGAIN. BOUGHT CASE AND SCREEN PROTECTOR, ONLY TO BE INCONVENE BY A DYSFUNCTIONAL PHONE.WHAT DO PEOPLE HAVE TO DO TO GET WHAT THE PAY FOR?!!!!!!!!!","rating":1},{"id":"R37F2UT1YJDXV9","title":"You miss some good features with an international version","text":"It has been already spoken a lot about this phone, and if you are not leaving in the cave, you have your own opinion about this phone.The topic I want to cover in this review is the international version of this phone. Just a small disclaimer: I truly think this is the best phone on the market with the best camera.Reasons to buy an international version:  - You're not SIM locked to any carrier, and can use your phone on any compatible GSM provider, even ones outside the US.  - Major software updates will likely be available to you sooner than carrier-branded US S7 edge models.  - No carrier bloat apps - my unlocked S7 Edge has a full 1.5GB more available storage than my husband's AT&T-branded version and over 2GB more than the Verizon version of my colleague!  - Prices are MUCH cheaper for international versions.Reasons not to buy an international version:  - You'll have to work directly with Samsung or a 3rd party warranty provider (e.g., the retailer) in the event you need to take advantage of the warranty - that could mean shipping, waiting, and dealing with a lot of unknowledgeable service reps. A carrier phone can just be taken to the carrier store, and often can be replaced on the spot if it's faulty.  - Worse battery life and somewhat worse performance versus the Snapdragon versions.  - You lose support for things like Wi-Fi calling, VoLTE, wideband voice, and some other carrier-specific features, potentially. At least for the time being (this could possibly change in the future, but I wouldn't count on it.)  - Samsung Pay doesn't work, and may not ever.  - These phones do not and will not ever work on Verizon or Sprint.Considering all this, I would never buy an International version again. Looking forward to buy a new S8 Edge later this month.","rating":3},{"id":"R3HFT0R81BHRH4","title":"Bad choice","text":"Very unhappy about the edge, miss touch all the time cause when you hold it, you are touching the edge which is super sensitive.The camera lens got broken by itself. WTF.Now it's also having issue charging.This is my first also last Samsung phone.","rating":1},{"id":"R35XUFNMJRJNQE","title":"Awesome phone but make sure you know what your getting if you buying this for the US.","text":"It's only been a full 2 days but so far this phone is everything I had expected, keep in mind I purchased this phone from Wireless Everything and the phone is legit I have done complete side by side comparisons just to satisfy my paranoia. Now there are a few differences between the US and International versions for starters you will recieve a Internationl style plug which does not work in the US, Samsung pay is none existent and cannot be downloaded and it lacks a large majority of the US bands so this phone may not be compatible with your network, I live in the LA using Cricket and havent had any reception/internet issues whatsoever.(should work just fine with At&t as well) Besides the cons this phone includes a much better processor then the US, has better battery life, doesnt get as hot and reportedly has better Audio. In contrast the US's 820 snapdragon processor can play games better but is much slower when loading, switching threw applications and overall general use.This phone is overall extremely quick and everything I've come to expect from the Galaxy s6 and then some. I will keep this up to date if anything changes!","rating":5},{"id":"R8QZKC76LL32B","title":"Not a new phone. Not sure if its genune Samsung.","text":"Factory seal was open and phone appears to be tampered with. Not sure if phone is a genuine Samsung phone or a knock off. Also weird software installed on phone as well. Not sure what else is installed. Will be returning ASAP.","rating":1},{"id":"RLCDXBHSEIZEC","title":"The Best!","text":"The best smartphone from Samsung right now hands down, shipping time and seller were great.","rating":5},{"id":"R101JDORSNOG56","title":"Best phone ever!","text":"I already have this phone for about a month and I haven't found any problem with it. Is legit and works perfectly.","rating":5},{"id":"R85C32PUSDPZY","title":"Love my new phone","text":"Love the phone I bought (black onyx). Works very well. Great camera, great screen sensitvity and charges quickly. The only downside is that I have to use a converter with the fast charging cord. I find it cumbersome although it works well. I guess it was made for a British market.","rating":4},{"id":"R1HXMUAJIGZ9TD","title":"Excellent phone when new","text":"I am a big fan of the Galaxy S7 edge. It works very well and the camera is just great. However, after using it for a couple of months, a pink stripe appeared on the screen what limits the experience. Samsung was not able to help.","rating":2},{"id":"R1KWBG16PMPTMI","title":"the best phone I've owned","text":"Shipment arrived on time.  So far, the best phone I've owned.  Takes some effort to locate and update the device firmware.","rating":4},{"id":"R3UOC0ZGXWA98P","title":"\"new\" phone looks refurbished","text":"I got two one works well the other has a defect under that glass.the EU to USA power adapter didn't work the first time we had to unplug and plug it in a few times I think the contact needed to dig into make the adaptors work.I have to deal with a lengthy process of returning one getting a refund and getting a replacement.  reloading all my content back into the next device.","rating":2},{"id":"R8SLFRLCSG03X","title":"Five Stars","text":"It's a very good phone, but the charger isn't for Latin America (it's for Europe, I think).","rating":5},{"id":"R17HX1N0ALU2FW","title":"Five Stars","text":"just what I was looking for","rating":5},{"id":"R2O2KWWCBDBCU3","title":"Don't buy this version of this phone, because of ...","text":"Don't buy this version of this phone, because of the \"red line\" that will appear on the right side of the phone.","rating":2},{"id":"R17AXJN4KZRHGK","title":"Great","text":"This phone what can I say .... it's fast nice feel to it .... no lag... Samsung will be samsung they will only get better and better...","rating":5},{"id":"R1ZD8EIN5DY2F0","title":"Please read carefully the fine prints of INTERNATIONAL","text":"Arrived with a defective screen and home button.According to Samsung. this phone is refurbished and is not under warranty in the US.Please read carefully the fine prints of INTERNATIONAL VERSION","rating":1},{"id":"R1NJBIO8PANE3V","title":"One Star","text":"5 month after buy it, the phone is dead. not work.","rating":1},{"id":"R3U7M0RNULBEIK","title":"G935F working well on T-Mobile US","text":"Bought this specifically because I wanted the Exynos processor instead of the Snapdragon and so that I can root if I wanted to.  I'm on T-Mobile US and did my research to ensure that my bands are supported - which they all are except for some 3G.  I bought this phone from a seller named 'lifeline###' and the box the phone came in had the factory seal.  As another reviewer pointed out, my phone originated from the United Arab Emirates so this came with a non-US friendly charge adapter and the manual appears to be in English & Arabic.  In any case, the phone is great working order and I was able to just pop in my T-Mobile SIM card with no configuration needed, nor a visit to the T-Mobile store!I upgraded from a Galaxy S5 so all I had was the regular charging block which doesn't support the fast charge.  I went ahead and purchased the Aukey QC 3.0 block and I'm fast charging away!","rating":5},{"id":"R306SO9IAZRJKC","title":"I am quite satisfied with this purchase","text":"I am quite satisfied with this purchase, before making the purchase I was afraid of the authenticity of the phone, it was worth taking the risk. The phone works perfectly and arrived without any defect.","rating":5},{"id":"R1BGJMTJN9DRQJ","title":"Sexy phone","text":"This phone is everything a phone should be! It is beautiful, capable, powerful and did I mention beautiful? Honestly, take a look at this phone, it is simple yet elegant! Such a great device, good job Samsung!","rating":5},{"id":"RPP2TI5YTO0L8","title":"I would nerve recommend this seller!","text":"Very bad phone. I bought a new phone but most apps don't work because phone was sent from Dubai and most apps are banned there. Keypad doesn't work properly and phone hangs every now and then. I won't be surprised if I was sent a refurbished phone in a new box. Very disappointed.","rating":1},{"id":"R2715X2X1KIBNQ","title":"Absolutely love it! fast and smooth","text":"Bought this phone and have had it for several weeks. Absolutely love it ! fast and smooth, battery life is amazing. I'm with AT&T and if you can sacrifice wifi calling... this is the way to go. although it doesn't have all the LTE bands I have absolutely no trouble. My job requires me to travel often and I get great coverage everywhere, even in the gulf of mexico. I am now an exynos s7 edge fan boy.","rating":5},{"id":"RZANJ2ZJJXJF7","title":"Smooth, Fast, and Beautiful!","text":"Awesome phone!! Hands down the best phone I have had or used. It's smooth, it's fast, and its pretty to look at and hold. I received a 'United Arab Emirates' version. It is unlocked and works perfectly with my Cricket service, (AT&T network).  One big plus I noticed is network connection speed, on my previous phone, a Xperia Z3+ it was ok but could have been better, and I thought it was just my general location and the fact I am on Cricket which piggybacks on AT&T. With the S7 Edge connection is noticeably quicker and using a speed test app my download speeds are consistently @ 7-8Mbps with even just 1 bar signal 4G LTE, Crickets' throttled limit. Signal reception is also stronger on the S7 Edge in my home than any phone I have had before and I have had quite a few, (H+ and 4G LTE).  It is physically smaller than an iPhone 6s Plus I tried for a short period but it has the same display size, and It's a lot easier to operate 1 handed the the large iPhone.  So far, (after 10 days of heavy use), I like it better every day as it keeps on performing even as I install and use my many apps. The Nougat upgrade has been available for a few days already and I will be upgrading it soon. I will update my review after upgrading to Nougat.**Update** I installed the Nougat update yesterday, (02-21-17). No issues installing, I just let it do it's thing and it took probably 20-30min. Everything works as it should and it has lots of new features, still discovering some of them. No issues so far. I would say it is as fast and smooth as it was before the update if not better.  I'm really liking the blue light filter option to reduce eye strain. This phone is still performing and I still like it better than the day I got it!","rating":5},{"id":"R2OT26B57T6M0S","title":"One Star","text":"Be aware that black translucent lines may appear across the screen even after very short period of usage.","rating":1},{"id":"R3OAAT109MT4O2","title":"Five Stars","text":"Beautiful design..... I love it","rating":5},{"id":"R3JT7J4BBTH3UJ","title":"Five Stars","text":"Everything was as expected","rating":5},{"id":"R3JS5FLLIFBRRE","title":"Amazing, came in brand new for cheap price","text":"Amazing, came in brand new for cheap price, works perfect, amazing graphics, i love it, i just wished the call quality would sound better but other then that theres no issue with it","rating":4},{"id":"RXG7HYVW33CRN","title":"Dissatisfied Customer","text":"The screen started flickering after a week and eventually turned green. I bought the phone under warranty but I'm now seeing that the support window is closed....How do I return this phone???","rating":1},{"id":"R1379DUW321QCN","title":"Best phone ever...","text":"Of all the phone's I've owned.. this is the best one.  Im a Samsung fan now..","rating":5},{"id":"RBWXYG9V1I87M","title":"The only thing... the seal was broken ...","text":"The only thing...the seal was broken upon arrival! The phone appear to be in new condition.","rating":5},{"id":"R13HR0CIBQA759","title":"Bring fast charge capable charger) Not a lithium based bomb waterproof as he||(underwater pictures are really cool but I'm too f","text":"Whelp, Here we goPro:Full androidAll day battery life as long as you're not running GPS for 12 hours(did this, drove from east coast to mid west in a day. Bring fast charge capable charger)Not a lithium based bombwaterproof as he||(underwater pictures are really cool but I'm too fat to swim)Great pictures with rear facing camera and has physical image stabilization(shake the phone and you hear the clicking from the lens bouncing around)Curved screen is sexySpeakers are pretty good for a mono speaker phone(coming from an HTC one M8 with stereo front facing)Alright, Cons:Not perfect battery lifeGlass front and rear make it prone to crackingaluminum frame can flex inward on 4 inch drop and crack the screenreally pissed it actually cracked from a short drop like thathad it freeze up a week ago, but idk whyfront facing camera sucks compared to other phones at pointsFINGER PRINT SUCKS(Oh mah gawd it can't read any of my fingers. I had to put the same finger in as 3 fingers to get consistent unlocking)Volume level warning. This pisses me off to no end. I'm in my car with bluetooth. I have to either change the volume up and down based on listening to radio or listening to phone unless I LOOK DOWN AT THE (choice word here) PHONE and hit YES, I WANT TO BLOW MY EARS OUTNow to angrily try to access my phone and get locked out. It's a nice phone","rating":5},{"id":"R2D9ZI4B6R5O9J","title":"S7 Edge is great!","text":"Great phone, much faster than my older Galaxy S5.  Nice UI.","rating":5},{"id":"R2UQT0I2P7WPAL","title":"i love","text":"recieved my device on time. it was unlocked as stated. i love it","rating":5},{"id":"ROTL2TM0D688Z","title":"One Star","text":"It was a fake one","rating":1},{"id":"R215O9PFJ670ZN","title":"Arab version.  Came opened","text":"This is an Arabic/arab version .  The retail box came opened.  Not sure if it is new.","rating":1},{"id":"R38DPOBGSI6LLD","title":"Phone stopped working within 6 months and I've had a ...","text":"Phone stopped working within 6 months and I've had a very hard time trying to activate my warranty or reach someone to discuss how to get my phone fixed. Don't buy this phone if manufactured in Vietnam!!","rating":1},{"id":"R2NBW4ECSA54HK","title":"One Star","text":"Got pink line issue after several months of use. Samsung won't help.","rating":1},{"id":"R2OT26B57T6M0S","title":"One Star","text":"Be aware that black translucent lines may appear across the screen even after very short period of usage.","rating":1},{"id":"RD1PUDYI3YBGJ","title":"Three Stars","text":"Great phone and all but cant use samsung pay with international/unlocked phone","rating":3},{"id":"R2VJT9C0VXBPO4","title":"Strong and excellent phone","text":"Telephone edge Dandy Yes, it's a phone in the top extravaganza I've loved phone I am very happy very, very strong","rating":5},{"id":"R1POIEV60WMJMJ","title":"Samsung Customer service could quite possibly be the worst on the planet.","text":"I love the phone when it was working. Since it is an unlocked device no one seems to want to take responsibility for repairing it under warranty. I am having the famous grey line problem which seems to be a pretty wide spread problem with this phone.Samsung customer service is terrible. I have spent hours trying to find a way to get my device serviced and keep getting told to call someone else or someone will call me back in 24 to 48 hours and no one ever calls back.For Samsung customer service alone I will not buy another Samsung device ever again.","rating":1},{"id":"R3IKTGD253V402","title":"This seller model freezes and reboots.","text":"The cell phone looks perfect but at 3 months of use started to freeze and reboots itself. It doesn't pass a single day without reboots itself. After a long search on google, I found that this model has this problem. I should have noticed that the seller did not offer the warranty on the product.Samsung Galaxy S7 Edge SM-G935F 32GB Factory Unlocked GSM Smartphone - International Version, No Warranty (Titanium Silver)","rating":1},{"id":"R1TTOR1M45Q5MJ","title":"After one year now I bought this phone and still ...","text":"After one year now I bought this phone and still working as the first time. Is fast, is functional and is gourgeus.","rating":5},{"id":"RMQ2OQ7QL9SJT","title":"Green screen of death after minor drop!","text":"I used the phone for just two months, mostly for web-browsing and to place a limited number of calls. Two days ago, I dropped the phone while seating in a standard chair, the phone was in my pants' front pocket and it landed on ceramic floor. I was using the phone without cover or protective shell. The screen did not shatter, the exterior is undamaged, not a single dent or scratch, but the phone does not work anymore. The screen turned green, and the phone cannot be repaired without considerable investment (approx U$450; estimate from local cell phone repair shop). I understand that I dropped the device, etc. However, it is a faulty design, since the phone couldn't sustain a relatively minor impact from a height of 17 inches. Note: I bought the unlocked version without US warranty, and I did not contact Samsung's customer support.","rating":1},{"id":"RI0LUJ3EU1ZMY","title":"and he actually likes it much better than his former iPhone","text":"My boyfriend got this phone over the summer, and he actually likes it much better than his former iPhone. It comes with earbuds, a charging cable, and a very useful charging adaptor to accommodate different charging ports. I personally think it's too big, but I have small hands haha. Overall, a very reliable phone that works really well.","rating":5},{"id":"R29S9ON5Q3RYY1","title":"Mobile not working","text":"I am not able switch on my mobile since today  morning. The last used yesterday night and when I woke up in morning I found my mobile was totally  dead even not charging also.Kindly help me to find the solution.","rating":1},{"id":"R10S9GNG4P8D5Y","title":"I'm glad I made the right choice","text":"Buying an unlocked phone for use in another country can be full of doubts. I'm glad I made the right choice! My main concern was if this phone - G935F will work in India since it's being marketed as region specific as well as universal unlocked version. In comparison, G935FD is not region specific. My questions were answered on the forum and the phone - G935F works just perfect in India!Thank you for a great product and a great service!!","rating":5},{"id":"R2AIQM8ZL16SXC","title":"... s7 on jun 17 nd everything was very very great until 2 week ago i just realized that in ...","text":"Hi thereI ordered this samsung galaxy s7 on jun 17 nd everything was very very great until 2 week ago i just realized that in the screen there is one pixel wrong. Is almost imperseptible but if you focus on this pixel you can see how s*** it looks like","rating":1},{"id":"RPX9LQUJZ2JQT","title":"I really love this phone I am so glad that I got ...","text":"I really love this phone I am so glad that I got rid of my old phone the Galaxy Mega when I first purchased this phone and got it activated for Metro PCS if you are looking for a phone to get activated this is the phone for you.","rating":5},{"id":"R29H0F65XOQBAB","title":"Great buy!!!!","text":"This was my first phone purchased online so I was a bit skeptical. However, I am very pleased with the phone. I am currently using it from the Caribbean and the setup up was as easy as inserting the sim card. I did all the necessary checks to ensure that the phone was indeed an original and it was. I purchased my phone from the seller \"wireless everything\" and was and still am immensely satisfied with my purchase.","rating":5},{"id":"RPP2TI5YTO0L8","title":"I would nerve recommend this seller!","text":"Very bad phone. I bought a new phone but most apps don't work because phone was sent from Dubai and most apps are banned there. Keypad doesn't work properly and phone hangs every now and then. I won't be surprised if I was sent a refurbished phone in a new box. Very disappointed.","rating":1},{"id":"R2652QBIU2PA7M","title":"Completely death after only 5 months","text":"Phone went completely death after only 5 months of normal use. Will not turn on, does not charge. Seller \"The Wireless Circle\" is unwilling to provide assistance with the issue. So do NOT buy if you don't wish to lose over $500.","rating":1},{"id":"RC4225XZ0FENQ","title":"One Star","text":"Unrepairable in USA","rating":1},{"id":"R1NWN2HWWVXF0M","title":"brand new phone would not hold charge ,,,","text":"phone would not work unless plugged into the charger and its got an internal battery so i had to return it brand new phone","rating":1},{"id":"R2I2I9A8R2YIO2","title":"Love the phone but there are issues","text":"I didn't like the fact that the phone came with a charger that can't be used because it doesn't have the prongs for this country and all instructions were in another language","rating":1},{"id":"R94TZN0HOBS6Z","title":"Its a UK version, not international","text":"Ordered this International version and I got a UK version.","rating":3},{"id":"R26OWX8VOZ4CS3","title":"I LOVE IT! Sold by","text":"genuine product ! I LOVE IT !Sold by: Wireless Everything","rating":5},{"id":"R6G80UECDTGTM","title":"Five Stars","text":"Great Phone! Been About 4 months now everything works well!","rating":5},{"id":"R1LSO498IJ96KK","title":"Excellent Device, Delicate Screen.","text":"Excellent phone, I have no complaints with it so far. However, this is the first Samsung phone that I have ever managed to crack the screen on. I have always used my phones without a case, and never had a screen crack until this one.","rating":5},{"id":"R147ZLQ4PB0T7","title":"Five Stars","text":"So good cell phone, work so good and give it with all accessories.","rating":5},{"id":"R2VJT9C0VXBPO4","title":"Strong and excellent phone","text":"Telephone edge Dandy Yes, it's a phone in the top extravaganza I've loved phone I am very happy very, very strong","rating":5},{"id":"R29H0F65XOQBAB","title":"Great buy!!!!","text":"This was my first phone purchased online so I was a bit skeptical. However, I am very pleased with the phone. I am currently using it from the Caribbean and the setup up was as easy as inserting the sim card. I did all the necessary checks to ensure that the phone was indeed an original and it was. I purchased my phone from the seller \"wireless everything\" and was and still am immensely satisfied with my purchase.","rating":5},{"id":"R1HVHTV6X1H41J","title":"Worth it! Go for it!","text":"Great mobile for this price. Packaging was done neatly. Genuine brand new mobile with all genuine accessories inside. Very quick shipping by the seller. Thank you.","rating":5},{"id":"RSJVQ30XELTM6","title":"Have everything you need out of the box","text":"It is a great phone overall. It is running exynos processor, which was made by samsung. The packaging also include the American plug adapter since the device was made for European country. It is unclocked and works well of tmobile. It should work with other services as well.","rating":5},{"id":"R83SZ0RCCYWQW","title":"Works perfect with the Brazilians (GSM) carriers","text":"Works perfect with the Brazilians (GSM) carriers. Nice and solid finishing. Noticeable improvement from version S6 (I have one). I wish it was for two SIMs, but's ok.","rating":5},{"id":"R2GUCBYYFY2RKF","title":"Five Stars","text":"Awesome","rating":5},{"id":"R2ARZT3A6RSCUF","title":"Four Stars","text":"It was good","rating":4},{"id":"R2D5CW6YF6OV5H","title":"Five Stars","text":"Good","rating":5},{"id":"R3DMJDM1JU5QVD","title":"One Star","text":"Horrible company that sells the phones.  Note- THIS DOES NOT WORK ON VERIZON. WASTE OF TIME.","rating":1},{"id":"R1M21MJL2EV15G","title":"I loved the phone","text":"I loved the phone. Firstly it works, there is no problem with the phone. It is fast and sharp. Screen is big and colorful. I love the curve part. With normal use (some social media, little talk, some music stream with bluetooth earphone it's battery goes for 2 days. If I play Pokemon, it goes 1.5 days","rating":5},{"id":"R1KX1J1QPLND7I","title":"Love it so far","text":"I have only been using the phone for 12 hours so, updates to come.Brand new from Samsung; Sticker seal unbroken.The package included charging cord, plug and adapter for US electrical systems, USB to MicroUSB adapter to link with other phones/tablets/etc, Samsung ear buds, small key to open SIM/SDcard tray, Operation manuals in several languages.The picture/display is outstanding. The camera has fun features and takes high quality pictures. Able to run multiple apps with ease, and in split-screen mode. Very nice speakers, much louder than my S5","rating":5},{"id":"R10J41M4YTCIOJ","title":"Day one. Unboxed.","text":"Feel in love the second I opened the box. And it just keeps getting better. It's insanely fast. Beautiful display. The camera is ridiculous. It has enough processing power to function as a small computer and I look forward to getting the most out of this little powerhouse in the future. Glad I went with the international version, after reading about a difference in processors.","rating":5},{"id":"R11DZ4C781RFKN","title":"Would have been nice to know it before buying it","text":"The charger comes with the UK Plug. Would have been nice to know it before buying it.","rating":3},{"id":"RBH6V3RXWH983","title":"It's a bad idea to buy the phone","text":"It's a bad idea to buy the phone. No wifi-calling option in the phone settings at all and I live in an area where network signal strength is low","rating":1},{"id":"R23H0C3US00RL2","title":"but all the information leaflets like the user manual","text":"I received the phone with all the accessories, but all the information leaflets like the user manual, guarantee, quick access and functions are in Italian language only, clearly the product is European associated with the Italian telephone line, I wish it had all the Brochures in English language. On the phone is neat, new, impeccable, I brought it to venezuela and it works perfectly with the telephone lines here, everything works perfectly and I'm really satisfied with the purchase, download the language packages that correspond to me like Spanish and English and now If I'm enjoying my equipment 100%","rating":5},{"id":"R3MAHGS29OCX4A","title":"Works excellent on Cricket","text":"Works excellent on Cricket. No issues, this is a truly unlocked phone. Had purchased a so called unlocked phone from a retail store that calls it self the Best to Buy at. They even had displayed signs saying \"Free to choose\". Except after paying more then $800 I found out freedom came after paying another $300 over a 6 month period, to Ole Ma-Bell. Then they would provide me an unlock code for my \"unlocked\" phone.If you're looking for a unlocked that's really, buy it here.","rating":5},{"id":"R237SO4NMCDW0G","title":"The build quality is excellent, on par with Apples external build quality","text":"The build quality is excellent, on par with Apples external build quality.This devices edge design makes looking at the screen much more interesting, and less \"flat\". It is similar to looking into a slight bubble. The buttons are very tactile, and the fingerprint sensor and it's controlling software work well.Samsung's TouchWiz implementation on top of Android 6.0.1 raises no real complaint from me. I do not use their \"Edge UI\", but it can be fully disabled easily.","rating":5},{"id":"RPX9LQUJZ2JQT","title":"I really love this phone I am so glad that I got ...","text":"I really love this phone I am so glad that I got rid of my old phone the Galaxy Mega when I first purchased this phone and got it activated for Metro PCS if you are looking for a phone to get activated this is the phone for you.","rating":5},{"id":"R2GWJKPPSVP4W0","title":"Great phone with some not-so-great flaws.","text":"Phone is very sleek. it looks nice and it has a lot of things going for it.- Water Resistance- Amazing and Fast Camera- amazing screen- pretty fast charging- Good Battery- Fast Charging- Fingerprint Scannerand others.but for all of its pro's it has a few Big Faults. The big one for me was how hot the phone got. For just using google Maps, to even playing Pokemon go for a little bit in the park, the phone got so hot I could barely hold on to it. I couldn't even imagine using this with a case on it might melt. Then when the phone detects that it gets too hot then it makes that big beautiful display lowers it brightness to where I can not see in the daylight anymore. I am having a lot of issue with it in the Sun.I have heard of these issues with other Samsung phones. Maybe its just the ones with this certain processor, I am unsure if the SnapDragon ones have this issues but the reason I got the international is that it could go to any carrier more or less and I could get the added performance of the Exynos Processor. Turns out it was a bad idea and the phone got so unreasonably hot that I could barely hold on to it. The phone also got noticeably slower as it got hotter. Probably because the processor was limiting itself.Maybe this could be fixed with a software update but I think this is more of a hardware issue. Maybe I just got unlucky and got a defective phone as i don't see many other people mentioning these problems. I do not blame Samsung or have any bad feelings for them. I just got unlucky with my device and will be returning it to Amazon.","rating":2},{"id":"RJUODDZJEWGN8","title":"Five Stars","text":"Argentina ok!!! 😉","rating":5},{"id":"R2J1OZWNCYE3MA","title":"This is definitely the way to buy a cell phone.","text":"I will never again buy a phone through a cell service provider. Buying unlocked through Amazon or some other reputable source saves you about 20%, and here's the really great part: no bloatware! Be careful to ensure that the phone will work with your service provider, but if it will this is the way to go without a doubt.","rating":5},{"id":"R1FFANIU7I3SPA","title":"Never Again...","text":"Do not trust this provider. I payed for a brand new S7 Edge and I ended up recieving a S6 Edge along with a charger that looks like it's been through a war in some third world country","rating":1},{"id":"R2Q1TWOT4RR4BW","title":"One Star","text":"Recieved it with hardware issue. Touch doesnt just work...as its international phone, samsung wont fix it...","rating":1},{"id":"R39WSD1PMB39B5","title":"Super Phone a Samsung Phone","text":"Awesome phone, great build quality, very slim, i had a samsung galaxy S3 before, and that phone last like 8 months, hate it samsung for their build quality, since then i've been trying another brands, so i decided to give samsung another try and guess what i love this phone, my only complain is the battery it doesn't last long like the iphone 6s plus, it has one of the best AMOLED screen i have ever seen the color are very bright and clear so if you want a phone buy this one you'll not regret it.","rating":5},{"id":"R2I2I9A8R2YIO2","title":"Love the phone but there are issues","text":"I didn't like the fact that the phone came with a charger that can't be used because it doesn't have the prongs for this country and all instructions were in another language","rating":1},{"id":"ROTL2TM0D688Z","title":"One Star","text":"It was a fake one","rating":1},{"id":"RSFVA2AFL6TC1","title":"Five Stars","text":"Grate and easy to use","rating":5},{"id":"R1A4M0O7XW7N9Y","title":"One Star","text":"This is a defective item","rating":1},{"id":"R2ETKQ0LIY0SHN","title":"One Star","text":"BAD SOFTWARE REBBOTS ALL TIME WANT MY MONEY BACK I WANT A REFUND","rating":1},{"id":"R1MASWRB11XPNV","title":"Five Stars","text":"A++ HAPPY WITH THE PURCHASE","rating":5},{"id":"R1P5TUJ0FB09Q6","title":"Be careful! Phone box seal is broken","text":"Phone box Seal was broken. Fortunately, i noticed and returned it.","rating":1},{"id":"RUC0M3J7C8EKI","title":"Five Stars","text":"Love it, everything nice","rating":5},{"id":"RH2QEWA97K4MA","title":"Dead Pixel Line on Screen","text":"The seller was good. They send me a sealed box. The problem is the phone. I bought it to use in Argentina. When I opened the phone in Argentina there was a pink line on the screen. It's a full pixel dead line across the screen. Y search on internet and it is a common problem with the edge phones and the solution is a new module/screen. There is no guaranty for me here.","rating":1},{"id":"R2GX7PAOI5B1L4","title":"... gift for my husband and he is totally in love with his phone","text":"It was a gift for my husband and he is totally in love with his phone.","rating":5},{"id":"R1JT162FGGO6L4","title":"Beauty","text":"Yes. sick lookin phone. I saw couple of feedback that says fake phone or something fishy. In my case it was all good. And about the phone it's great! Nothing much added to s7 accept hardware improvement. Touch unlock is much much better then s6 generation. Great bettary life something aspect from Samsung. Not dissopointed at all.","rating":5},{"id":"R26J3GMGYXKSE1","title":"Not a huge step up from the Galaxy 6","text":"The features are OK, but it's not a great value. Not a huge step up from the Galaxy 6. If you have a Galaxy 6 edge and are looking to upgrade, hold off on this one. It's not groundbreaking stuff. More of the same.","rating":4},{"id":"R1TTOR1M45Q5MJ","title":"After one year now I bought this phone and still ...","text":"After one year now I bought this phone and still working as the first time. Is fast, is functional and is gourgeus.","rating":5},{"id":"R10S9GNG4P8D5Y","title":"I'm glad I made the right choice","text":"Buying an unlocked phone for use in another country can be full of doubts. I'm glad I made the right choice! My main concern was if this phone - G935F will work in India since it's being marketed as region specific as well as universal unlocked version. In comparison, G935FD is not region specific. My questions were answered on the forum and the phone - G935F works just perfect in India!Thank you for a great product and a great service!!","rating":5},{"id":"R19ZT0EQ8N9EDG","title":"The phone is great. Although the only thing I dislike is the ...","text":"The phone is great. Although the only thing I dislike is the edge screen if we compare it with the S6. Even with a case, my hand sometimes touches the screen, making it scroll or click unintentionally. Apart from that, it's a great phone. Some day I will also test the water resistant function. wish me luck :)","rating":5},{"id":"R1GDCOUWWIAHGP","title":"it is excellent phone. have not see him having any issues ...","text":"I bought it for my son for christmas and he absouletely loves it and he spends hours on his new cell phone and I am so jealous with green. now I want to buy one for myself. it is excellent phone. have not see him having any issues with it at all. so happy that he is loving it and me turning green with envy...","rating":5},{"id":"R3K13IDK7GWYQ0","title":"The Samsung Galaxy s7 edge is a great phone. It was easy to transfer my info ...","text":"The Samsung Galaxy s7 edge is a great phone. It was easy to transfer my info from  my old phone to the new one. Love the low-light camera. I'm really happy with my new phone.","rating":5},{"id":"R10NI804533L7U","title":"The phone is amazing. Looks beautiful and feels right in my hands","text":"The phone is amazing. Looks beautiful and feels right in my hands. Perfect weight and perfect size. Phone works smoothly with no problems but some apps that my s5 were able to use, my s7 is apparently incompatible with. Also I cannot connect my ps4 controller threw blue tooth on my s7 but was able to on my s5.","rating":4},{"id":"R1PL92HRCSCH77","title":"Hi guys, I am using my new Galaxy S7 ...","text":"Hi guys, I am using my new Galaxy S7 Edge about 1 1/2 month, and your charger stop working, this device have some kind of warranty? i am currently living in Ecuador.Regards.","rating":4},{"id":"R10HTDCY41VR9V","title":"Three Stars","text":"nice product, easy to use, but both front and back crack very easily.","rating":3},{"id":"R3O7KFIOEEGI8K","title":"NO Samsung Pay","text":"I really like the phone, but nobody mentioned that Samsung Pay does not work with this, the international version - I had to call Samsung Support to find that out.. disappointed and send it back for that reason...","rating":3},{"id":"R2Z4WHTIXWFJWZ","title":"Best Phone currently on the Market - Includes International Version Details","text":"I bought the Samsung Galaxy S7 Edge G935F in Black from this product page a week ago.A lot of people have asked questions about this particular international version so I'll answer some of those first. For starters, the one I got was the english edition for the Saudi Arabia market (see attached photos, the guides came in english and arabic). From what I can tell, the phone is the same as any other international edition but with different preinstalled apps. Mine came with a SA region specific app \"Shaid\" (seems to be a YouTube-esque app in arabic) that I uninstalled and WhatsApp. Other than that the only remaining bloatware was stock Samsung apps (no carrier apps, thank god), the only other thing I noticed that may be region specific is the S Planner app has a \"Hijri dates adjustment\" setting. Lastly this version ships with a non-us wall charger (aside from the regular stock accessories) shown in my review images. Mine also came with an adapter for use within the U.S., I have tried it and can confirm that it works with fast charging.This phone also uses a different chipset (manufactured by Samsung, called Exynos 8890) than the U.S. version. Reviews I read noted that the phone was actually optimized for this chipset w/ better performance and battery life than the U.S. Qualcomm counterpart (Google it). In the U.S. version the Qualcomm Snapdragon 820 chip is used to support Verizon and Sprint customers whereas this version only supports GSM carriers.To preface the review of the actual use of the phone, I have owned the following devices and used them each as a daily driver for at least a months time: Samsung Galaxy S4 GPE, Samsung Galaxy S5, iPhone 4, iPhone 4S, HTC One M8 GPE, iPhone 6, iPhone 6S, Nexus 5, Nexus 5X, Nexus 6P. The Galaxy S7 Edge has been the most delightful experience of the bunch. I won't go into great detail here but the camera is phenomenal and launches faster than any other phone I've owned w/ a double tap of the home button. The camera's auto focus is super fast and I feel like I'm able to get a capture a lot of moments that my previous phones were too slow to shoot. It's also nice to be able to change the quick launch apps on the lock screen, I have the dialer and snapchat as mine.Continuing a theme of high performance this phone is incredibly fast despite powering a QHD resolution screen. Apps are surprisingly quick to load and multitasking is a breeze (I even found some use in the Samsung's split screen feature). The fingerprint scanner is on par with apple devices (and nexus 6p/5x) although because of it's non-circular shape I find that I place my finger the wrong way more often. The battery is the best of any device I've used as a daily driver, I've been able to get through days of heavy usage like today (unplugged from charger at 5:45am, now at 25% at 9:03pm).The screen is BEAUTIFUL. Not only is it easy to read even in direct sunlight (something I have seen other devices struggle with) but the colors are vibrant and the screen is huge without making the phone too big or bulky. Perfect for watching YouTube videos and browsing instagram.Lastly a few notes if you buy this phone:- If you're not a fan of the stock Samsung launcher you can get the Google Now launcher from the Play Store, it's the same one used on Nexus devices and feels smoother than Samsung's launcher.- This time around Samsung decided to give you bigger icons which drove me nuts, search for \"Get more on your Galaxy S7, S6 or Note 5 screen with hidden DPI scaling settings\" from Android authority to get a 5th column on the home screen and smaller UI elements.- \"Edge functionality\" is just okay. The feature feels a bit less than polished because of the weak offerings in the Samsung app store - I have it turned off.Edit 4/8/2016: sorry about the quality of the photos of the actual phone - they were shot with the wide angle lens of my GoPro whereas the other images were shot with the S7 Edge.Edit 4/10/2016: added some higher quality images from my new camera.Update 5/9/2016: I've been using the phone as a daily driver for over a month now. I'm still impressed by the overall gfx smoothness, how fast apps load, and camera performance.Update 7/25/2016: still in love with this phone. I'm honestly not sure what would compel me to purchase a new phone at this point.. I also rooted the phone and changed the emojis to the iOS 9 set with the Emoji Switcher app from the play store. No more guessing when messaging my iOS friends =)A lot of commenters have asked which seller I purchased mine from: Wireless Everything.","rating":5},{"id":"RMKOOXTFS1RIR","title":"Fine Print Fiasco","text":"I purchased this phone for the expressed purpose of developing VR projects for Gear VR and Google Cardboard. I never expected or intended to use the phone features of the device. So I never added a SIM card much less carried it around or away from my office. After a couple of weeks the OS seemed to have crapped out and got itself stuck on some green terminal looking boot screen. Despite all my attempts to force a restart, perform a system restore, drain/charge the battery or whatever Android lets you do by holding in button X while closing one eye and whistling a happy tune, the phone just won't get past that Bootloader exception screen.I'm not an Android guy and since the purpose of the phone was to test apps, the device was required to be as close to stock as possible to adequately replicate the experience someone might have on their own device. By that I mean I didn't \"root\" the phone or mess with the OS beyond letting Android run all those auto updates it seems to do on a daily basis.I contacted Samsung US support and they said my phone didn't exist as far as they were concerned because it was obviously an international device. They told me to determine the country of origin and arrange service there.How convenient.I looked for some type of local resource that can service phones but it appears all that can be done are screen or battery replacements. Anything heavier has to go to the manufacturer...in Spain...or Antartica...or the Moon.I contacted the Amazon Marketplace vendor (Mobiles International LLC) that I purchased the phone from and they we nice enough in their correspondence and said:\"Unfortunately Samsung does not provide warranty service on international unlocked phones. If you sent it to us in Miami, we can get a quote from a Samsung authorized service center to get the phone repaired. It looks like a software issue and should be fixable.\"I FedEx'd them the phone and waited and waited. After two weeks or so I sent them an email wondering if there was any update.\"At this time we have not received a quote unfortunately, the Samsung repair center here cannot repair your device because it is not Latin. We have one other option that we are trying. We will contact you as soon as we get a response.\"And waited and waited...till about a month and half had passed and got this:\"We received the unit back from Samsung this week. They returned the unit saying the warranty was void. We have shipped back to your address yesterday.\"Huh? Is Samsung saying that I dropped it in a toilet? Or that I used my considerable phone hacking skills to circumvent their awesome software and install my own custom OS? No idea.So the lesson being, read the fine print. International unlocked phones may or may NOT come with a warranty. And even if you work yourself past that little detail and decide to roll the dice...if something goes wrong with your device there appears to be no recourse to have it repaired.Even if you expect to pay for said repair because the assumption being that a repair would cost less than the cost of a new phone there doesn't seem to be any reasonable way to facilitate getting it fixed. Waiting weeks and weeks to get some vague note about the warranty being void is hardly a workable solution.","rating":1},{"id":"R3GZW4XSNTLYAG","title":"Hello, 3 weeks ago a vertical line apeared in ...","text":"Hello, 3 weeks ago a vertical line apeared in the screen of the Celphone.I live in Argentina, What can I do?Pls see attached photo","rating":3},{"id":"RUYFPJ1DVMVN0","title":"I regret getting this phone!!!!","text":"Getting a green screen (or even purple )every now and then till it completely stay like that forever is a common problem for S7 edge. I really regret getting this phone as I thought that it was going to be great as my old S5 ! The worse thing here is that it is not under the US warranty so they have to verify where does it belong to in order to contact them as the sellier will just reply to your question with only  \"contact Samsung for the warranty\" !!!!.  After the valedation process they told me to contact Samsung South Africa which I have been trying to get in touch with their product support team without any success for a week now!","rating":1},{"id":"RUTLAGWZ4QVKO","title":"I love this phone it was unlocked as stated","text":"I love this phone it was unlocked as stated. I was very sceptical to order this phone due to all the negative feedback backs. It is authentic 100% Samsung s7 edge. I would recommend buying this phone. Only downside the charger needed a adapter so I'm using the USB cord alone with  my old charger head.","rating":4},{"id":"R17DYCX4XPKWU9","title":"... after few weeks of using this phone - + nice phone, nice features","text":"I am writing this response after few weeks of using this phone -+ nice phone, nice features, received on time- have a visible dark spot in the display (top right corner). Also, have a white horizontal line at the top side of the display. And, the screen flickers as well.  I was really disappointed with that and was thinking to return the phone back. :-( Then decided to keep the phone with me as it is my first Samsung Galaxy phone and didn't want to go with the hassles to return the phone. Instead writing this review. As soon I got the phone I realized that they knew what they were sending.Lessons Learnt - Buy an expensive product directly from a showroom, instead of buying it from Online with such strict return policy.","rating":3},{"id":"R3VQI9LOF82MXT","title":"Got mine  from Gotham's Cells","text":"Samsung Galaxy S7 Edge  Factory Unlocked Phone 32 GB International Version (Black Onyx)Not sure if this makes a difference but I got mine from Gotham's Cells.First off I wanna say, I really wish Amazon would let us pick our delivery company. Every time it comes with USPS there's always issues.But whatever, I open the box and see that everything was in a plastic bag. I noticed that there's a plug converter so I knew that my phone didn't have a normal plug. I was hoping I would get one, because some of the questions and reviews I read made it seem like they send you the right plug depending where you live. Maybe I just misunderstood, or it's the company I bought it from. I thought it was really nice for them to provide a converter even though I was planning on buying a new plug if it didn't come with the right one. Sadly the one that was sent to me doesn't work.My box was sealed so I was happy about that. But when I check the back it's all scratched up, even when I remove the plastic protector thing. I tried wiping it down and some of the smudges came off but not the scratches.I checked multiple ways to make sure mine wasn't fake, so if it is it's a good fake.All the paper guides and such were in another language sadly.Other than that, I'm happy so far. I'll update if anything else happens.","rating":3},{"id":"R1VHSTP5RX3DGT","title":"S7 edge. 3 months old dead.","text":"Bought Samsung Galaxy S7 Edge from Wireless everything, The phone worked perfect for 3 months than it started to hang. The phone was not rooted or damaged in any form. Probably a defective phone that was resold by the store. Wireless anything wont't accept any responsibility so as Amazon.Won't be buying from the store in the future and surly not recommend buying from Wireless Everything.","rating":1},{"id":"RHP9J5UJ2T42","title":"Its a great phone but id recommend buying at a store with ...","text":"Its a great phone but id recommend buying at a store with warranty. bought mine back in august has a screen issue where you see black lines. like a fog. manufacture issue there. it can happen at any time and mine happened in less then a half year","rating":3},{"id":"R3I8XMKIENHSDP","title":"WORST PRODUCT EVER!","text":"Worst product EVER!!!!!!!!! Less than six (6) months after purchase the phone malfunctioned - restarting repeatedly on its own until finally becoming non-responsive with a blue indicator light. DO NOT PURCHASE THIS ITEM.","rating":1},{"id":"R3UWZKOFKOSCUH","title":"Just terrible experience with this","text":"Just terrible experience with this. In a couple of months USB slot stopped working, so I could only charge it wirelessly. Then the device started warming up sometimes to a point it was difficult to hold it in your hand, and then going into restart cycles. I contacted the seller and was told they only provide 30 days return policy, which is reasonable. What I was shocked about is when I contacted Samsung support I was told they can't help me with an international version and I have to contact the seller. They basically refused to be liable for the product they manufactured. I had to buy another phone and have a useless piece of technology worth $600 at home, don't know what to do with it. Will probably have to throw it away eventually. The repair shops say to get to the USB slot they have to remove the screen which according to Samsung manual can't be removed without damaging it, so they give me 50/50 chance they can remove it without cracking. But since now it's completely unusable may be I could give it a try.","rating":1},{"id":"R3JY0I367AJEYK","title":"Came with broken seal, all ok.","text":"The seal was broken. The phone was completely fine, and it is the original phone. Other than that, all as is to be expected - great product!","rating":4},{"id":"R31P2EQ4DYACXX","title":"Arrived on time and in perfect condition works perfect and very fast loading file and ...","text":"Arrived on time and in perfect condition works perfect and very fast loading file and surfing,one of the best phones I have brought and will recommend to everyone","rating":5},{"id":"RBYNXU2J6W4FY","title":"Awesome","text":"Great phone especially with exynos processor. Great battery life, really fast, great screen and works perfect on at&t","rating":5},{"id":"R3LQWL8J25ZLKL","title":"Five Stars","text":"Switched from iPhone to this phone. After 1 week...No regrets.","rating":5},{"id":"R38DPOBGSI6LLD","title":"Phone stopped working within 6 months and I've had a ...","text":"Phone stopped working within 6 months and I've had a very hard time trying to activate my warranty or reach someone to discuss how to get my phone fixed. Don't buy this phone if manufactured in Vietnam!!","rating":1},{"id":"R1CXBQLUNB3HMD","title":"Seal was broken,,, and cheap packet, ...","text":"Seal was broken ,,, and cheap packet,,, other than  that phone is Ok,,","rating":4},{"id":"R2H16C8RTDIMAF","title":"Five Stars","text":"all according to expectations","rating":5},{"id":"R2ARHCTQ1GZKKB","title":"The best phone i have ever used","text":"I moved from ios to android and i felt like coming back home. Phone display , camera clarity amazing. Gold colour looks superb. Iphone 6 was so borning  and this phone feels very exciting. Price was also good for unlocked international verson. Battary easily works for day and half with moderate data usage throught day","rating":5},{"id":"R2V4N0M4UCC8SW","title":"Phone works fine. My previous phone was a Samsung 5 but ...","text":"package was sent with the warranty seal opened however the seller clarified the reason of that. Phone works fine.My previous phone was a Samsung 5 but this one is amazing.","rating":4}]