[{"id":"R2S93PR9NF9CL8","title":"Good laptop","text":"I just got my zenbook and I was expecting to have finger print reader. In the description it says there is finger print reader but don't have one right now but other than that everything is perfect","rating":3},{"id":"R2U6ZEUVZ0QJCW","title":"Received laptop on December 20, 2016 and the screen ...","text":"Received laptop on December 20, 2016 and the screen malfunctioned immediately. Had to return the laptop to Asus for replacement. Sent it out on the December 22, 2016 and just received it back today January 17, 2017. Have not opened it yet to see if it is working but I really hope that it does.","rating":1},{"id":"R1KW2DDNC9EUVS","title":"Wrong Power Plug !","text":"The laptop arrived sooner than I expected.  A bonus.  However the power plug was the original US plug.  Not AUSTRALIAN plug.  Not good enough !  Other than the plug not being of the correct country (or continent !), the laptop works fine.","rating":1},{"id":"R2DHX3VLDLSIKQ","title":"There was dead pixel on the screen. I had ...","text":"There was dead pixel on the screen. I had to return and didn't order again because I couldn't risk receiving another damaged product!","rating":1},{"id":"RECJZ61NDZ8GN","title":"Three Stars","text":"It is ok","rating":3},{"id":"R2A6YCOEL3DQYN","title":"the screen is really nice, and it's light","text":"I replaced my previous, 8-year-old Asus with this laptop (which I LOVED). I would not purchase this computer again and, in fact, wish I had returned it. Yes, the screen is really nice, and it's light, and sharp, and has all the aesthetics you'd want in a new laptop. At the end of the day, the viewing angle of this laptop is terrible. The screen does not tilt back far enough to use this well on your lap, unless you are sitting with you legs straight out in front of you. If you like to use your laptop while having your legs propped up on an ottoman or coffee table, chances are pretty good that the screen will be pointing \"downward\" more than you'd like, making it hard to see. I have to modify how I sit in order to use this laptop (as I'm doing now), and it's really annoying. There really is no reason for Asus to have done this -- it's just inconvenient. If you are only going to be using this laptop at a table or desk, then buy this laptop -- it's otherwise great. But if you like to sit with it on a couch or in a chair, it's borderline nonfunctional. Not what I expect from a laptop. I am disappointed with this aspect of the laptop to the point that I would NOT recommend it.","rating":3},{"id":"R2DR6HKD85PBZG","title":"Faulty power cord or power port- just this one or others?","text":"Not sure if it is just this one but either the power cord did not work or the port to the power cord did not work and I had to return it. I am ordering another one however and am hoping it was just this one!","rating":2},{"id":"R35KXVM8JA71SB","title":"Four Stars","text":"Good","rating":4},{"id":"R1FNJH1YFBKWIC","title":"Screen is dim and noisy fan.","text":"You may like the design and finger sensor but the screen is really disappointing so is the fan noise which starts without even giving any task.","rating":3},{"id":"R2ZNCEPKQDAP3N","title":"One mechanical problem.  And one design problem.","text":"As a machine its fine. Light and quiet. But have 2 issues.Since day 1 - the screen has a tendency to dim down - then after a short time maybe 30 seconds or longer or maybe not at all - the screen will brighten back to where it was for a short time.  This is Very Annoying!!!  You tell me. Is this a design problem? or is this a defect?My other issue is in the layout of the keyboard function Fn- Volume Control.  Because Volume  control is F10 (mute) F11 (Down) & F12 (Up) -And the Fn Function key is in the far lower left... It takes 2 hands to quickly adjust the audio volume or mute.  I use the computer a lot for audio and sometime a web page loads with huge sound.  It would be nice to have the physical volume control option laid out easier to adjust.","rating":2},{"id":"R3C074YL4N8IBU","title":"My son was super excited about his first own laptop","text":"Ordered and received ASUS UX330UA today for my son's birthday.  My son was super excited about his first own laptop.  However, the computer screen turned black and would not boot up before we even completed the set up.  Called the ASUS tech support and tried several different ways to solve it but was not able to.  Then the Tech Support confirmed that it must be the software problems and recommended us to return it.","rating":1},{"id":"R3C8A082COJ896","title":"No backlit keyboard/fingerprint function","text":"I am giving it 4 stars which I will upgrade or downgrade once I receive it. It is scheduled for delivery this Friday  (1/13 2017). I have just spent several hours going through the questions and answers and found (which I should have confirmed before ordering) that it does not have a backlit keyboard. I am very disappointed by this and might not have ordered it had I known this. Hoping those who have and love this laptop will assure me this won't be an issue. BTW, I don't use my laptops in dark conditions. Still very excited about getting it. UPDATE 3/14/17: I really enjoy using this laptop except for one thing: I cannot get the fingerprint reader to recognize my fingerprint. I reset it several times also using the 2nd finger option. I've followed the instructions as well as I can. Any advice would be appreciated.","rating":4},{"id":"R3KI8X2I2G1JIE","title":"It is a great lightweight computer with solid state drive and good battery ...","text":"It is a great lightweight computer with solid state drive and good battery life. The only downside is it is not a touch screen.","rating":3},{"id":"R1U6K9D3BRCA32","title":"Two Stars","text":"Freeze so often.","rating":2},{"id":"R5CK5YQDVCQX","title":"NEVER BUY ASUS LAPTOPS","text":"I used to be an asus fan I really did. The ROG 17.3 inch gaming laptop was my first one and I used it heavily for years and loved it.That being said not anymore not after getting a cheap netbook for back to school use whos performance was so terrible that after a few months I had to resort to purchasing this laptop. Of course though I get a faulty one, like MANY others whos laptop just continually restarts over and over in an endless boot cycle while trying to do the first initialization set up. Nothing nada I got to look at it and touch it for about 45 seconds before this happened and I knew right away I was screwed. If I could give this crap 0/5 stars I would. DO NOT BUY IT.","rating":1},{"id":"R3HD34TKCE75AH","title":"DEAD ON ARRIVAL ZENBOOK","text":"My ASUS Zenbook UX330UA-AH54 was DOA. (There was no physical damage to the packaging or computer.)I turned on the laptop and started putting in the very first few screens' info: language preferred, time zone, etc. and the screen went completely black. After trying several times with the same result, I called ASUS technical service. It was somewhere in the Caribbean area. I had some trouble understanding the person, and it took them at least three minutes of back and forth to get my name correct. I spelled it phonetically at least ten times before he got it right.He had me power the unit down, then unplug the power adapter, and try again. I never got past the third or fourth screen before the screen went black, the unit rebooted, and I was presented the very first screen yet again (the one with my country and time zone). In other words, the same thing that was happening before I called.I am sending it back with an RMA, but had ordered it prior to a trip using Amazon Prime so I’d have it for the trip. No way, Jose.If and when I get a fully-functioning Zenbook back (mine, or more likely a replacement) it will be on probation. If it even looks at me crooked in the first three months (warranty period) I'll send it back for a refund.","rating":1},{"id":"R3IJ4MIF2VATPF","title":"the option of using a code is fine since I would rather be safe than sorry","text":"This has been such a successful purchase for me as a business. I wanted a lightweight ultrabook since I need to transport it back and forth between two offices  I primarily use it for Quickbooks Pro.  So far, I haven't had any issues with it other than the inconsistent recognition of my fingerprint even if my finger is clean.  I would think in four attempts and four different finger placements, it would be more consistent in recognizing it.  However, the option of using a code is fine since I would rather be safe than sorry.  My one and only issue with it -- and maybe I'm missing something -- is just opening it.  I am afraid to scratch the surface, but I have to pry it open with my fingernails.  I don't have a little \"edge\" where I can lift up the top easily, etc.  Other than that, I am very pleased with this!","rating":4},{"id":"R2M7A8ZZ96Y9WF","title":"Best laptop for the price","text":"The laptop is beautiful, It has a very durable built. The aluminum finish on the laptop looks amazing.Screen: the screen is very bright. It is really bright even at 50% brightness level. The anti glare is excellent because it does not reflect anything. It is a 1080P screen. It has great viewing angle.Track pad: this is one of thr best track pad I ever used. It is a glass trackpad that's why it is very smooth and precise.the fingerprint reader is fast and very responsive, it never failed to respond to my finger.Keyboard: I feel very comfortable using this keyboards. You can even use the keyboard in the dark  because it is backlit and looks amazing. If you want your screen to be super bright just click on fn and A. You can adjust the brightness level of the keyboard or turn the feature off to save battery.Speaker: the speakers sound pretty good, that's exactly what I need in a laptop speaker, Asus did a really great job by collaborating with Harman kardon to deliver those amazing laptop speakers to the customers.Performance: the 7th generation i5 processor in this laptop is super fast, As an Engineering Student, the laptop helps me makes all my computation really fast without any hiccup.The SSD is also fast.The fan noise is not even a problem because it doesn't do it often.Battery: the battery last forever, Asus did an excellent job in that area. You can watch videos for at least 10 hours. You can do web surfing for 11 hours.Conclusion: That's a premium laptop for  the price. Every student should buy this laptop because it looks beautiful,it performs amazingly and you get more for what you pay .The laptop looks more expensive than its actual price. Because of the amazing job Asus did in making this laptop,  I will always buy Asus products in the future.the Company earns my trust because of that laptop.","rating":5},{"id":"R3HYT7PXQQGS2O","title":"Light and fast!","text":"So far so good for me, I am a little scared of the other reviews though. However my zenbook does not have any problems yet. Battery life is excellent and the overall experience has been great! Touchpad could be better but it works. The laptop is fast! Backlit keyboad is so awesome!In terms of gaming, skyrim runs but its laggy. Fallout 3 runs fine on medium to low settings. Not bad for a school computer!","rating":5},{"id":"R1LO82LZ91J051","title":"Incredible battery life in a sweet form factor","text":"So far I really love this little machine. The battery just lasts and lasts, the performance is excellent, it's incredibly thin and light, and the ergonomics are excellent. Wakes up from hibernation in just a few seconds. The HDMI port isn't full-sized, so I bought an adapter, which should work fine. I like the backlit keyboard, and that you can easily adjust the brightness of it. I love the fingerprint reader for authentication, and the fact you can turn on/off the touchpad with a single keystroke, if you're using a mouse. Just a lovely machine.","rating":5},{"id":"R1SXNR1YOULLW7","title":"Money well spent","text":"I have not been this excited about a computer in a long time.  This little darling was delivered yesterday.  Yesterday evening, I began configuring the system.  It booted up super fast thanks to the SSD drive.The system runs very quiet -- I had read about other people's noisy fan issues.  It installs software quickly and is running very efficiently.I like the weight of the unit (just under 3 pounds) and the sturdy build as well.All in all, at this very initial stage, I say that it is money well spent. Thank you, ASUS!--------------------------------------------------------AFTER SOME TIME WITH THE SYSTEM:My initial impressions are still accurate.  This little tyke really does what I wanted it to do.  It boots up very fast and is very quiet thanks to the SSD drive.  One of the earlier problems I did have with it was something that I saw others had issues with as well:  fingerprint recognition.  Well, I went on line and did a search for ASUS ZenBook fingerprint ID and found something that, quite frankly, I hadn't thought of in my initial problems.  There were a couple of postings suggesting that I use a different finger.  Sure enough, when I used another finger that was not as scraped up as my index finger, the computer recognizes the print on the first try.  Before, I would have to end up entering my PIN because my finger failed out.  Trial and error.  :-)Other than that, the computer has installed all the programs that I wanted to have on it and there have been no issues running any of them.  The installs went very fast.The wireless works extremely well.  It finds anything that is available and connects without a problem.I am still very impressed with this ZenBook and look forward to taking it on vacation with me at the end of April.  I want to see how well it catches the wireless signal on the ship I will be on.  One of the biggest reasons I purchased this computer was for its weight -- or lack thereof -- when traveling.Thank you, ASUS, for such a quality product!","rating":5},{"id":"RN2D7HLG1SN70","title":"Performance, value, and beauty","text":"Truly great looking laptop.  I was a little worried about the fan noise from other reviews.  It is not an issue at all.  It kicks on once and a while, but is off most of the time, and is very quiet even when it is running.  I think Asus made the right move in using the faster core i processors in these latest zenbooks.I also had concerns about fingerprint reader based on other reviews.  It has worked flawlessly for me so far for login to windows.  I set up my wife and it works great for her too.Extremely happy with this laptop after 1 week.","rating":5},{"id":"R3S9XU4T90V81C","title":"Great performance, sleek design, best value in its class.","text":"Fast, peppy, easy to type, and everything works flawlessly!It's the best value for an ultra-portable 13.3\", newest processor, and SSD.  Compare to HP and Dell and it's almost half the price without sacrificing performance.  So glad I pulled the switch on this.","rating":5},{"id":"R3KQMOBKX9K461","title":"Excellent Computer - Super Low Price!","text":"This computer is great - I waited a couple months before writing this review, but now I can surely say that I do love it.The battery is amazing. Coming from a laptop that could barely hold a charge for 2 hours, it is amazing to be able to use this all day and barely have less than half my battery left. I use it for lighter tasks during the day - web surfing, word processing, etc.It is powerful. I have mine hooked up to an external dock when I am at my desk at home - there is no lag, issue, or even heat when I am using two screens and a bunch of extra peripherals. When used on its own, just as fast. The i5 is snappy, and noticeably so, and the 8 GB of RAM is more than enough to handle any of the computing needs I have. 256 GB SSD is more than enough to hold everything you need on the go,. Windows 10 runs flawlessly, and the wifi is quick and responsive. Screen is great too - doesnt burn your eyes like the MacBook retina displays do, rather, this screen is soft to look at and shows colors vibrantly.It is so small and light!!! It is smaller, thinner, and lighter than my chromebook, so much that I actually got rid of my chromebook and now exclusively use this. Keyboard is excellent: it is a full keyboard with responsive keys. I am an aggressive typer, but the keys and the laptop handle it well.Finally, it is pretty. Way better looking than any of my friends Macs. The only nicer looking computer I have seen is the ASUS Zenbook 3, with its royal blue and gold. Fingerprint sensor makes other laptop users jealous. This is probably the best computer $700 could buy. 4 months later and still no issues. Have always been an ASUS customer and will definitely continue to be an ASUS customer!","rating":5},{"id":"R2WTZPRU2JI7FB","title":"Love 'em. Had a few minor technical problems over ...","text":"5th Zenbook I've purchased. Love 'em. Had a few minor technical problems over the years, but the ergonomics, keyboard and mouse, screen, weight etc are all fantastic if you're in businesses management or sales, and a Windows user.","rating":5},{"id":"R1RVLGQ7JQAQ3T","title":"<3 UX330","text":"I love this laptop. I recommend it for any college student that wants a fast and portable laptop.","rating":5},{"id":"R14247WGSV3IT6","title":"Hubby says it is great","text":"Great little laptop as expected for the Asus brand. I bought it for my hubby. We can't afford a Macbook Air and this is a great alternative. As an IT guy he brings his laptop everywhere and he loves the portability of it. He loves that it is so lightweight yet it is robust and well made. Quality construction. I recommend this for anyone wanting a light laptop.","rating":5},{"id":"R3OWJR1KMR8VX6","title":"The answer my friend is blowing in my laptop","text":"What?! Sorry what are you saying? I can't hear you over this fan that has been running at 100% since the first time this laptop booted up. Really, wanted to love this laptop but it's unbearable to even have on in the room next to me. Touchpad is a little wonky but I may just have to mess with the sensitivity. Otherwise the speakers are pretty decent, screen is nice for this price, and keyboard gets the job done. I'm going to wait until ASUS tech support gets back to me on this fan issue but more than likely this will be going back.","rating":2},{"id":"R3HQWDKCOY4U67","title":"Sour lemon taste","text":"I got a lemon but I liked the form factor so much I'm trying again. Mine had ghosting burn-in images on the screen. Background and websites. Updated drivers and reset was no cure. I hope my second one will be better , but I will update. Amazon customer service is second to none. They really helped me to get a replacement.....UPDATE - Got my new unit and it it fantastic. Great screen, battery, and so thin and light.Speakers are just okay but it is a tiny pc, and I use BT most of the time. Fingerprint reader is janky I have my left finger secured but my right still does not work. Great carry/travel laptop so far. Will update. New screen is 4th pic. GLTA","rating":1},{"id":"R389PAZQLUC8AE","title":"its light and beautiful! Fingerprint sensor works like a rocket","text":"Its fast, its light and beautiful! Fingerprint sensor works like a rocket. Very impressive boot time! Totally satisfied with my purchase.","rating":5},{"id":"RRYBOXI6XU3S7","title":"Very reasonable price","text":"Very reasonable price for super light weight and decent battery life. Will update this review after a few months","rating":5},{"id":"R2U8VO6A4774I4","title":"Great for the price","text":"The model I ordered was the i5 7th Gen with 8gb memory. Great little laptop, I love the size and weight. I am giving this laptop a 4 star for two reasons. The first is that the laptop feels and looks cheap. For example, the front part, where you lay your wrists to type, always makes a clicking sound because the pieces that make up the bottom part of the laptop aren't held together with enough screws, so they rub on each other and emit an audible clicking sound. The second reason is because of the placement of the speakers. The speakers are located in the bottom front in a downward facing position which causes the sound to be muffled.","rating":4},{"id":"R1ZSD7Z1A6YXH2","title":"Meet My Wish","text":"I do like this notebook.Pretty cool as compared to the others.But, there's nothing (accessories) in the box beside a chager.","rating":5},{"id":"REF41BU4UB5ON","title":"Five Stars","text":"Exactly what I wanted and expected !","rating":5},{"id":"R13TK0N242OXQD","title":"Five Stars","text":"Good computer - ideal for those looking to match Macbook Air.","rating":5},{"id":"R35UUVIEXVT1LI","title":"I really love the laptop","text":"I really love the laptop.  The battery life, speed, and fingerprint technology are great.  Windows 10, however, has its defaults.  Three days in I received a failed update.  Contacted Microsoft, Asus updated wrong windows 10 build, Six hours later the situation is resolved.  What a pain in the a**.","rating":4},{"id":"RM13SMSDD7RHH","title":"good job Asus","text":"works like a charm. got it for my wife and she is very happy with it. Likes it better than the Dell XPS13 that she had till now. Looks very nice, can connect 2 external monitors (need an additional usb to video card for about $50).","rating":5},{"id":"R3HSBQRPFG0HRJ","title":"I'd feel a bit better about it if the hinge were stiffer","text":"This review is based on first impressions.  I'll update as time goes on.My Zenbook came with a Kaby Lake Core i5, 8 gigs RAM, 256 gig SSD, and 1080 HD screen.  I paid $680.Cons:The fan runs all the time.  You will probably see this noted in other reviews as well.  It's a very quiet fan -- hard to notice in a room with even a little bit of background noise -- but it's obvious in a quiet room.On mine, there is a gap between the screen and the rim of the bottom bezel.  It's not big enough to fit a fingernail into (so, probably less than 1 mm), but big enough for dust to accumulate, and it does not inspire a lot of trust in the build quality.Screen wobbles quite a bit if you bump it.  It's not a loose wobble (yet) but it's a bit disconcerting.  I'd feel a bit better about it if the hinge were stiffer.  I'm not sure how well this will hold up to repeated use.The screen is not very bright, even at full brightness.  My cheap, 4-year-old Dell is blinding in comparison.The \"delete\" key is not in the top, right corner where it belongs.  Instead, the power button is there and the \"delete\" is just to the left of it.  It takes a long-press of the power button to actually turn the computer off, but still.....  This will take some getting used to.Pros:Very thin and light!The keyboard is great.  The chiclet keys don't wobble in their spaces, and there is a slightly tacky feeling to the surface that keeps ones fingers in place.The trackpad works well.  Some have complained that it is not Microsoft-Precision-grade, but it's still very responsive.  It's leaps and bounds better than anything you'll find in any comparably priced laptop.The speakers sound nice.  They don't get very loud, which is just as well; more volume would only distort.","rating":4},{"id":"R1KWPS7T7I5KTT","title":"I love this laptop","text":"I love this laptop. Today's the first day I received it and it's running really smooth. Boots up fast, processes whatever user commands I put in fast, and overall just feels great. For now, I love this laptop, hopefully it stays that way.","rating":4},{"id":"R27V33842FTIFL","title":"1/2 Price Macbook","text":"The UX330UA* is the best $700 Mac replacements. (Feb 2017)For reference, mine arrived with these specs. i5-7200U processor, Intel HD 620 graphics, Intel WiFi card. The ASUS and Amazon websites had different listing at the time of purchase.Yes, the screen will wobble slightly if you bump it. It doesn't really bother me at all.Yes, the brushed aluminum color has an ever so slight tinge of pink. It doesn't bother me.Yes, the screen brightness could be a little higher. It doesn't bother me.The fan is noticeable, but not annoying.  It really depends on your preference. You definitely won't hear it in a loud coffee shop. In a you-could-hear-a-pin-drop library, you will. I personally don't mind it.*And UX330CA, fanless version","rating":5},{"id":"R2C0UMSLJ06HUW","title":"Recommended laptop","text":"Great laptop for a relatively good price- I did get this product during the Christmas season so the prices may differ. However, there was a small issue with accessing some of the initial programs the Zenbook promised, the ASUS Splendid. But I contacted the ASUS support and customer services made an exception and allowed me to send the laptop back -free of charge- and fixed the issue.Overall this is a simple but effective laptop for students - I am a senior high school student and I am hoping this laptop will last until the senior year of college.Pros:Extremely lightFingerprint lock7th Gen Core i5Has a SSD- good for gaming (apparently)Cons:Possibly defective - but easy fix when you contact ASUS supportKeyboard feels light - not enough weightHave limited ports (no HDMI port but you can easily purchase a converter)No CD drive*only had this laptop for a couple of weeks","rating":4},{"id":"R196BZNOH7FIWZ","title":"From Mac book pro to this: love my choice","text":"Switched from mac book pro to this, love my choice. I setup dual-boot with Ubuntu 16.10 which works great/flawlessly out of the box. Great battery life; lovely illuminated keyboard; starts/resumes fast; perfect size.I use this laptop for development work, marginal memory constraints (8 GB) but it's fine.l carry it with me everywhere!","rating":5},{"id":"R3V9IPGOQI0H9S","title":"Affordable and dependable!","text":"This laptop is definitely light and pretty to look at. I love the color and the styling. In terms of ease of use it's great, very quick to load, able to switch between programs without pause and the matte screen is so great especially outdoors. The brightness has been fantastic and I enjoy the ability to switch between keyboard brightness levels.There are a few items that I'd like to highlight though as they might give others pause.-Fan noise is very real when under stress. Under a light load there has been no issue, but if I'm in-between multiple tasks such as video-calling while working on Excel there is a very audible fan noise.-Speaker placement is on the bottom of the laptop. As such, if you're using the laptop on a desk or flat surface there is no issue with sound. However, once removed from a flat surface the sound quality drops quite a bit.-Tilt of laptop screen is not as far back or pronounced as I'm used to. While it hasn't been an inconvenience for myself, I could see it being an issue with other folks.Other than those items, I love my purchase. I would definitely recommend it to others like myself looking for a lightweight, easy to use and more affordable Ultrabook option.","rating":4},{"id":"R1GQCAPSV43CNW","title":"In my opinion this is the best laptop per dollar available","text":"I did a lot of research leading up to my purchase and it paid off. In my opinion this is the best laptop per dollar available. + Super light weight, unbelievable battery life, great track pad, fingerprint login, very slim, powerful - \"only\" full HD","rating":5},{"id":"R1O1HYJXPHVIMP","title":"Five Stars","text":"Great little laptop for traveling.  Extra thin and light.","rating":5},{"id":"RYKKSFEZEIBIL","title":"Bravo Amazon.  Booooooo Asus.","text":"Opened it up.  It is thin.  They keyboard seems surprisingly similar to by Lenovo X1 Carbon keyboard (which is the best I've ever had).On first attempt at setup, it got to the step to set up Windows Hello.  And then, black screen.Second attempt, it got through the Customize Settings page.Third/fourth/fifth/... attempts, same as the second...From what I understand, this is a known issue.I called Amazon.  After a grand total of 9 minutes, they are sending me a return label and next-day shipping a replacement--which I hope works.Bravo Amazon.  Booooooo Asus.","rating":1},{"id":"RFZZKHH88BHJ1","title":"Really love the feel and the light weight","text":"I did a few reviews and was really excited about buying this laptop. I even bought a protection plan for three years with it.  It arrived on time and I was excited upon looking at. Really love the feel and the light weight. Plugged it up your prompt me to sign into my Microsoft account and then the whole screen went black and only the cursor displayed. I was hoping that it corrected itself. Damn it never did. Amazon customer service was excellent and offered to replace or give me my full refund. I chose a full refund because my spirit was broke.","rating":1},{"id":"R2EFWMER62URH5","title":"Off to a bad start","text":"Well i should have read the reviews my computer screen also went completely black during my first power on. I solved the issue my holding the power button and rebooting the system which thankfully worked. Also like others the fan is a little too loud definitely louder than my 5year old XPS 13","rating":3},{"id":"RLHGDNEEAJE02","title":"A good laptop for the price (once my DoA laptop got replaced)","text":"UPDATE: Amazon sent me a new laptop and I've revised the review to give it 4 stars since the new one actually works.  The only reason I'm not giving it 5 stars is that the battery gets nowhere near 10-12 hours with standard websurfing and word processing.  Also, the hinge is a little weird in how far back the lid is able to open.  Not terrible, but odd.  Finally, the keyboard is a little mushy... though the size/placement of the keys is nice.  Overall, I'd say this is a good laptop for the price.  Still, I pray that I never have to talk to ASUS tech support again, as I fear it would be as painful as the first time.ORIGINAL REVIEW: The laptop arrived and could not get past the third screen of the Windows 10 first-boot process without crashing/restarting.  Thankfully, Amazon is taking it back and sending me a new one.  Read on for what actually happened.On first boot, the laptop kept rebooting when clicking \"Next\" and then would just start over (one time I even got a pink background in a set-up screen process instead of the typical blue background).  I called ASUS and got a rep who wasn't very knowledgeable.  She wanted me to go into the Start menu to find the Windows recovery options, which means she wasn't listening... because you can't get to the Start menu if Windows can't even set itself up for first use.  Then she told me how to get into the Windows recovery mode on power-up, by pressing F9 repeatedly.  I did this several times and it didn't work.  I asked her if I should hold down the Fn key while pressing F9, since the laptop Fn keys are shared with other functions.  She said that wasn't necessary.  So, I ignored her on the third try and held down the Fn key... magically it worked.  So far, ASUS support was batting zero.  Once into the recovery mode screens, I tried the full-wipe/reinstall Windows recovery option per ASUS support... and then the laptop said that Windows could not be reinstalled for an unknown reason.  I call that dead on arrival.I'll post an updated review once I get to try it out (assuming this is just one bad apple).","rating":4},{"id":"R2DQ71A8ULWGSC","title":"A quality product at an excellent price.","text":"A well built unit that performs very well, and is very reasonably priced at $700.  The touch pad is sensitive and understands very useful gestures. The screen is pleasing to look at.  Battery life is excellent.  A great travel machine that can be a desktop replacement.  Streams media VERY well.  Speakers sound good.  One criticism is you can't push the display back beyond 110 degrees but this is a relatively minor drawback.  It was this vs the Dell XPS 13.  The Dell is lovely but I don't need the touch screen and a similarly configured unit costs 2.5 times more.  Granted the Dell high end screen is outstanding but I plan to travel with this unit and if it gets lost or stolen I won't cry.  Actually I will cry but not from the cost. :)  Cutting to the chase, a quality product at an excellent price.  B&H Photo has the 500 GB SSD version for $100 more and no tax.  Might want to check that out. Amazon charged me sales tax :(","rating":5},{"id":"R35O1MRDHA6FPT","title":"Perfect for college","text":"I am so glad I decided to purchase this laptop. It is lightweight and easy to carry in my backpack. The battery holds very well, I only charge it once or twice a week and I use it daily. I was deciding between this computer and a mac, but because of the price difference I chose this and I am thankful I did. Overall, it is very similar to a mac besides the price. This laptop is perfect for college, I would recommend it to anyone!","rating":5},{"id":"R1H73K20JGUQSN","title":"Amazing sexy, light and fast laptop under $700","text":"What an awesome everyday laptop for $700. The build and fit and finish is amazing. The small light weight form factor is so sexy and appealing. Runs cool and quiet with very little fan noise. Been using every day and averaging 9-10 hours of battery life keeping screen brightness under 80%.  Pretty fast with Kaby lake processor.  Keyboard and precision trackpad are nice especially with quick finger print scanner.  Keyboard lighting has 3 intensity levels.  Screen is nice and bright with matte finish which I love.  No problems with bluetooth or wifi connectivity. Highly recommend! Going to buy another for my Fiance.","rating":5},{"id":"RCFGZ7L37XWD0","title":"Affordable, quality, and suuuuuper good looking","text":"Don't listen to the haters. This is as nice as it gets for < $700 (I bought mine at $679).Pros:- Keyboard is 99% of a MacBook Pro's- Trackpad is 97% of a MacBook Pro's- Screen is better than a MacBook Air- Build Quality is 95% of a MBP, but arguably better in some ways given the cold wrist wrest of the macbooks which I never liked.- Battery is better than MBP and MBA- Backlit keyboard- Fast CPU- 50-60% of the cost of a MBP or MBACons:- Some plastic in the build, but honestly compared to the MBP I used before this it's a more comfortable wrist wrest than the cold aluminum of a MacBook's- Would have liked option for 16GB RAM, but 8 is still good enough for what I do (I'm a software developer)It's thin, light, and looks amazing. I love carrying it around, and regularly get \"what kind of laptop is that?\". I use an XPS 13 at work, and while I'd argue that's a better laptop, it's hard to justify the $400-$500 extra.If money is no object, get yourself an XPS 13, if you have to have a mac and don't really care that apple isn't evolving that in a way that is cool or valuable - get a macbook. Everyone else should pick this up instead, it's am amazing value.","rating":5},{"id":"R1NACHWWVZB860","title":"Really nice travel laptop.  Had to upgrade Win 10 Home to Pro.","text":"Really nice, light laptop.  I can't do \"real work\" on this, because the 12.5\" screen doesn't have enough real estate for my 50-year-old-eyes.  It is solid and super-light.  Great for people like me that aren't ever really away from work, and even on vacation need an emergency laptop.  The CPU's 2 hyperthreaded cores have plenty of power for everything you'd be doing in this tiny 2-pounder.  Not a gamer laptop.  My only complaints are (1) Windows 10 Home is mostly useless for business (no bitlocker), you have to count on spending $99 to upgrade (2) as with many laptops the touch pad is way too sensitive and thinks I am tapping when I am not, although there are probably adjustments I can make in that regard.","rating":4},{"id":"RGLAS5Y7OQKSP","title":"Zenbook UX330UA-AH54 Review","text":"I've been using this ultrabook for about a day now and I love it. As many reviews have stated it is pretty much a Macbook Air clone with better specs and half the price. The finish has a very premium feel. My experience with this laptop has been very positive so far.The new i5 kaby lake performed very well. It handled twitch streaming together with installing applications in the background without any hiccup. Loading from POST to window was also very quick. I was very impressed as it load just as quick as my custom built desktop with an i7 6700k CPU and Samsung 850 EVO SSD.  I've read a lot of reviews about Asus trackpad not as good compare to XPS and MBA but to be honest if you expect to get precision down to the pixel then you should probably be using a real mouse. The trackpad works fine for me. It goes where I want it to and click when needed to. The keyboard is very comfortable to type on and really happy to have the adjustable LED lit keys.The 1920 x 1080 IPS matte display is also very good. The color production and viewing angle is mazing. A little too saturated for my taste but you can adjust that. The Harman/Kardon downward firing speakers are pretty good especially in a laptop this thin. Asus advertised 12 hours battery life, but from my usage (brightness at 70%, twitch streaming, youtube, netflix, web browsing) the battery lasted about 7-8 hours. However I did have my power plan set at High Performance. I think it might possible to get 12 hours or close if you lower the screen brightness a bit more and use the battery saver power plan.One other thing I was pleasantly surprised with was this laptop came with almost no bloatware at all. Asus only loaded the necessary software for the notebook to function properly (Trackpad gesture, Fn keys, and intel stuff). The only thing I had to uninstall was Microsoft Office 360, but to some this might not be bloatware. They didn't even install any of the Asus utilities software (Splendid View, Sonic Suite, AI Suite, etc.) and leave it up to the user to download and install from their support site.Overall, this was a great purchase for me. The price, quality, and performance this ultrabook offers is just not comparable by any other notebook right now. Asus is one of the top computer components manufacturer and my last Asus laptop served me so well so I am happy that their ultrabook also has that same quality.","rating":5}]